{
    "banded": {
        "coarse_description": [
            "Distinct parallel bands of alternating colors or patterns are a unique visual cue of a banded texture.",
            "A banded texture is characterized by distinct parallel lines or stripes, unlike other types of texture.",
            "A banded texture is characterized by the presence of parallel stripes or bands across its surface.",
            "A banded texture is visually distinguished by the presence of distinct, parallel bands or stripes on the surface.",
            "A banded texture typically consists of alternating smooth and rough bands or stripes on its surface."
        ],
        "fine_description": [
            "A banded texture consists of parallel bands of different colors or patterns, distinct from uniform stripes or lines.",
            "A banded texture exhibits parallel bands of different colors or patterns, while striped or lined appearance refers to parallel lines.",
            "A banded texture consists of distinct, parallel bands that vary in color, width, or texture.",
            "A banded texture is characterized by distinct, parallel bands or stripes with varying widths.",
            "A banded texture typically consists of distinct, parallel bands with varying colors, widths, or patterns."
        ],
        "overall_description": [
            "A banded texture is characterized by distinct parallel bands of alternating colors or patterns, which differentiate it from uniform stripes or lines.",
            "Banded texture refers to a distinct pattern of parallel lines or stripes, displaying different colors or patterns within these bands.",
            "A banded texture is defined by the presence of parallel stripes or bands with variations in color, width, or texture across its surface.",
            "Banded texture is visually characterized by distinct, parallel bands or stripes on the surface, with varying widths.",
            "A banded texture is characterized by alternating smooth and rough bands or distinct parallel bands with varying colors, widths, or patterns."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "distinct parallel bands"
                },
                {
                    "A": "bands",
                    "R": "of",
                    "B": "alternating colors or patterns"
                },
                {
                    "A": "texture",
                    "R": "differentiate",
                    "B": "from uniform stripes or lines"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "refers to",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "displays",
                    "B": "colors"
                },
                {
                    "A": "pattern",
                    "R": "displays",
                    "B": "patterns"
                },
                {
                    "A": "bands",
                    "R": "within",
                    "B": "pattern"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is defined by",
                    "B": "presence of parallel stripes or bands with variations in color, width, or texture across its surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "visually characterized by",
                    "B": "distinct, parallel bands or stripes"
                },
                {
                    "A": "bands or stripes",
                    "R": "on the surface",
                    "B": "with varying widths"
                }
            ],
            [
                {
                    "A": "banded texture",
                    "R": "characterized by",
                    "B": "alternating smooth and rough bands or distinct parallel bands with varying colors, widths, or patterns"
                }
            ]
        ]
    },
    "blotchy": {
        "coarse_description": [
            "Irregular patches or uneven distribution of color or pattern is a unique visual cue for a blotchy texture.",
            "A blotchy texture has irregular patches or spots that vary in color or intensity, unlike other types of texture.",
            "A blotchy texture appears as irregular patches or spots on a surface, creating an uneven and mottled appearance.",
            "A blotchy texture appears as irregular patches or spots on a surface, differentiating it from other types of textures.",
            "A blotchy texture typically has uneven patches or irregular marks on its surface."
        ],
        "fine_description": [
            "Blotchy texture is characterized by irregular and uneven patches or spots scattered throughout the surface.",
            "Blotchy texture refers to an uneven pattern with irregular patches or spots, while flecked and pitted appearance suggests small, scattered specks and indentations.",
            "A blotchy texture is characterized by irregular patches or spots of varying sizes and shapes on a surface.",
            "A blotchy texture appears uneven and irregular, with irregularly shaped patches or splotches spread across the surface.",
            "A blotchy texture is characterized by uneven and irregular patches or splotches on its surface."
        ],
        "overall_description": [
            "Blotchy is a texture with irregular and uneven patches or spots of color or pattern distributed throughout its surface.",
            "Blotchy texture is characterized by irregular patches or spots with varying color or intensity, distinguishing it from other textures, while also displaying an uneven pattern similar to a flecked and pitted appearance.",
            "A blotchy texture is created by irregular patches or spots of varying sizes and shapes, resulting in an uneven and mottled appearance on a surface.",
            "Blotchy refers to an uneven and irregular texture with irregularly shaped patches or spots spread across the surface, distinguishing it from other textures.",
            "Blotchy texture is defined by its uneven and irregular patches or marks, creating an inconsistent and irregular appearance on its surface."
        ],
        "structure": [
            [
                {
                    "A": "Blotchy",
                    "R": "is",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "with",
                    "B": "patches"
                },
                {
                    "A": "patches",
                    "R": "of",
                    "B": "color"
                },
                {
                    "A": "patches",
                    "R": "of",
                    "B": "pattern"
                },
                {
                    "A": "patches",
                    "R": "distributed",
                    "B": "throughout"
                },
                {
                    "A": "texture",
                    "R": "throughout",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "Blotchy texture",
                    "R": "is characterized by",
                    "B": "irregular patches or spots with varying color or intensity"
                },
                {
                    "A": "Blotchy texture",
                    "R": "distinguishing",
                    "B": "it from other textures"
                },
                {
                    "A": "Blotchy texture",
                    "R": "displaying",
                    "B": "an uneven pattern similar to a flecked and pitted appearance"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "created by",
                    "B": "patches"
                },
                {
                    "A": "patches",
                    "R": "of",
                    "B": "sizes"
                },
                {
                    "A": "patches",
                    "R": "of",
                    "B": "shapes"
                },
                {
                    "A": "texture",
                    "R": "resulting in",
                    "B": "appearance"
                },
                {
                    "A": "appearance",
                    "R": "on",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "Blotchy",
                    "R": "refers to",
                    "B": "uneven and irregular texture"
                },
                {
                    "A": "uneven and irregular texture",
                    "R": "with",
                    "B": "irregularly shaped patches or spots"
                },
                {
                    "A": "irregularly shaped patches or spots",
                    "R": "spread across",
                    "B": "the surface"
                },
                {
                    "A": "the surface",
                    "R": "distinguishing",
                    "B": "it from other textures"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "defined by",
                    "B": "patches"
                },
                {
                    "A": "patches",
                    "R": "create",
                    "B": "appearance"
                }
            ]
        ]
    },
    "braided": {
        "coarse_description": [
            "Braided texture is characterized by interwoven strands creating a unique pattern of overlapping and intertwining.",
            "A braided texture appears as interwoven strands, distinct from other textures with smooth, rough, or patterned appearances.",
            "A braided texture is characterized by interwoven strands, creating a distinctive pattern with a three-dimensional and intricately woven look.",
            "A braided texture is visually distinguished by its interwoven strands or strips creating a patterned and textured appearance.",
            "A braided texture typically consists of interwoven strands, creating a visually intricate and tactile surface."
        ],
        "fine_description": [
            "A braided texture consists of three or more strands intertwined together, creating a distinctive, plaited appearance.",
            "Braided texture is created by intertwining strands of material, resulting in a distinctive, interlaced appearance.",
            "A braided texture consists of multiple strands intertwined in an overlapping pattern, creating a distinctive three-dimensional effect.",
            "A braided texture is visually characterized by multiple strands intertwined over and under each other.",
            "A braided texture typically has a three-dimensional and plaited appearance, with intertwined strands creating a rope-like pattern."
        ],
        "overall_description": [
            "Braided texture is a distinctive pattern formed by interwoven strands, creating an overlapping and intertwining appearance with a plaited effect.",
            "Braided texture is characterized by interwoven strands of material, creating a distinctive and interlaced appearance that sets it apart from other textures.",
            "A braided texture is created by interweaving multiple strands in an overlapping pattern, resulting in a distinctive three-dimensional and intricately woven appearance.",
            "Braided texture is visually distinguished by interwoven strands or strips, creating a patterned and textured appearance, with multiple strands intertwined over and under each other.",
            "Braided texture is a visually intricate and tactile surface with interwoven strands, creating a three-dimensional and plaited appearance resembling a rope-like pattern."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is formed by",
                    "B": "strands"
                },
                {
                    "A": "pattern",
                    "R": "is created by",
                    "B": "interwoven strands"
                },
                {
                    "A": "appearance",
                    "R": "is characterized by",
                    "B": "overlapping and intertwining"
                },
                {
                    "A": "effect",
                    "R": "is achieved through",
                    "B": "plaiting"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "interwoven strands of material"
                },
                {
                    "A": "interwoven strands of material",
                    "R": "creating",
                    "B": "distinctive and interlaced appearance"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is created by",
                    "B": "interweaving multiple strands"
                },
                {
                    "A": "strands",
                    "R": "are interweaved in",
                    "B": "overlapping pattern"
                },
                {
                    "A": "pattern",
                    "R": "results in",
                    "B": "distinctive three-dimensional and intricately woven appearance"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is visually distinguished by",
                    "B": "interwoven strands or strips"
                },
                {
                    "A": "interwoven strands or strips",
                    "R": "create",
                    "B": "patterned and textured appearance"
                },
                {
                    "A": "multiple strands",
                    "R": "are intertwined",
                    "B": "over and under each other"
                }
            ],
            [
                {
                    "A": "Braided texture",
                    "R": "is",
                    "B": "visually intricate and tactile surface"
                },
                {
                    "A": "Braided texture",
                    "R": "has",
                    "B": "interwoven strands"
                },
                {
                    "A": "interwoven strands",
                    "R": "create",
                    "B": "three-dimensional and plaited appearance"
                },
                {
                    "A": "three-dimensional and plaited appearance",
                    "R": "resembles",
                    "B": "rope-like pattern"
                }
            ]
        ]
    },
    "bubbly": {
        "coarse_description": [
            "Tiny round air pockets dispersed throughout the surface distinguish a bubbly texture from other types of texture.",
            "A bubbly texture appears with small, round, and raised elements, distinguishing it from other types of textures.",
            "A bubbly texture is characterized by the presence of small, round, and irregularly-shaped air-filled pockets on the surface.",
            "A bubbly texture is visually distinguished by the presence of small, rounded, and irregularly shaped air-filled pockets.",
            "A bubbly texture is characterized by the presence of numerous small, round, and interconnected air-filled pockets on its surface."
        ],
        "fine_description": [
            "A bubbly texture is characterized by the presence of small, round, and irregularly-shaped air pockets or bubbles.",
            "A bubbly texture appears as small, round, and foamy formations, while pitted, bumpy texture has irregular indentations and raised areas.",
            "A bubbly texture appears as a collection of small, round, and evenly spaced raised formations on a surface.",
            "A bubbly texture appears as small, round, and irregularly spaced air-filled pockets on the surface.",
            "A bubbly texture is characterized by the presence of small, round, and irregular air-filled pockets on its surface."
        ],
        "overall_description": [
            "A bubbly texture is identified by the presence of small, round, and irregularly-shaped air pockets or bubbles dispersed throughout its surface.",
            "Bubbly texture is characterized by small, round, raised elements that create a foamy appearance, distinguishing it from pitted or bumpy textures with irregular indentations and raised areas.",
            "Bubbly texture is identified by small, round, and irregularly-shaped air-filled pockets or evenly spaced raised formations on the surface.",
            "Bubbly texture is characterized by the presence of small, rounded, and irregularly spaced air-filled pockets on the surface, visually distinguished by their shape and arrangement.",
            "Bubbly texture is characterized by numerous small, round, irregular, and interconnected air-filled pockets on its surface."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "identified by",
                    "B": "presence"
                },
                {
                    "A": "texture",
                    "R": "identified by",
                    "B": "air pockets"
                },
                {
                    "A": "texture",
                    "R": "identified by",
                    "B": "bubbles"
                },
                {
                    "A": "air pockets",
                    "R": "dispersed throughout",
                    "B": "surface"
                },
                {
                    "A": "bubbles",
                    "R": "dispersed throughout",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "elements"
                },
                {
                    "A": "elements",
                    "R": "create",
                    "B": "appearance"
                },
                {
                    "A": "appearance",
                    "R": "distinguishing",
                    "B": "textures"
                },
                {
                    "A": "textures",
                    "R": "with",
                    "B": "indentations"
                },
                {
                    "A": "indentations",
                    "R": "and",
                    "B": "areas"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is identified by",
                    "B": "air-filled pockets"
                },
                {
                    "A": "texture",
                    "R": "is identified by",
                    "B": "raised formations"
                },
                {
                    "A": "pockets",
                    "R": "are",
                    "B": "small"
                },
                {
                    "A": "pockets",
                    "R": "are",
                    "B": "round"
                },
                {
                    "A": "pockets",
                    "R": "are",
                    "B": "irregularly-shaped"
                },
                {
                    "A": "formations",
                    "R": "are",
                    "B": "evenly spaced"
                },
                {
                    "A": "pockets",
                    "R": "are",
                    "B": "on the surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "presence of small, rounded, and irregularly spaced air-filled pockets"
                },
                {
                    "A": "texture",
                    "R": "is visually distinguished by",
                    "B": "shape and arrangement"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "numerous small, round, irregular, and interconnected air-filled pockets"
                },
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "bubbly"
                }
            ]
        ]
    },
    "bumpy": {
        "coarse_description": [
            "A bumpy texture can be identified by its uneven surface, with irregular and raised elements.",
            "A bumpy texture appears uneven and rough, unlike other textures that are smooth, soft, or patterned.",
            "A bumpy texture is characterized by the presence of irregular, raised surfaces that create a rough and uneven feel.",
            "A bumpy texture is visually distinguished by its uneven surface with raised areas that create a rough and irregular pattern.",
            "A bumpy texture is characterized by irregular, uneven, and raised surface features that create a rough and uneven feel."
        ],
        "fine_description": [
            "A bumpy texture is characterized by irregular, raised areas that create a rough and uneven surface.",
            "A bumpy texture refers to a surface with uneven elevations and depressions, while pitted and potholed appearance indicates visible holes and indentations.",
            "A bumpy texture is characterized by irregular, uneven elevations or protrusions on a surface.",
            "A bumpy texture is characterized by irregular, uneven surfaces that create variations in height and smoothness.",
            "A bumpy texture typically consists of uneven, irregular surface features that create a rough and undulating feel."
        ],
        "overall_description": [
            "Bumpy texture refers to an uneven surface with irregular and raised elements, creating rough and irregular areas.",
            "A bumpy texture is rough and uneven, with visible elevations, depressions, holes, and indentations, distinguishing it from smooth, soft, or patterned textures.",
            "A bumpy texture is created by irregular, raised surfaces or protrusions, resulting in a rough and uneven feel on the surface.",
            "A bumpy texture is visually characterized by an uneven surface with raised areas, creating a rough and irregular pattern, as well as variations in height and smoothness.",
            "Bumpy refers to a texture with irregular, uneven, and raised surface features, creating a rough and undulating feel."
        ],
        "structure": [
            [
                {
                    "A": "Bumpy texture",
                    "R": "refers to",
                    "B": "uneven surface"
                },
                {
                    "A": "uneven surface",
                    "R": "with",
                    "B": "irregular and raised elements"
                },
                {
                    "A": "irregular and raised elements",
                    "R": "creating",
                    "B": "rough and irregular areas"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "rough and uneven"
                },
                {
                    "A": "texture",
                    "R": "has",
                    "B": "visible elevations"
                },
                {
                    "A": "texture",
                    "R": "has",
                    "B": "depressions"
                },
                {
                    "A": "texture",
                    "R": "has",
                    "B": "holes"
                },
                {
                    "A": "texture",
                    "R": "has",
                    "B": "indentations"
                },
                {
                    "A": "texture",
                    "R": "distinguishes",
                    "B": "from smooth, soft, or patterned textures"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is created by",
                    "B": "surfaces"
                },
                {
                    "A": "surfaces",
                    "R": "are irregular",
                    "B": "protrusions"
                },
                {
                    "A": "protrusions",
                    "R": "result in",
                    "B": "feel"
                },
                {
                    "A": "feel",
                    "R": "is",
                    "B": "rough and uneven"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "uneven surface"
                },
                {
                    "A": "uneven surface",
                    "R": "creating",
                    "B": "rough and irregular pattern"
                },
                {
                    "A": "uneven surface",
                    "R": "creating",
                    "B": "variations in height and smoothness"
                }
            ],
            [
                {
                    "A": "Bumpy",
                    "R": "refers to",
                    "B": "a texture with irregular, uneven, and raised surface features"
                },
                {
                    "A": "a texture with irregular, uneven, and raised surface features",
                    "R": "creating",
                    "B": "a rough and undulating feel"
                }
            ]
        ]
    },
    "chequered": {
        "coarse_description": [
            "The unique visual cue of a chequered texture is its distinct pattern of alternating squares or rectangles.",
            "A chequered texture has a pattern of alternating squares, distinguishing it from other textures with varied or smooth surfaces.",
            "A chequered texture is characterized by a pattern of alternating squares or rectangles of contrasting colors or shades.",
            "A chequered texture is visually distinguished by its repeated pattern of alternating squares or rectangles of different colors.",
            "A chequered texture typically consists of a pattern of alternating squares in contrasting colors or shades."
        ],
        "fine_description": [
            "A chequered texture is uniquely characterized by a pattern of alternating squares or rectangles of different colors.",
            "A chequered texture consists of a repeating pattern of squares, while a zigzagged appearance features diagonal lines alternating in direction.",
            "A chequered texture is characterized by a repeating pattern of squares, typically in alternating colors or shades.",
            "A chequered texture is characterized by a pattern of alternating squares in contrasting colors or shades.",
            "A chequered texture typically consists of a repeated pattern of squares or rectangles in contrasting colors or shades."
        ],
        "overall_description": [
            "Chequered is a visually distinctive texture characterized by a pattern of alternating squares or rectangles, which can be of different colors.",
            "Chequered textures are characterized by a repeating pattern of alternating squares, distinguishing them from other textures with varied or smooth surfaces, and contrasting with zigzagged appearances featuring diagonal lines alternating in direction.",
            "A chequered texture is defined by a recurring pattern of contrasting colored squares or rectangles, creating a distinct visual appearance.",
            "Chequered texture is visually distinguished by a repeated pattern of alternating squares or rectangles in contrasting colors or shades.",
            "A chequered texture is characterized by a repeated pattern of alternating squares or rectangles in contrasting colors or shades."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "consists of",
                    "B": "squares or rectangles"
                },
                {
                    "A": "squares or rectangles",
                    "R": "can be of",
                    "B": "different colors"
                }
            ],
            [
                {
                    "A": "textures",
                    "R": "are characterized by",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "distinguishing",
                    "B": "textures"
                },
                {
                    "A": "textures",
                    "R": "distinguishing",
                    "B": "surfaces"
                },
                {
                    "A": "textures",
                    "R": "contrasting with",
                    "B": "appearances"
                },
                {
                    "A": "appearances",
                    "R": "featuring",
                    "B": "lines"
                },
                {
                    "A": "lines",
                    "R": "alternating in",
                    "B": "direction"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "defined by",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "consists of",
                    "B": "squares or rectangles"
                },
                {
                    "A": "squares or rectangles",
                    "R": "create",
                    "B": "appearance"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is distinguished by",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "consists of",
                    "B": "squares or rectangles"
                },
                {
                    "A": "squares or rectangles",
                    "R": "are in",
                    "B": "colors or shades"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "consists of",
                    "B": "squares or rectangles"
                },
                {
                    "A": "squares or rectangles",
                    "R": "are in",
                    "B": "colors or shades"
                }
            ]
        ]
    },
    "cobwebbed": {
        "coarse_description": [
            "The unique visual cue of a cobwebbed texture is the presence of intricate, interconnected, thread-like structures.",
            "Cobwebbed texture appears as fine, intricate, and delicate strands resembling spiderwebs, distinguishing it from other textures.",
            "A cobwebbed texture is characterized by fine, delicate threads that intersect and form irregular patterns resembling spider webs.",
            "A cobwebbed texture is visually distinguished by its intricate and delicate pattern resembling the strands of a spider's web.",
            "A cobwebbed texture typically has a delicate, intricate, and sticky surface, resembling a spider's web."
        ],
        "fine_description": [
            "The cobwebbed texture is characterized by delicate, thin strands forming a tangled and intricate pattern.",
            "A cobwebbed texture typically appears delicate and tangled, resembling a disorganized, intricate web made of fine threads.",
            "A cobwebbed texture is characterized by thin, delicate, and irregular threads forming a tangled and intricate pattern.",
            "A cobwebbed texture appears as a delicate, intricate network of thin and wispy strands.",
            "A cobwebbed texture typically consists of thin, delicate strands that are intricately woven and entangled."
        ],
        "overall_description": [
            "Cobwebbed is a texture with intricate, interconnected thread-like structures forming a tangled and delicate pattern.",
            "Cobwebbed texture is characterized by delicate, intricate strands resembling spiderwebs, appearing tangled and disorganized, made of fine threads.",
            "A cobwebbed texture is formed by fine, delicate, thin, and irregular threads that intersect and create intricate and tangled patterns resembling spider webs.",
            "Cobwebbed texture is a visually intricate and delicate network of thin and wispy strands, resembling the intricate pattern of a spider's web.",
            "A cobwebbed texture is characterized by delicate, intricate, and sticky strands that are intricately woven and entangled, resembling a spider's web."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "cobwebbed"
                },
                {
                    "A": "structures",
                    "R": "forming",
                    "B": "thread-like"
                },
                {
                    "A": "structures",
                    "R": "forming",
                    "B": "intricate"
                },
                {
                    "A": "structures",
                    "R": "forming",
                    "B": "interconnected"
                },
                {
                    "A": "structures",
                    "R": "forming",
                    "B": "tangled"
                },
                {
                    "A": "structures",
                    "R": "forming",
                    "B": "delicate"
                },
                {
                    "A": "texture",
                    "R": "with",
                    "B": "structures"
                },
                {
                    "A": "structures",
                    "R": "forming",
                    "B": "pattern"
                }
            ],
            [],
            [
                {
                    "A": "texture",
                    "R": "is formed by",
                    "B": "threads"
                },
                {
                    "A": "threads",
                    "R": "intersect and create",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "resembling",
                    "B": "spider webs"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "network"
                },
                {
                    "A": "network",
                    "R": "resembling",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "of",
                    "B": "web"
                }
            ],
            [
                {
                    "A": "cobwebbed texture",
                    "R": "is characterized by",
                    "B": "delicate, intricate, and sticky strands"
                },
                {
                    "A": "delicate, intricate, and sticky strands",
                    "R": "are intricately woven and entangled, resembling",
                    "B": "a spider's web"
                }
            ]
        ]
    },
    "cracked": {
        "coarse_description": [
            "A unique visual cue of a cracked texture is the presence of irregular and fragmented lines or patterns.",
            "A cracked texture has visible fissures or fractures on the surface, distinguishing it from other types of textures.",
            "A cracked texture is characterized by irregular, fragmented lines or fissures that break the surface, creating a fragmented appearance.",
            "A cracked texture is visually distinguished by irregular lines or fissures that appear on the surface.",
            "A cracked texture typically has irregular and fragmented surfaces with visible lines or fissures."
        ],
        "fine_description": [
            "A cracked texture appears as irregular, jagged lines or fissures on the surface, distinguishing it from pitted or lined textures.",
            "A cracked texture consists of small splits or fissures on the surface, resembling a broken pattern.",
            "A cracked texture is characterized by visible splits or fractures on the surface, creating irregular patterns.",
            "A cracked texture appears as distinct, irregular lines or fissures on the surface, resembling broken fragments.",
            "A cracked texture typically has irregular, jagged lines or fissures on its surface."
        ],
        "overall_description": [
            "Cracked textures exhibit irregular and fragmented lines or fissures on the surface, distinguishing them from pitted or lined textures.",
            "A cracked texture is characterized by visible fissures or fractures on the surface, resembling a broken pattern or small splits.",
            "A cracked texture is characterized by irregular, fragmented lines or fissures that break the surface, creating visible splits, fractures, and irregular patterns.",
            "A cracked texture is characterized by distinct, irregular lines or fissures resembling broken fragments that visually appear on the surface.",
            "A cracked texture is characterized by irregular and fragmented surfaces with visible lines or fissures, often appearing jagged in nature."
        ],
        "structure": [
            [
                {
                    "A": "textures",
                    "R": "exhibit",
                    "B": "lines"
                },
                {
                    "A": "textures",
                    "R": "exhibit",
                    "B": "fissures"
                },
                {
                    "A": "textures",
                    "R": "distinguishing",
                    "B": "them"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "fissures or fractures"
                },
                {
                    "A": "surface",
                    "R": "resembling",
                    "B": "broken pattern or small splits"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "cracked texture"
                },
                {
                    "A": "lines or fissures",
                    "R": "break",
                    "B": "surface"
                },
                {
                    "A": "splits, fractures, and irregular patterns",
                    "R": "creating",
                    "B": "visible splits, fractures, and irregular patterns"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "distinct, irregular lines or fissures"
                },
                {
                    "A": "lines or fissures",
                    "R": "resembling",
                    "B": "broken fragments"
                },
                {
                    "A": "broken fragments",
                    "R": "visually appear on",
                    "B": "the surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "cracked"
                },
                {
                    "A": "surfaces",
                    "R": "with visible lines or fissures",
                    "B": "irregular and fragmented"
                },
                {
                    "A": "nature",
                    "R": "often appearing jagged in",
                    "B": "irregular and fragmented"
                }
            ]
        ]
    },
    "crosshatched": {
        "coarse_description": [
            "A crosshatched texture is characterized by intersecting lines that create a series of small diamond-shaped patterns.",
            "A crosshatched texture appears as a pattern of intersecting lines, distinguishing it from other types of textures.",
            "A crosshatched texture is characterized by intersecting parallel lines that create a grid-like pattern on a surface.",
            "A crosshatched texture is distinguished visually by its pattern of intersecting lines that create a grid-like appearance.",
            "A crosshatched texture is characterized by intersecting lines or marks that create a grid-like pattern on the surface."
        ],
        "fine_description": [
            "A crosshatched texture is characterized by intersecting lines forming a grid-like pattern, distinguishing it from other textures.",
            "A crosshatched texture is characterized by intersecting lines, creating a pattern resembling a series of crisscrossing strokes.",
            "A crosshatched texture is characterized by intersecting lines forming a series of small, evenly spaced squares or diamonds.",
            "A crosshatched texture is characterized by closely spaced, intersecting lines that create a series of small diamonds or squares.",
            "A crosshatched texture consists of closely spaced parallel lines intersecting at right angles, creating a grid-like pattern."
        ],
        "overall_description": [
            "Crosshatched refers to a texture with intersecting lines forming small diamond-shaped patterns or a grid-like pattern, setting it apart from other textures.",
            "Crosshatched texture is a distinctive pattern formed by intersecting lines, resembling crisscrossing strokes, setting it apart from other textures.",
            "Crosshatched is a texture defined by intersecting parallel lines that form a grid pattern or a series of evenly spaced squares or diamonds.",
            "A crosshatched texture is visually distinguished by closely spaced, intersecting lines that create a grid-like appearance with a series of small diamonds or squares.",
            "Crosshatched refers to a grid-like pattern created by intersecting, closely spaced parallel lines that are aligned at right angles."
        ],
        "structure": [
            [
                {
                    "A": "Crosshatched",
                    "R": "refers to",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "forming",
                    "B": "intersecting lines"
                },
                {
                    "A": "intersecting lines",
                    "R": "forming",
                    "B": "small diamond-shaped patterns"
                },
                {
                    "A": "intersecting lines",
                    "R": "forming",
                    "B": "a grid-like pattern"
                },
                {
                    "A": "texture",
                    "R": "setting apart from",
                    "B": "other textures"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "formed by",
                    "B": "lines"
                },
                {
                    "A": "lines",
                    "R": "intersecting",
                    "B": "lines"
                },
                {
                    "A": "lines",
                    "R": "resembling",
                    "B": "strokes"
                },
                {
                    "A": "texture",
                    "R": "setting apart from",
                    "B": "other textures"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "defined by",
                    "B": "intersecting parallel lines"
                },
                {
                    "A": "intersecting parallel lines",
                    "R": "form",
                    "B": "grid pattern"
                },
                {
                    "A": "grid pattern",
                    "R": "or",
                    "B": "series of evenly spaced squares"
                },
                {
                    "A": "grid pattern",
                    "R": "or",
                    "B": "series of evenly spaced diamonds"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is visually distinguished by",
                    "B": "lines"
                },
                {
                    "A": "lines",
                    "R": "create",
                    "B": "appearance"
                },
                {
                    "A": "appearance",
                    "R": "with",
                    "B": "diamonds"
                },
                {
                    "A": "appearance",
                    "R": "with",
                    "B": "squares"
                }
            ],
            [
                {
                    "A": "pattern",
                    "R": "refers to",
                    "B": "grid-like"
                },
                {
                    "A": "pattern",
                    "R": "created by",
                    "B": "intersecting"
                },
                {
                    "A": "lines",
                    "R": "parallel",
                    "B": "spaced"
                },
                {
                    "A": "lines",
                    "R": "aligned at",
                    "B": "right angles"
                }
            ]
        ]
    },
    "crystalline": {
        "coarse_description": [
            "Distinctive sharp edges and flat surfaces, resembling geometric patterns, are unique visual cues of a crystalline texture.",
            "A crystalline texture appears as a regular and geometric pattern, distinct from other textures that lack this ordered arrangement.",
            "A crystalline texture is characterized by the presence of well-defined and regularly arranged geometric shapes within a material.",
            "A crystalline texture is characterized by a regular arrangement of geometric shapes with distinct edges and flat surfaces.",
            "A crystalline texture typically exhibits a smooth and regular surface with distinct patterns or facets."
        ],
        "fine_description": [
            "A crystalline texture is characterized by the presence of distinct, symmetrical patterns formed by crystal structures.",
            "A crystalline texture refers to a structured arrangement of atoms or molecules in a repeating pattern.",
            "A crystalline texture appears as a regular arrangement of atoms or molecules forming geometric patterns.",
            "A crystalline texture appears as a regular arrangement of geometric shapes, resembling a symmetrical lattice pattern.",
            "A crystalline texture typically exhibits a smooth and regular pattern of closely packed repeating geometric shapes."
        ],
        "overall_description": [
            "Crystalline objects exhibit unique visual cues such as sharp edges, flat surfaces, and symmetrical patterns formed by crystal structures.",
            "Crystalline refers to a regular and geometric pattern of atoms or molecules, creating a distinct texture that is different from other unordered arrangements.",
            "A crystalline texture is a regular arrangement of atoms or molecules forming well-defined geometric shapes within a material.",
            "Crystalline objects display a regular arrangement of geometric shapes with distinct edges and flat surfaces, resembling a symmetrical lattice pattern.",
            "Crystalline objects have a smooth and regular surface with distinct patterns or facets, formed by closely packed repeating geometric shapes."
        ],
        "structure": [
            [
                {
                    "A": "Crystalline objects",
                    "R": "exhibit",
                    "B": "unique visual cues"
                },
                {
                    "A": "unique visual cues",
                    "R": "such as",
                    "B": "sharp edges"
                },
                {
                    "A": "unique visual cues",
                    "R": "such as",
                    "B": "flat surfaces"
                },
                {
                    "A": "unique visual cues",
                    "R": "such as",
                    "B": "symmetrical patterns"
                },
                {
                    "A": "symmetrical patterns",
                    "R": "formed by",
                    "B": "crystal structures"
                }
            ],
            [
                {
                    "A": "Crystalline",
                    "R": "refers to",
                    "B": "pattern of atoms or molecules"
                },
                {
                    "A": "pattern of atoms or molecules",
                    "R": "creating",
                    "B": "distinct texture"
                },
                {
                    "A": "distinct texture",
                    "R": "is different from",
                    "B": "other unordered arrangements"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "arrangement"
                },
                {
                    "A": "arrangement",
                    "R": "forming",
                    "B": "shapes"
                },
                {
                    "A": "shapes",
                    "R": "within",
                    "B": "material"
                }
            ],
            [],
            [
                {
                    "A": "Crystalline objects",
                    "R": "have",
                    "B": "smooth and regular surface"
                },
                {
                    "A": "surface",
                    "R": "formed by",
                    "B": "closely packed repeating geometric shapes"
                },
                {
                    "A": "surface",
                    "R": "have",
                    "B": "distinct patterns or facets"
                }
            ]
        ]
    },
    "dotted": {
        "coarse_description": [
            "The unique visual cue of a dotted texture is the presence of small, evenly spaced circular marks or dots.",
            "A dotted texture appears as a pattern of small, evenly spaced dots, distinguishing it from other types of texture.",
            "A dotted texture is characterized by the presence of small, evenly spaced circular or oval-shaped marks.",
            "A dotted texture is characterized by the presence of small, evenly spaced circular or oval-shaped marks.",
            "A dotted texture typically consists of small, evenly spaced circular marks or dots on its surface."
        ],
        "fine_description": [
            "A dotted texture consists of small round marks or dots evenly spaced apart.",
            "A dotted texture consists of small, evenly spaced dots, while flecked and polka-dotted appearances have irregularly scattered dots.",
            "A dotted texture is characterized by small, evenly spaced round marks that create a pattern.",
            "A dotted texture consists of small, evenly spaced circular marks without any irregularities or patterns.",
            "A dotted texture is characterized by the presence of small, evenly spaced dots on its surface."
        ],
        "overall_description": [
            "A dotted texture is characterized by small, evenly spaced circular marks or dots, creating a unique visual cue.",
            "A dotted texture is characterized by small, evenly spaced dots, differentiating it from other textures, including flecked and polka-dotted appearances with irregularly scattered dots.",
            "A dotted texture is characterized by the presence of small, evenly spaced circular or oval-shaped marks that create a pattern.",
            "A dotted texture is characterized by small, evenly spaced circular or oval-shaped marks without any irregularities or patterns.",
            "A dotted texture is defined by the presence of small, evenly spaced circular marks or dots on its surface."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "marks"
                },
                {
                    "A": "marks",
                    "R": "creating",
                    "B": "cue"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "dots"
                },
                {
                    "A": "texture",
                    "R": "differentiating from",
                    "B": "other textures"
                },
                {
                    "A": "textures",
                    "R": "including",
                    "B": "flecked and polka-dotted appearances"
                },
                {
                    "A": "flecked and polka-dotted appearances",
                    "R": "with",
                    "B": "irregularly scattered dots"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "presence of small, evenly spaced circular or oval-shaped marks"
                },
                {
                    "A": "marks",
                    "R": "create",
                    "B": "pattern"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "marks"
                },
                {
                    "A": "marks",
                    "R": "without",
                    "B": "irregularities"
                },
                {
                    "A": "marks",
                    "R": "without",
                    "B": "patterns"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is defined by",
                    "B": "presence of marks"
                },
                {
                    "A": "marks",
                    "R": "are",
                    "B": "dots"
                },
                {
                    "A": "dots",
                    "R": "are on",
                    "B": "surface"
                }
            ]
        ]
    },
    "fibrous": {
        "coarse_description": [
            "Fibrous texture is characterized by long and thread-like strands that appear interconnected, creating a linear and stringy appearance.",
            "A fibrous texture appears stringy or thread-like, unlike other textures that may be smooth, rough, or bumpy.",
            "A fibrous texture is characterized by thin, thread-like structures arranged in a loose or interwoven pattern.",
            "A fibrous texture is visually characterized by the presence of fine, thread-like strands or fibers.",
            "A fibrous texture typically has thin and elongated strands or threads that create a soft and fine surface."
        ],
        "fine_description": [
            "A fibrous texture typically consists of thin, thread-like strands that appear loose and disorganized.",
            "A fibrous texture is characterized by thin, elongated strands or filaments that are closely packed together.",
            "A fibrous texture is characterized by thin, elongated and randomly arranged strands or filaments.",
            "A fibrous texture is characterized by thin, elongated strands or threads that appear loose and unstructured.",
            "A fibrous texture typically has thin, thread-like strands that create a soft and delicate surface."
        ],
        "overall_description": [
            "Fibrous texture is characterized by long, thread-like strands that appear interconnected, creating a linear, stringy, loose, and disorganized appearance.",
            "Fibrous texture is stringy, thread-like, thin, elongated strands closely packed together, distinguishing it from smooth, rough, or bumpy textures.",
            "A fibrous texture is characterized by thin, thread-like structures that are elongated, randomly arranged, and either loosely or interwoven in pattern.",
            "Fibrous texture is visually characterized by the presence of fine, thin, elongated strands or threads that appear loose and unstructured.",
            "A fibrous texture is characterized by thin and elongated strands or threads, creating a soft and delicate surface."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "strands"
                },
                {
                    "A": "strands",
                    "R": "appear",
                    "B": "interconnected"
                },
                {
                    "A": "strands",
                    "R": "create",
                    "B": "appearance"
                },
                {
                    "A": "appearance",
                    "R": "is",
                    "B": "linear"
                },
                {
                    "A": "appearance",
                    "R": "is",
                    "B": "stringy"
                },
                {
                    "A": "appearance",
                    "R": "is",
                    "B": "loose"
                },
                {
                    "A": "appearance",
                    "R": "is",
                    "B": "disorganized"
                }
            ],
            [
                {
                    "A": "Fibrous texture",
                    "R": "is",
                    "B": "stringy"
                },
                {
                    "A": "Fibrous texture",
                    "R": "is",
                    "B": "thread-like"
                },
                {
                    "A": "Fibrous texture",
                    "R": "is",
                    "B": "thin"
                },
                {
                    "A": "Fibrous texture",
                    "R": "is",
                    "B": "elongated strands"
                },
                {
                    "A": "Fibrous texture",
                    "R": "is",
                    "B": "closely packed together"
                },
                {
                    "A": "Fibrous texture",
                    "R": "distinguishing",
                    "B": "it"
                },
                {
                    "A": "Fibrous texture",
                    "R": "from",
                    "B": "smooth textures"
                },
                {
                    "A": "Fibrous texture",
                    "R": "from",
                    "B": "rough textures"
                },
                {
                    "A": "Fibrous texture",
                    "R": "from",
                    "B": "bumpy textures"
                }
            ],
            [
                {
                    "A": "fibrous texture",
                    "R": "is characterized by",
                    "B": "thin, thread-like structures"
                },
                {
                    "A": "thin, thread-like structures",
                    "R": "are elongated, randomly arranged, and either loosely or interwoven in",
                    "B": "pattern"
                }
            ],
            [
                {
                    "A": "Fibrous texture",
                    "R": "is visually characterized by",
                    "B": "presence of fine, thin, elongated strands or threads"
                },
                {
                    "A": "strands or threads",
                    "R": "appear",
                    "B": "loose and unstructured"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "strands"
                },
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "threads"
                },
                {
                    "A": "strands",
                    "R": "create",
                    "B": "surface"
                },
                {
                    "A": "threads",
                    "R": "create",
                    "B": "surface"
                }
            ]
        ]
    },
    "flecked": {
        "coarse_description": [
            "The unique visual cue of a flecked texture is the presence of small, scattered specks or spots.",
            "A flecked texture appears speckled or spotted, unlike other textures that may be smooth, rough, or patterned.",
            "A flecked texture is characterized by small, scattered, and irregular spots or specks on the surface.",
            "A flecked texture is visually distinguished by the presence of small, speckled dots or spots scattered throughout the surface.",
            "A flecked texture typically has small, scattered specks or dots that create a mottled appearance on the surface."
        ],
        "fine_description": [
            "A flecked texture is characterized by small, random specks or spots scattered across its surface.",
            "A flecked texture refers to small, scattered spots or specks that give an object a mottled appearance.",
            "A flecked texture is characterized by small, scattered dots or specks evenly distributed across the surface.",
            "A flecked texture is characterized by small, scattered spots or specks of color or pattern.",
            "A flecked texture typically has small, scattered specks or spots evenly distributed across its surface."
        ],
        "overall_description": [
            "A flecked texture is defined by the presence of small, scattered specks or spots randomly scattered across its surface.",
            "A flecked texture is characterized by small, scattered spots or specks that create a mottled appearance, distinguishing it from other textures.",
            "A flecked texture is characterized by small, scattered, and irregular spots or specks evenly distributed across the surface.",
            "A flecked texture is visually characterized by the presence of small, scattered dots or spots of color or pattern throughout the surface.",
            "A flecked texture is characterized by small, scattered specks or spots that are evenly distributed, creating a mottled appearance on the surface."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "defined by",
                    "B": "presence"
                },
                {
                    "A": "presence",
                    "R": "of",
                    "B": "specks"
                },
                {
                    "A": "presence",
                    "R": "of",
                    "B": "spots"
                },
                {
                    "A": "specks",
                    "R": "scattered across",
                    "B": "surface"
                },
                {
                    "A": "spots",
                    "R": "scattered across",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "spots or specks"
                },
                {
                    "A": "spots or specks",
                    "R": "create",
                    "B": "mottled appearance"
                },
                {
                    "A": "mottled appearance",
                    "R": "distinguishing",
                    "B": "other textures"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "spots"
                },
                {
                    "A": "spots",
                    "R": "distributed across",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is visually characterized by",
                    "B": "presence of small, scattered dots or spots of color or pattern throughout the surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "flecked texture"
                },
                {
                    "A": "specks or spots",
                    "R": "scattered",
                    "B": "small, scattered specks or spots"
                },
                {
                    "A": "small, scattered specks or spots",
                    "R": "distributed",
                    "B": "evenly distributed"
                },
                {
                    "A": "mottled appearance",
                    "R": "created by",
                    "B": "creating a mottled appearance on the surface"
                }
            ]
        ]
    },
    "freckled": {
        "coarse_description": [
            "Small, scattered brown spots or specks on the surface, creating a unique freckled texture.",
            "A freckled texture appears as small, scattered spots or dots on the surface, distinguishing it from other textures.",
            "Small, dark spots scattered across the skin's surface create a freckled texture.",
            "A freckled texture is distinguished visually by the presence of small, scattered spots or speckles on the surface.",
            "A freckled texture typically consists of small, scattered spots or speckles on a surface."
        ],
        "fine_description": [
            "Freckled texture consists of numerous small, distinct spots or dots scattered across a surface.",
            "Freckled texture refers to small, scattered spots or speckles, while flecked and blotchy appearance implies larger, irregular patches.",
            "Freckled texture is characterized by small, scattered spots or patches of color on the surface.",
            "A freckled texture is characterized by small, scattered spots or dots on a surface.",
            "Freckled textures typically have small, scattered spots or speckles evenly distributed across the surface."
        ],
        "overall_description": [
            "Freckled refers to a unique texture characterized by scattered small, brown spots or dots, creating a distinct pattern on the surface.",
            "Freckled texture is characterized by small, scattered spots or dots on the surface, differentiating it from other textures, while larger, irregular patches indicate a flecked or blotchy appearance.",
            "Freckled refers to a texture with small, scattered dark spots or patches of color on the skin's surface.",
            "A freckled texture is visually characterized by small, scattered spots or speckles on the surface, appearing as small dots or speckles.",
            "Freckled textures are characterized by small, scattered spots or speckles that are either evenly distributed or randomly arranged on the surface."
        ],
        "structure": [
            [
                {
                    "A": "Freckled",
                    "R": "refers to",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "scattered small, brown spots or dots"
                },
                {
                    "A": "scattered small, brown spots or dots",
                    "R": "creating",
                    "B": "distinct pattern on the surface"
                }
            ],
            [
                {
                    "A": "Freckled texture",
                    "R": "characterized by",
                    "B": "small, scattered spots or dots"
                },
                {
                    "A": "Freckled texture",
                    "R": "differentiating it from",
                    "B": "other textures"
                },
                {
                    "A": "larger, irregular patches",
                    "R": "indicate",
                    "B": "a flecked or blotchy appearance"
                }
            ],
            [
                {
                    "A": "Freckled",
                    "R": "refers to",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "has",
                    "B": "dark spots"
                },
                {
                    "A": "texture",
                    "R": "has",
                    "B": "patches of color"
                },
                {
                    "A": "texture",
                    "R": "is on",
                    "B": "skin's surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "spots"
                },
                {
                    "A": "spots",
                    "R": "scattered on",
                    "B": "surface"
                },
                {
                    "A": "spots",
                    "R": "appearing as",
                    "B": "dots"
                }
            ],
            [
                {
                    "A": "textures",
                    "R": "are characterized by",
                    "B": "spots or speckles"
                },
                {
                    "A": "spots or speckles",
                    "R": "are either",
                    "B": "evenly distributed"
                },
                {
                    "A": "spots or speckles",
                    "R": "are randomly arranged on",
                    "B": "the surface"
                }
            ]
        ]
    },
    "frilly": {
        "coarse_description": [
            "The unique visual cue of a frilly texture is the presence of intricate, delicate, and ruffled patterns.",
            "A frilly texture appears with delicate, ornamental ruffles or folds, distinguishing it from other types of textures.",
            "A frilly texture is characterized by intricate, wavy patterns that create a sense of delicacy and ornateness.",
            "A frilly texture is characterized by delicate, ruffled or wavy patterns that create a soft and intricate appearance.",
            "A frilly texture typically has delicate, ruffled or wavy surface characteristics."
        ],
        "fine_description": [
            "A frilly texture is characterized by its intricate and wavy edges, adding a decorative and playful element.",
            "Frilly texture refers to a delicate, ornamental fabric with ruffled edges, while gauzy, lacelike appearance suggests a sheer, translucent material with intricate patterns.",
            "Frilly texture is characterized by delicate, ruffled edges that create a playful and ornate appearance.",
            "A frilly texture is characterized by delicate, ruffled edges that create a visually ornate and intricate pattern.",
            "A frilly texture typically consists of delicate, ruffled layers that create a visually ornate and decorative surface."
        ],
        "overall_description": [
            "Frilly textures are visually distinctive, featuring intricate, delicate, and ruffled patterns with wavy edges, adding a decorative and playful element.",
            "Frilly encompasses a delicate, ornamental texture with ruffles or folds, appearing in both fabric and translucent materials with intricate patterns.",
            "Frilly texture is characterized by intricate, wavy patterns and delicate, ruffled edges, creating a sense of delicacy, playfulness, and ornateness.",
            "Frilly texture is delicate and ruffled, creating soft, intricate patterns with visually ornate edges, giving it an overall intricate and ornamental appearance.",
            "Frilly textures are characterized by delicate, ruffled or wavy surfaces, consisting of layers that create visually ornate and decorative patterns."
        ],
        "structure": [
            [
                {
                    "A": "textures",
                    "R": "are",
                    "B": "visually distinctive"
                },
                {
                    "A": "textures",
                    "R": "feature",
                    "B": "intricate, delicate, and ruffled patterns with wavy edges"
                },
                {
                    "A": "patterns",
                    "R": "have",
                    "B": "wavy edges"
                },
                {
                    "A": "textures",
                    "R": "add",
                    "B": "a decorative and playful element"
                }
            ],
            [
                {
                    "A": "Frilly",
                    "R": "encompasses",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "with",
                    "B": "ruffles"
                },
                {
                    "A": "texture",
                    "R": "with",
                    "B": "folds"
                },
                {
                    "A": "texture",
                    "R": "appearing",
                    "B": "in fabric"
                },
                {
                    "A": "texture",
                    "R": "appearing",
                    "B": "in translucent materials"
                },
                {
                    "A": "translucent materials",
                    "R": "with",
                    "B": "patterns"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "create",
                    "B": "sense"
                },
                {
                    "A": "patterns",
                    "R": "create",
                    "B": "delicacy"
                },
                {
                    "A": "patterns",
                    "R": "create",
                    "B": "playfulness"
                },
                {
                    "A": "patterns",
                    "R": "create",
                    "B": "ornateness"
                },
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "edges"
                },
                {
                    "A": "edges",
                    "R": "create",
                    "B": "sense"
                },
                {
                    "A": "edges",
                    "R": "create",
                    "B": "delicacy"
                },
                {
                    "A": "edges",
                    "R": "create",
                    "B": "playfulness"
                },
                {
                    "A": "edges",
                    "R": "create",
                    "B": "ornateness"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "delicate"
                },
                {
                    "A": "texture",
                    "R": "is",
                    "B": "ruffled"
                },
                {
                    "A": "texture",
                    "R": "creates",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "are",
                    "B": "intricate"
                },
                {
                    "A": "patterns",
                    "R": "have",
                    "B": "edges"
                },
                {
                    "A": "edges",
                    "R": "are",
                    "B": "visually ornate"
                },
                {
                    "A": "texture",
                    "R": "gives",
                    "B": "appearance"
                },
                {
                    "A": "appearance",
                    "R": "is",
                    "B": "intricate"
                },
                {
                    "A": "appearance",
                    "R": "is",
                    "B": "ornamental"
                }
            ],
            [
                {
                    "A": "textures",
                    "R": "are characterized by",
                    "B": "surfaces"
                },
                {
                    "A": "surfaces",
                    "R": "consist of",
                    "B": "layers"
                },
                {
                    "A": "layers",
                    "R": "create",
                    "B": "patterns"
                }
            ]
        ]
    },
    "gauzy": {
        "coarse_description": [
            "The visual cue unique to a gauzy texture is its semi-transparent and lightweight appearance.",
            "A gauzy texture appears light, sheer, and translucent, while other textures can vary in weight, opacity, and smoothness.",
            "A gauzy texture is characterized by its thin, delicate, translucent, and loosely woven or sheer appearance.",
            "A gauzy texture is visually distinguished by its delicate, lightweight appearance with a slightly transparent and loosely woven structure.",
            "A gauzy texture is typically characterized by a delicate, translucent, and loosely woven surface."
        ],
        "fine_description": [
            "A gauzy texture is characterized by its sheer and delicate appearance, distinguishing it from matted and bumpy textures.",
            "Gauzy texture is sheer and lightweight, with a delicate, transparent quality, often resembling a fine mesh or netting.",
            "A gauzy texture is characterized by its thin, sheer, and translucent appearance, resembling a delicate and airy fabric.",
            "A gauzy texture appears sheer and transparent, with fine, delicate threads creating a light and airy visual effect.",
            "A gauzy texture is typically lightweight, sheer, and has a delicate, semi-transparent quality."
        ],
        "overall_description": [
            "Gauzy textures are characterized by their semi-transparent, lightweight, sheer, and delicate appearance, distinguishing them from matted and bumpy textures.",
            "Gauzy texture is light, sheer, translucent, delicate, transparent, and often resembles a fine mesh or netting, distinguishing it from other textures.",
            "Gauzy is a thin, delicate, translucent fabric with a loosely woven or sheer appearance, resembling a delicate and airy texture.",
            "Gauzy is a delicate and lightweight fabric with a slightly transparent, loosely woven structure, creating a sheer and airy visual effect with fine, delicate threads.",
            "Gauzy fabric is lightweight, delicate, and characterized by a translucent, loosely woven, and semi-transparent texture."
        ],
        "structure": [
            [
                {
                    "A": "textures",
                    "R": "are characterized by",
                    "B": "appearance"
                },
                {
                    "A": "textures",
                    "R": "are characterized by",
                    "B": "semi-transparent"
                },
                {
                    "A": "textures",
                    "R": "are characterized by",
                    "B": "lightweight"
                },
                {
                    "A": "textures",
                    "R": "are characterized by",
                    "B": "sheer"
                },
                {
                    "A": "textures",
                    "R": "are characterized by",
                    "B": "delicate"
                },
                {
                    "A": "textures",
                    "R": "distinguishing",
                    "B": "them from"
                },
                {
                    "A": "textures",
                    "R": "distinguishing",
                    "B": "matted"
                },
                {
                    "A": "textures",
                    "R": "distinguishing",
                    "B": "bumpy"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "light"
                },
                {
                    "A": "texture",
                    "R": "is",
                    "B": "sheer"
                },
                {
                    "A": "texture",
                    "R": "is",
                    "B": "translucent"
                },
                {
                    "A": "texture",
                    "R": "is",
                    "B": "delicate"
                },
                {
                    "A": "texture",
                    "R": "is",
                    "B": "transparent"
                },
                {
                    "A": "texture",
                    "R": "resembles",
                    "B": "fine mesh"
                },
                {
                    "A": "texture",
                    "R": "resembles",
                    "B": "netting"
                },
                {
                    "A": "texture",
                    "R": "distinguishing",
                    "B": "it from other textures"
                }
            ],
            [
                {
                    "A": "Gauzy",
                    "R": "is",
                    "B": "fabric"
                },
                {
                    "A": "fabric",
                    "R": "has",
                    "B": "appearance"
                },
                {
                    "A": "appearance",
                    "R": "resembles",
                    "B": "texture"
                }
            ],
            [
                {
                    "A": "Gauzy",
                    "R": "is",
                    "B": "fabric"
                },
                {
                    "A": "fabric",
                    "R": "with",
                    "B": "structure"
                },
                {
                    "A": "structure",
                    "R": "creating",
                    "B": "effect"
                },
                {
                    "A": "effect",
                    "R": "with",
                    "B": "threads"
                }
            ],
            [
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "characterized"
                },
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "lightweight"
                },
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "delicate"
                },
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "characterized by"
                },
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "translucent"
                },
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "loosely woven"
                },
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "semi-transparent"
                },
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "characterized by a translucent texture"
                },
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "characterized by a loosely woven texture"
                },
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "characterized by a semi-transparent texture"
                }
            ]
        ]
    },
    "grid": {
        "coarse_description": [
            "A grid texture is characterized by a regular pattern of intersecting horizontal and vertical lines.",
            "A grid texture appears as a regular pattern of intersecting lines, while other textures vary in their patterns and shapes.",
            "A grid texture is characterized by a regular pattern of parallel lines intersecting at right angles.",
            "A grid texture is visually distinguished by its repetitive pattern of intersecting horizontal and vertical lines.",
            "A grid texture typically consists of regularly spaced, intersecting lines or squares creating a repetitive pattern."
        ],
        "fine_description": [
            "The grid texture is characterized by evenly spaced parallel lines intersecting at right angles.",
            "A grid texture consists of straight lines intersecting at right angles, while crosshatched/meshed appearance has lines crisscrossing each other.",
            "A grid texture is characterized by a pattern of intersecting parallel lines forming squares or rectangles.",
            "A grid texture is characterized by parallel lines intersecting at right angles, forming a network-like pattern.",
            "A grid texture typically consists of evenly spaced parallel lines intersecting at right angles, creating a square or rectangular pattern."
        ],
        "overall_description": [
            "A grid is a regular pattern of evenly spaced parallel lines intersecting at right angles, creating a textured surface.",
            "A grid texture is characterized by a regular pattern of straight lines intersecting at right angles, distinguishing it from other textures with varying patterns and shapes.",
            "A grid texture is characterized by a regular pattern of intersecting parallel lines forming squares or rectangles, intersecting at right angles.",
            "A grid texture is visually distinguished by its repetitive pattern of parallel lines intersecting at right angles, forming a network-like pattern.",
            "A grid texture is a repetitive pattern created by regularly spaced, evenly parallel lines intersecting at right angles, forming a square or rectangular pattern."
        ],
        "structure": [
            [
                {
                    "A": "grid",
                    "R": "is",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "of",
                    "B": "lines"
                },
                {
                    "A": "lines",
                    "R": "intersecting",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "grid texture",
                    "R": "characterized by",
                    "B": "regular pattern of straight lines intersecting at right angles"
                },
                {
                    "A": "grid texture",
                    "R": "distinguishing it from",
                    "B": "other textures with varying patterns and shapes"
                }
            ],
            [
                {
                    "A": "grid texture",
                    "R": "is characterized by",
                    "B": "regular pattern"
                },
                {
                    "A": "regular pattern",
                    "R": "forming",
                    "B": "squares or rectangles"
                },
                {
                    "A": "squares or rectangles",
                    "R": "intersecting at",
                    "B": "right angles"
                }
            ],
            [
                {
                    "A": "grid texture",
                    "R": "distinguished by",
                    "B": "repetitive pattern"
                },
                {
                    "A": "repetitive pattern",
                    "R": "formed by",
                    "B": "parallel lines"
                },
                {
                    "A": "parallel lines",
                    "R": "intersecting at",
                    "B": "right angles"
                },
                {
                    "A": "parallel lines",
                    "R": "forming",
                    "B": "network-like pattern"
                }
            ],
            [
                {
                    "A": "grid texture",
                    "R": "is",
                    "B": "repetitive pattern"
                },
                {
                    "A": "repetitive pattern",
                    "R": "created by",
                    "B": "regularly spaced, evenly parallel lines"
                },
                {
                    "A": "regularly spaced, evenly parallel lines",
                    "R": "intersecting at",
                    "B": "right angles"
                },
                {
                    "A": "regularly spaced, evenly parallel lines",
                    "R": "forming",
                    "B": "a square or rectangular pattern"
                }
            ]
        ]
    },
    "grooved": {
        "coarse_description": [
            "A grooved texture has parallel lines or ridges that create a distinct linear pattern.",
            "A grooved texture appears as a series of parallel lines or ridges, while other textures have different patterns or surfaces.",
            "A grooved texture is characterized by linear or curved indentations or channels on the surface of an object.",
            "A grooved texture is visually distinguished by its linear or curved indentations or ridges on a surface.",
            "A grooved texture typically exhibits parallel lines or ridges that run along the surface."
        ],
        "fine_description": [
            "The grooved texture has parallel, linear indentations that create a pattern distinct from other textures.",
            "A grooved texture is characterized by parallel indentations or ridges on the surface, providing a linear pattern.",
            "A grooved texture is characterized by long, narrow depressions or ridges that create a linear pattern.",
            "A grooved texture appears as a series of parallel, indented lines or channels on the surface.",
            "A grooved texture typically consists of parallel, elongated indentations or ridges on its surface."
        ],
        "overall_description": [
            "A grooved texture is characterized by parallel lines or ridges that create distinct linear indentations, resulting in a pattern different from other textures.",
            "A grooved texture consists of parallel lines or ridges, creating a linear pattern that distinguishes it from other textures.",
            "A grooved texture is defined by linear or curved indentations, channels, or long narrow depressions/ridges that create a distinct pattern on the surface of an object.",
            "Grooved texture is characterized by linear or curved indentations, ridges, or parallel lines and channels on a surface.",
            "Grooved textures are characterized by parallel lines or ridges that run along the surface, typically forming elongated indentations or ridges."
        ],
        "structure": [
            [
                {
                    "A": "grooved texture",
                    "R": "characterized by",
                    "B": "parallel lines or ridges"
                },
                {
                    "A": "parallel lines or ridges",
                    "R": "create",
                    "B": "distinct linear indentations"
                },
                {
                    "A": "distinct linear indentations",
                    "R": "resulting in",
                    "B": "a pattern different from other textures"
                }
            ],
            [
                {
                    "A": "grooved texture",
                    "R": "consists of",
                    "B": "parallel lines or ridges"
                },
                {
                    "A": "grooved texture",
                    "R": "creates",
                    "B": "a linear pattern"
                },
                {
                    "A": "linear pattern",
                    "R": "distinguishes",
                    "B": "it from other textures"
                }
            ],
            [
                {
                    "A": "grooved texture",
                    "R": "is defined by",
                    "B": "indentations, channels, or depressions/ridges"
                },
                {
                    "A": "indentations, channels, or depressions/ridges",
                    "R": "create",
                    "B": "distinct pattern"
                },
                {
                    "A": "distinct pattern",
                    "R": "on the surface of",
                    "B": "an object"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "indentations"
                },
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "ridges"
                },
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "lines"
                },
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "channels"
                }
            ],
            [
                {
                    "A": "textures",
                    "R": "characterized by",
                    "B": "parallel lines or ridges"
                },
                {
                    "A": "parallel lines or ridges",
                    "R": "run along",
                    "B": "surface"
                },
                {
                    "A": "surface",
                    "R": "forming",
                    "B": "elongated indentations or ridges"
                }
            ]
        ]
    },
    "honeycombed": {
        "coarse_description": [
            "The honeycombed texture is characterized by a pattern of hexagonal cells, creating a distinct geometric arrangement.",
            "A honeycombed texture appears as a series of hexagonal cells, distinguishing it from other textures with varying patterns and shapes.",
            "A honeycombed texture is characterized by a network of hexagonal shapes with evenly spaced and interconnected chambers.",
            "A honeycombed texture is visually distinguished by its hexagonal-shaped cells arranged in a regular pattern.",
            "A honeycombed texture typically consists of a series of hexagonal cells, creating a pattern with uniform, repetitive voids."
        ],
        "fine_description": [
            "The honeycombed texture consists of regular hexagonal cells arranged closely together, creating a repetitive pattern.",
            "A honeycombed texture consists of a series of closely packed, hexagonal-shaped cells, resembling a beehive structure.",
            "A honeycombed texture is characterized by a repeated pattern of hexagonal cells, resembling the structure of a beehive.",
            "A honeycombed texture appears as a series of hexagonal cells with distinct edges and recessed compartments.",
            "A honeycombed texture is characterized by a series of interconnected, hexagonal cells with a porous and structured surface."
        ],
        "overall_description": [
            "Honeycombed texture is formed by closely arranged regular hexagonal cells, creating a distinct and repetitive geometric pattern.",
            "A honeycombed texture is characterized by a series of closely packed, hexagonal-shaped cells that resemble a beehive structure and distinguish it from other textures with varying patterns and shapes.",
            "A honeycombed texture is a network of evenly spaced and interconnected hexagonal chambers, resembling the repeated pattern of cells found in a beehive structure.",
            "Honeycombed texture is characterized by a regular pattern of hexagonal-shaped cells with distinct edges and recessed compartments.",
            "A honeycombed texture is formed by interconnected hexagonal cells, creating a porous and structured surface with uniform, repetitive voids."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is formed by",
                    "B": "cells"
                },
                {
                    "A": "cells",
                    "R": "arranged",
                    "B": "hexagonal"
                },
                {
                    "A": "cells",
                    "R": "creating",
                    "B": "pattern"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "honeycombed texture"
                },
                {
                    "A": "cells",
                    "R": "resemble",
                    "B": "hexagonal-shaped cells"
                },
                {
                    "A": "hexagonal-shaped cells",
                    "R": "distinguish",
                    "B": "it"
                },
                {
                    "A": "texture",
                    "R": "from",
                    "B": "other textures"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "network"
                },
                {
                    "A": "network",
                    "R": "of",
                    "B": "chambers"
                },
                {
                    "A": "chambers",
                    "R": "resembling",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "found in",
                    "B": "structure"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "pattern of cells"
                },
                {
                    "A": "pattern of cells",
                    "R": "has",
                    "B": "distinct edges"
                },
                {
                    "A": "pattern of cells",
                    "R": "has",
                    "B": "recessed compartments"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is formed by",
                    "B": "hexagonal cells"
                },
                {
                    "A": "hexagonal cells",
                    "R": "creating",
                    "B": "porous and structured surface"
                },
                {
                    "A": "porous and structured surface",
                    "R": "with",
                    "B": "uniform, repetitive voids"
                }
            ]
        ]
    },
    "interlaced": {
        "coarse_description": [
            "Interlaced texture is characterized by the presence of alternating woven or crossed patterns creating a grid-like appearance.",
            "Interlaced texture appears as a pattern of intertwined lines or strands, distinguishing it from other types of textures.",
            "An interlaced texture is characterized by a pattern of crossing or intertwining lines or threads.",
            "Interlaced texture is visually distinguished by its crisscrossing pattern of alternating threads or lines woven together.",
            "An interlaced texture typically consists of alternating, intertwined patterns or lines that create a visually woven appearance."
        ],
        "fine_description": [
            "Interlaced texture exhibits a crisscross pattern formed by intertwining threads, distinguishing it from woven and lined textures.",
            "Interlaced texture consists of crossing threads, creating a crisscross pattern, while woven, lined appearance has parallel threads.",
            "Interlaced texture has a crisscross pattern created by the weaving of threads in a complex and intricate manner.",
            "Interlaced texture appears as a pattern formed by crossing and weaving of threads or elements.",
            "An interlaced texture typically exhibits a crisscross pattern formed by weaving or intertwining strands."
        ],
        "overall_description": [
            "Interlaced texture is a distinct pattern created by intertwining or crossing threads, forming a grid-like appearance that sets it apart from woven or lined textures.",
            "Interlaced texture is characterized by a pattern of intertwined, crossing threads, creating a crisscross appearance, which sets it apart from other textures with parallel lines.",
            "Interlaced texture is characterized by a complex and intricate crisscross pattern created by weaving threads in a crossing or intertwining manner.",
            "Interlaced texture is characterized by a visually distinctive crisscrossing pattern formed by the alternating weaving or crossing of threads or elements.",
            "An interlaced texture is characterized by alternating, intertwined patterns or lines that create a visually woven appearance, often exhibiting a crisscross pattern formed by weaving or intertwining strands."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "created by",
                    "B": "intertwining or crossing threads"
                },
                {
                    "A": "pattern",
                    "R": "forms",
                    "B": "grid-like appearance"
                },
                {
                    "A": "appearance",
                    "R": "sets apart",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "from",
                    "B": "woven or lined textures"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "pattern of intertwined, crossing threads"
                },
                {
                    "A": "texture",
                    "R": "creating",
                    "B": "crisscross appearance"
                },
                {
                    "A": "texture",
                    "R": "sets apart from",
                    "B": "other textures with parallel lines"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "created by",
                    "B": "weaving threads"
                },
                {
                    "A": "threads",
                    "R": "in",
                    "B": "manner"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "formed by",
                    "B": "weaving"
                },
                {
                    "A": "pattern",
                    "R": "formed by",
                    "B": "crossing"
                },
                {
                    "A": "weaving",
                    "R": "of",
                    "B": "threads"
                },
                {
                    "A": "crossing",
                    "R": "of",
                    "B": "threads"
                },
                {
                    "A": "weaving",
                    "R": "of",
                    "B": "elements"
                },
                {
                    "A": "crossing",
                    "R": "of",
                    "B": "elements"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "interlaced patterns or lines"
                },
                {
                    "A": "patterns or lines",
                    "R": "create",
                    "B": "visually woven appearance"
                },
                {
                    "A": "appearance",
                    "R": "exhibiting",
                    "B": "crisscross pattern"
                },
                {
                    "A": "crisscross pattern",
                    "R": "formed by",
                    "B": "weaving or intertwining strands"
                }
            ]
        ]
    },
    "knitted": {
        "coarse_description": [
            "Interlocking loops of yarn create a distinct raised and bumpy appearance, characteristic of knitted texture.",
            "Knitted texture appears as a series of interlocking loops, distinguishing it from other textures that lack this specific pattern.",
            "A knitted texture is characterized by its interlocking loops of yarn, creating a stretchy and ribbed appearance.",
            "A knitted texture is characterized by interlocking loops of yarn, creating a distinct raised and repetitive pattern.",
            "A knitted texture typically has a soft, stretchy, and ribbed surface that is formed by interlocking yarn loops."
        ],
        "fine_description": [
            "The unique visual cue of a knitted texture is the presence of interlocking loops of yarn.",
            "A knitted texture consists of interlocking loops, creating a flexible and stretchable fabric with a distinct ribbed pattern.",
            "Knitted textures have a series of interlocking loops that create a flexible and stretchy fabric.",
            "A knitted texture has interlocking loops that create a flexible and stretchy appearance.",
            "A knitted texture typically has a soft, stretchy, and looped surface with a distinct ribbed or interlocking pattern."
        ],
        "overall_description": [
            "Knitted objects have a distinct raised and bumpy appearance due to interlocking loops of yarn, which visually define their unique textured look.",
            "Knitted texture is created by interlocking loops, resulting in a flexible and stretchable fabric with a distinct ribbed pattern, distinguishing it from other textures.",
            "Knitted textures are created by interlocking loops of yarn, resulting in a flexible, stretchy, and ribbed fabric.",
            "Knitted textures are characterized by interlocking loops of yarn that create a distinct, raised, repetitive pattern, giving them a flexible and stretchy appearance.",
            "Knitted textures are characterized by their soft, stretchy surface with looped yarns interlocked in a ribbed or distinct pattern."
        ],
        "structure": [
            [
                {
                    "A": "objects",
                    "R": "have",
                    "B": "appearance"
                },
                {
                    "A": "appearance",
                    "R": "due to",
                    "B": "interlocking loops of yarn"
                },
                {
                    "A": "interlocking loops of yarn",
                    "R": "define",
                    "B": "unique textured look"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is created by",
                    "B": "interlocking loops"
                },
                {
                    "A": "texture",
                    "R": "results in",
                    "B": "fabric"
                },
                {
                    "A": "fabric",
                    "R": "has",
                    "B": "ribbed pattern"
                },
                {
                    "A": "texture",
                    "R": "distinguishes from",
                    "B": "other textures"
                }
            ],
            [
                {
                    "A": "textures",
                    "R": "created by",
                    "B": "interlocking loops of yarn"
                },
                {
                    "A": "loops of yarn",
                    "R": "resulting in",
                    "B": "fabric"
                },
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "flexible"
                },
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "stretchy"
                },
                {
                    "A": "fabric",
                    "R": "is",
                    "B": "ribbed"
                }
            ],
            [
                {
                    "A": "textures",
                    "R": "are characterized by",
                    "B": "interlocking loops of yarn"
                },
                {
                    "A": "loops of yarn",
                    "R": "create",
                    "B": "a distinct, raised, repetitive pattern"
                },
                {
                    "A": "pattern",
                    "R": "giving",
                    "B": "them a flexible and stretchy appearance"
                }
            ],
            [
                {
                    "A": "Knitted textures",
                    "R": "are characterized by",
                    "B": "soft, stretchy surface"
                },
                {
                    "A": "Knitted textures",
                    "R": "are characterized by",
                    "B": "looped yarns interlocked"
                },
                {
                    "A": "looped yarns",
                    "R": "interlocked in",
                    "B": "ribbed or distinct pattern"
                }
            ]
        ]
    },
    "lacelike": {
        "coarse_description": [
            "The unique visual cue of a lacelike texture is the presence of intricate and delicate interwoven patterns.",
            "A lacelike texture appears delicate and intricate, while other textures may have a more uniform or rough appearance.",
            "A lacelike texture is characterized by intricate, delicate patterns resembling the fabric commonly used in lace-making.",
            "A lacelike texture is visually distinguished by its intricate and delicate patterns resembling lace fabric.",
            "A lacelike texture typically exhibits intricate, delicate patterns with openwork and fine thread-like details."
        ],
        "fine_description": [
            "Lacelike texture is characterized by intricate, delicate patterns formed by interconnected threads resembling a delicate web.",
            "A lacelike texture refers to a delicate, intricate pattern resembling lace, characterized by its fine, interconnected threads.",
            "A lacelike texture is characterized by intricate, delicate patterns resembling the interwoven threads of lace fabric.",
            "A lacelike texture is characterized by intricate, delicate patterns resembling woven threads or fine netting.",
            "A lacelike texture typically has intricate patterns composed of delicate, interwoven threads, creating an elegant and airy feel."
        ],
        "overall_description": [
            "Lacelike texture is defined by the presence of intricate, delicate interwoven patterns, forming interconnected threads that resemble a delicate web.",
            "A lacelike texture is delicate, intricate, and characterized by a fine, interconnected pattern resembling lace, with threads appearing delicate and interconnected.",
            "A lacelike texture is characterized by intricate, delicate patterns resembling the fabric commonly used in lace-making, with interwoven threads forming intricate designs.",
            "A lacelike texture is visually characterized by intricate and delicate patterns resembling lace fabric, woven threads, or fine netting.",
            "Lacelike textures are characterized by intricate, delicate patterns with openwork and interwoven, fine thread-like details, creating an elegant and airy feel."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is defined by",
                    "B": "presence"
                },
                {
                    "A": "texture",
                    "R": "is defined by",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "forming",
                    "B": "threads"
                },
                {
                    "A": "threads",
                    "R": "resemble",
                    "B": "web"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "lacelike"
                },
                {
                    "A": "texture",
                    "R": "is",
                    "B": "delicate"
                },
                {
                    "A": "texture",
                    "R": "is",
                    "B": "intricate"
                },
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "resembling",
                    "B": "lace"
                },
                {
                    "A": "pattern",
                    "R": "has",
                    "B": "threads"
                },
                {
                    "A": "threads",
                    "R": "appear",
                    "B": "delicate"
                },
                {
                    "A": "threads",
                    "R": "are",
                    "B": "interconnected"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "resembling",
                    "B": "fabric"
                },
                {
                    "A": "fabric",
                    "R": "commonly used in",
                    "B": "lace-making"
                },
                {
                    "A": "lace-making",
                    "R": "with",
                    "B": "threads"
                },
                {
                    "A": "threads",
                    "R": "forming",
                    "B": "designs"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "resemble",
                    "B": "lace fabric, woven threads, or fine netting"
                }
            ],
            [
                {
                    "A": "textures",
                    "R": "are characterized by",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "have",
                    "B": "details"
                },
                {
                    "A": "details",
                    "R": "create",
                    "B": "feel"
                }
            ]
        ]
    },
    "lined": {
        "coarse_description": [
            "Parallel straight lines are the unique visual cue for a lined texture.",
            "A lined texture appears as a pattern of straight lines, while other textures can have various patterns or no specific pattern.",
            "A lined texture is characterized by parallel, straight, and continuous patterns or ridges across its surface.",
            "A lined texture is characterized by parallel lines running across the surface, giving it a striped or linear appearance.",
            "A lined texture typically consists of parallel, straight lines running closely together, creating a uniform and organized appearance."
        ],
        "fine_description": [
            "A lined texture is characterized by parallel lines running in a consistent direction, distinguishing it from other textures.",
            "A lined texture consists of straight, parallel lines, while a grooved, interlaced appearance features curved, interconnected lines.",
            "A lined texture is characterized by straight parallel lines that run across the surface, creating a regular pattern.",
            "A lined texture appears as straight parallel lines without any interlocking or overlapping patterns.",
            "A lined texture typically consists of straight, parallel lines running uniformly across the surface."
        ],
        "overall_description": [
            "A lined texture is defined by the presence of parallel straight lines running consistently in a particular direction, making it visually distinctive.",
            "A lined texture is characterized by straight, parallel lines, distinguishing it from other textures with different patterns, such as grooved or interlaced appearances featuring curved, interconnected lines.",
            "A lined texture is defined by its surface displaying parallel, straight lines or ridges that create a regular and continuous pattern.",
            "A lined texture is defined by straight parallel lines that run across the surface, creating a striped or linear appearance, without any interlocking or overlapping patterns.",
            "Lined texture is characterized by parallel, straight lines running closely together or uniformly across a surface, creating a organized and uniform appearance."
        ],
        "structure": [
            [
                {
                    "A": "lined texture",
                    "R": "is defined by",
                    "B": "presence of parallel straight lines"
                },
                {
                    "A": "parallel straight lines",
                    "R": "running consistently in",
                    "B": "particular direction"
                },
                {
                    "A": "lined texture",
                    "R": "is visually distinctive",
                    "B": ""
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "lines"
                },
                {
                    "A": "texture",
                    "R": "distinguishing it from",
                    "B": "textures"
                },
                {
                    "A": "textures",
                    "R": "with different patterns, such as",
                    "B": "appearances"
                },
                {
                    "A": "appearances",
                    "R": "featuring",
                    "B": "lines"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "defined by",
                    "B": "surface"
                },
                {
                    "A": "surface",
                    "R": "displaying",
                    "B": "lines"
                },
                {
                    "A": "lines",
                    "R": "create",
                    "B": "pattern"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is defined by",
                    "B": "straight parallel lines"
                },
                {
                    "A": "lines",
                    "R": "run across",
                    "B": "surface"
                },
                {
                    "A": "lines",
                    "R": "create",
                    "B": "striped or linear appearance"
                },
                {
                    "A": "appearance",
                    "R": "without any",
                    "B": "interlocking or overlapping patterns"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "lines"
                },
                {
                    "A": "lines",
                    "R": "running",
                    "B": "uniformly"
                },
                {
                    "A": "lines",
                    "R": "running",
                    "B": "closely"
                },
                {
                    "A": "lines",
                    "R": "creating",
                    "B": "appearance"
                }
            ]
        ]
    },
    "marbled": {
        "coarse_description": [
            "The unique visual cue of a marbled texture is the presence of swirling patterns and streaks.",
            "A marbled texture appears as a blend of contrasting colors and swirling patterns, distinguishing it from other types of texture.",
            "A marbled texture is characterized by its swirling patterns and mixture of colors that resemble the natural stone.",
            "A marbled texture is characterized by a pattern that resembles swirls or veins, resembling the appearance of marble stone.",
            "A marbled texture typically exhibits a swirling pattern of contrasting colors resembling the natural veining found in marble."
        ],
        "fine_description": [
            "Marbled texture is characterized by a random intermingling of contrasting colors, creating a unique and organic pattern.",
            "Marbled texture refers to a pattern with irregular, swirling lines that resemble a mixture of different colors.",
            "Marbled texture is characterized by irregular patterns of contrasting colors resembling a mixture of swirling paint.",
            "A marbled texture is characterized by random and irregular patterns of colors blending together seamlessly.",
            "A marbled texture typically exhibits a unique blend of soft, flowing patterns with a polished, smooth surface."
        ],
        "overall_description": [
            "Marbled refers to a texture with swirling patterns and streaks, where contrasting colors intermingle randomly, creating a unique and organic visual pattern.",
            "Marbled texture is characterized by a blend of contrasting colors and irregular, swirling patterns, creating a unique and distinct appearance.",
            "Marbled texture is characterized by swirling patterns and a mixture of colors resembling natural stone, or irregular patterns of contrasting colors resembling swirling paint.",
            "Marbled textures are characterized by seamless blending of random and irregular patterns of colors, resembling swirls or veins found in marble stone.",
            "Marbled is a textured surface that showcases swirling patterns of contrasting colors resembling natural veining, offering a unique blend of soft, flowing patterns with a polished, smooth surface."
        ],
        "structure": [
            [
                {
                    "A": "Marbled",
                    "R": "refers to",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "has",
                    "B": "swirling patterns and streaks"
                },
                {
                    "A": "swirling patterns and streaks",
                    "R": "intermingle",
                    "B": "contrasting colors"
                },
                {
                    "A": "contrasting colors",
                    "R": "create",
                    "B": "unique and organic visual pattern"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "blend of colors"
                },
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "swirling patterns"
                },
                {
                    "A": "texture",
                    "R": "creates",
                    "B": "appearance"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "swirling patterns"
                },
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "mixture of colors"
                },
                {
                    "A": "mixture of colors",
                    "R": "resembling",
                    "B": "natural stone"
                },
                {
                    "A": "patterns",
                    "R": "resembling",
                    "B": "swirling paint"
                },
                {
                    "A": "patterns",
                    "R": "of",
                    "B": "contrasting colors"
                }
            ],
            [
                {
                    "A": "textures",
                    "R": "characterized by",
                    "B": "blending"
                },
                {
                    "A": "blending",
                    "R": "of",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "resembling",
                    "B": "swirls"
                },
                {
                    "A": "patterns",
                    "R": "resembling",
                    "B": "veins"
                },
                {
                    "A": "swirls",
                    "R": "found in",
                    "B": "stone"
                },
                {
                    "A": "veins",
                    "R": "found in",
                    "B": "stone"
                }
            ],
            [
                {
                    "A": "Marbled",
                    "R": "is",
                    "B": "textured surface"
                },
                {
                    "A": "textured surface",
                    "R": "showcases",
                    "B": "swirling patterns"
                },
                {
                    "A": "swirling patterns",
                    "R": "resembling",
                    "B": "natural veining"
                },
                {
                    "A": "natural veining",
                    "R": "offering",
                    "B": "unique blend"
                },
                {
                    "A": "unique blend",
                    "R": "of",
                    "B": "soft, flowing patterns"
                },
                {
                    "A": "soft, flowing patterns",
                    "R": "with",
                    "B": "polished, smooth surface"
                }
            ]
        ]
    },
    "matted": {
        "coarse_description": [
            "A matted texture typically appears dull, with a lack of shine or glossiness, setting it apart from other textures.",
            "A matted texture appears dull and non-reflective, contrasting with other textures that may be shiny or glossy.",
            "A matted texture appears rough and tangled, with fibers or strands compacted together, creating a flat and dull surface.",
            "A matted texture appears dull and lacks shine, with a rough and non-reflective surface.",
            "A matted texture is typically smooth, non-reflective, and lacks shine or glossiness on its surface."
        ],
        "fine_description": [
            "A matted texture appears rough and tangled, with individual fibers or strands sticking together.",
            "A matted texture has a rough, tangled appearance with no sheen or glossiness, creating a flat and dull surface.",
            "A matted texture appears rough, tangled, and dense, with individual strands or fibers clumped together.",
            "A matted texture appears rough, with fibers or strands intertwined, creating a tangled and non-smooth surface.",
            "A matted texture typically has a dull, rough surface with no shine or smoothness."
        ],
        "overall_description": [
            "A matted texture is dull, lacking shine or glossiness, rough, and tangled, with fibers or strands sticking together.",
            "Matted texture is rough, tangled, dull, non-reflective, and lacks sheen or glossiness, creating a contrasting, flat appearance.",
            "Matted texture is rough, tangled, and dense, with compacted fibers or strands creating a flat, dull, and clumped surface.",
            "Matted texture is rough and non-reflective, lacking shine, with intertwined fibers or strands creating a tangled and dull surface.",
            "A matted texture is typically smooth, non-reflective, lacking glossiness, and has a dull, rough surface with no shine or smoothness."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "dull"
                },
                {
                    "A": "texture",
                    "R": "is",
                    "B": "lacking shine or glossiness"
                },
                {
                    "A": "texture",
                    "R": "is",
                    "B": "rough"
                },
                {
                    "A": "texture",
                    "R": "is",
                    "B": "tangled"
                },
                {
                    "A": "fibers or strands",
                    "R": "are",
                    "B": "sticking together"
                }
            ],
            [
                {
                    "A": "Matted texture",
                    "R": "is",
                    "B": "rough"
                },
                {
                    "A": "Matted texture",
                    "R": "is",
                    "B": "tangled"
                },
                {
                    "A": "Matted texture",
                    "R": "is",
                    "B": "dull"
                },
                {
                    "A": "Matted texture",
                    "R": "is",
                    "B": "non-reflective"
                },
                {
                    "A": "Matted texture",
                    "R": "lacks",
                    "B": "sheen or glossiness"
                },
                {
                    "A": "Matted texture",
                    "R": "creates",
                    "B": "contrasting, flat appearance"
                }
            ],
            [
                {
                    "A": "Matted texture",
                    "R": "is",
                    "B": "rough"
                },
                {
                    "A": "Matted texture",
                    "R": "is",
                    "B": "tangled"
                },
                {
                    "A": "Matted texture",
                    "R": "is",
                    "B": "dense"
                },
                {
                    "A": "compacted fibers or strands",
                    "R": "creating",
                    "B": "a flat surface"
                },
                {
                    "A": "compacted fibers or strands",
                    "R": "creating",
                    "B": "a dull surface"
                },
                {
                    "A": "compacted fibers or strands",
                    "R": "creating",
                    "B": "a clumped surface"
                }
            ],
            [
                {
                    "A": "Matted texture",
                    "R": "is",
                    "B": "rough"
                },
                {
                    "A": "Matted texture",
                    "R": "is",
                    "B": "non-reflective"
                },
                {
                    "A": "Matted texture",
                    "R": "lacking",
                    "B": "shine"
                },
                {
                    "A": "fibers or strands",
                    "R": "creating",
                    "B": "tangled surface"
                },
                {
                    "A": "Matted texture",
                    "R": "creating",
                    "B": "dull surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "matted"
                },
                {
                    "A": "texture",
                    "R": "is",
                    "B": "smooth"
                },
                {
                    "A": "texture",
                    "R": "is",
                    "B": "non-reflective"
                },
                {
                    "A": "texture",
                    "R": "lacks",
                    "B": "glossiness"
                },
                {
                    "A": "surface",
                    "R": "has",
                    "B": "dull"
                },
                {
                    "A": "surface",
                    "R": "is",
                    "B": "rough"
                },
                {
                    "A": "surface",
                    "R": "has",
                    "B": "no shine"
                },
                {
                    "A": "surface",
                    "R": "has",
                    "B": "no smoothness"
                }
            ]
        ]
    },
    "meshed": {
        "coarse_description": [
            "A meshed texture is uniquely characterized by its interconnected pattern of crisscrossing lines or grids.",
            "A meshed texture has a grid-like pattern, while other textures may have different patterns or no specific structure.",
            "A meshed texture is characterized by a grid-like pattern with interlocking or crisscrossing lines forming a network-like structure.",
            "A meshed texture is visually distinguished by its interconnected grid-like pattern with evenly spaced lines or shapes.",
            "A meshed texture typically has a grid-like pattern or a network of interconnected lines on its surface."
        ],
        "fine_description": [
            "A meshed texture is characterized by a regular pattern of intersecting lines forming a grid-like structure.",
            "A meshed texture consists of a grid-like pattern, while crosshatched appearance is characterized by interlaced lines.",
            "A meshed texture is characterized by a network of intersecting lines, forming a grid-like pattern.",
            "A meshed texture consists of intersecting lines or patterns that form a grid-like structure.",
            "A meshed texture typically has a network of interconnected lines or threads creating a grid-like pattern."
        ],
        "overall_description": [
            "A meshed texture is defined by its interconnected pattern of crisscrossing lines or grids, forming a regular grid-like structure.",
            "A meshed texture is characterized by a grid-like pattern, while other textures may have different patterns or no specific structure. Crosshatched appearance is characterized by interlaced lines.",
            "A meshed texture is characterized by a network-like structure formed by intersecting or crisscrossing lines, creating a grid-like pattern.",
            "A meshed texture is characterized by its interconnected, grid-like pattern with evenly spaced lines or shapes, forming an intersecting grid-like structure.",
            "A meshed texture is characterized by a grid-like pattern or network of interconnected lines/threads on its surface, creating a distinctive and interconnected appearance."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "defined by",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "formed by",
                    "B": "lines or grids"
                },
                {
                    "A": "lines or grids",
                    "R": "forming",
                    "B": "structure"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "meshed texture"
                },
                {
                    "A": "texture",
                    "R": "may have",
                    "B": "different patterns"
                },
                {
                    "A": "texture",
                    "R": "may have",
                    "B": "no specific structure"
                },
                {
                    "A": "appearance",
                    "R": "characterized by",
                    "B": "crosshatched appearance"
                },
                {
                    "A": "crosshatched appearance",
                    "R": "is characterized by",
                    "B": "interlaced lines"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "network-like structure"
                },
                {
                    "A": "structure",
                    "R": "formed by",
                    "B": "intersecting or crisscrossing lines"
                },
                {
                    "A": "lines",
                    "R": "creating",
                    "B": "grid-like pattern"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "consists of",
                    "B": "lines or shapes"
                },
                {
                    "A": "lines or shapes",
                    "R": "form",
                    "B": "structure"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "grid-like pattern"
                },
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "network of lines/threads"
                },
                {
                    "A": "pattern",
                    "R": "on",
                    "B": "surface"
                },
                {
                    "A": "pattern",
                    "R": "creating",
                    "B": "distinctive appearance"
                },
                {
                    "A": "appearance",
                    "R": "creating",
                    "B": "interconnected appearance"
                }
            ]
        ]
    },
    "paisley": {
        "coarse_description": [
            "Paisley texture is uniquely characterized by its intricate teardrop or droplet-shaped pattern with curved edges.",
            "Paisley texture is characterized by intricate, droplet-shaped patterns, distinguishing it from other types of textures.",
            "Paisley texture is characterized by intricate, curving and teardrop-shaped motifs with intricate details and vibrant colors.",
            "A paisley texture is visually distinguished by its intricate teardrop or droplet-shaped patterns, often with a swirling effect.",
            "A paisley texture typically features a smooth surface with intricate, curving patterns and a slightly raised feel."
        ],
        "fine_description": [
            "Paisley texture features intricate, curved shapes with teardrop-like patterns, distinguishing it from lacelike, frilly textures.",
            "Paisley is a swirling, intricate pattern with teardrop shapes, while lacelike and frilly are delicate, ornamental designs.",
            "The paisley texture is characterized by intricate, curving, and teardrop-shaped motifs arranged in a repetitive pattern.",
            "Paisley texture is characterized by intricate, droplet-shaped patterns with a distinct, curving teardrop or kidney shape.",
            "The paisley texture is characterized by intricate, swirling patterns and a slightly raised, velvety feel."
        ],
        "overall_description": [
            "Paisley is a textured pattern with intricate, curved teardrop-shaped designs, distinct from lace-like textures, and known for its unique droplet-like pattern with curved edges.",
            "Paisley is a unique, swirling pattern featuring intricate, droplet-shaped designs, distinguishing it from other textures, while also being delicate and ornamental in nature.",
            "Paisley is a texture featuring intricate, curving, and teardrop-shaped motifs with vibrant colors, arranged in a repetitive pattern, and displaying intricate details.",
            "Paisley is a texture with intricate teardrop or droplet-shaped patterns, often swirling and characterized by distinct, curving shapes.",
            "Paisley is a textured fabric with smooth, intricate, and curving patterns, along with a slightly raised, velvety feel."
        ],
        "structure": [
            [],
            [
                {
                    "A": "Paisley",
                    "R": "is",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "featuring",
                    "B": "designs"
                },
                {
                    "A": "designs",
                    "R": "distinguishing",
                    "B": "it"
                },
                {
                    "A": "Paisley",
                    "R": "is",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "distinguishing",
                    "B": "it"
                },
                {
                    "A": "texture",
                    "R": "being",
                    "B": "delicate"
                },
                {
                    "A": "texture",
                    "R": "being",
                    "B": "ornamental"
                },
                {
                    "A": "texture",
                    "R": "in",
                    "B": "nature"
                }
            ],
            [
                {
                    "A": "Paisley",
                    "R": "is",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "featuring",
                    "B": "intricate, curving, and teardrop-shaped motifs"
                },
                {
                    "A": "motifs",
                    "R": "with",
                    "B": "vibrant colors"
                },
                {
                    "A": "motifs",
                    "R": "arranged in",
                    "B": "repetitive pattern"
                },
                {
                    "A": "motifs",
                    "R": "displaying",
                    "B": "intricate details"
                }
            ],
            [
                {
                    "A": "Paisley",
                    "R": "is",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "with",
                    "B": "intricate teardrop or droplet-shaped patterns"
                },
                {
                    "A": "patterns",
                    "R": "often swirling and characterized by",
                    "B": "distinct, curving shapes"
                }
            ],
            [
                {
                    "A": "fabric",
                    "R": "has",
                    "B": "patterns"
                },
                {
                    "A": "fabric",
                    "R": "has",
                    "B": "feel"
                },
                {
                    "A": "patterns",
                    "R": "are",
                    "B": "intricate"
                },
                {
                    "A": "patterns",
                    "R": "are",
                    "B": "curving"
                },
                {
                    "A": "feel",
                    "R": "is",
                    "B": "raised"
                },
                {
                    "A": "feel",
                    "R": "is",
                    "B": "velvety"
                }
            ]
        ]
    },
    "perforated": {
        "coarse_description": [
            "A perforated texture is characterized by a pattern of small holes or openings evenly distributed across its surface.",
            "A perforated texture has small holes evenly distributed, while other textures may have varied patterns or solid surfaces.",
            "A perforated texture is defined by small holes or openings evenly distributed throughout the surface.",
            "A perforated texture can be visually distinguished by its repeated pattern of small holes or punctures.",
            "A perforated texture typically has a pattern of small, evenly spaced holes or openings on its surface."
        ],
        "fine_description": [
            "A perforated texture is characterized by evenly spaced holes or gaps that allow light or air to pass through.",
            "Perforated texture refers to a surface with small holes evenly spaced, providing a breathable and porous quality.",
            "A perforated texture is characterized by small, evenly spaced holes that are evenly distributed throughout the surface.",
            "A perforated texture is characterized by evenly spaced holes that create a pattern on the surface.",
            "A perforated texture typically consists of small, evenly spaced holes or punctures on its surface."
        ],
        "overall_description": [
            "Perforated textures are characterized by evenly distributed holes or gaps that allow light, air, or other substances to pass through.",
            "Perforated refers to a texture with evenly distributed small holes, creating a breathable and porous surface, distinguishing it from textures with varied patterns or solid surfaces.",
            "Perforated texture is characterized by small, evenly spaced holes or openings that are evenly distributed throughout the surface.",
            "Perforated is a texture with a repeated pattern of evenly spaced holes or punctures that create a visually distinct pattern on the surface.",
            "Perforated texture features small, evenly spaced holes or openings, creating a pattern of punctures on its surface."
        ],
        "structure": [
            [
                {
                    "A": "textures",
                    "R": "characterized by",
                    "B": "holes or gaps"
                },
                {
                    "A": "holes or gaps",
                    "R": "allow",
                    "B": "light, air, or other substances to pass through"
                }
            ],
            [
                {
                    "A": "Perforated",
                    "R": "refers to",
                    "B": "a texture with evenly distributed small holes"
                },
                {
                    "A": "a texture with evenly distributed small holes",
                    "R": "creating",
                    "B": "a breathable and porous surface"
                },
                {
                    "A": "a breathable and porous surface",
                    "R": "distinguishing it from",
                    "B": "textures with varied patterns or solid surfaces"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "perforated texture"
                },
                {
                    "A": "holes or openings",
                    "R": "evenly spaced",
                    "B": "small, evenly spaced holes or openings"
                },
                {
                    "A": "holes or openings",
                    "R": "evenly distributed throughout",
                    "B": "that are evenly distributed throughout the surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "Perforated"
                },
                {
                    "A": "texture",
                    "R": "has",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "consists of",
                    "B": "holes or punctures"
                },
                {
                    "A": "holes or punctures",
                    "R": "create",
                    "B": "visually distinct pattern"
                },
                {
                    "A": "visually distinct pattern",
                    "R": "is on",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "features",
                    "B": "small, evenly spaced holes or openings"
                },
                {
                    "A": "pattern",
                    "R": "creating",
                    "B": "a pattern of punctures on its surface"
                }
            ]
        ]
    },
    "pitted": {
        "coarse_description": [
            "Small, irregular depressions or indentations scattered across the surface, giving a pitted texture its distinct appearance.",
            "A pitted texture appears to have small, indented marks or holes on its surface, distinct from other textures.",
            "A pitted texture is characterized by small depressions or indentations on the surface, resembling tiny holes or craters.",
            "A pitted texture is visually distinguished by small, indented holes or depressions on the surface.",
            "A pitted texture typically has uneven, rough surfaces with small, indented or crater-like features."
        ],
        "fine_description": [
            "A pitted texture is characterized by small, evenly spaced indentations or depressions covering the surface.",
            "A pitted texture refers to a surface that has small, shallow holes or depressions distributed evenly.",
            "A pitted texture is characterized by small, shallow depressions or indentations on the surface.",
            "A pitted texture appears as small, indented, and irregularly spaced marks on the surface.",
            "A pitted texture typically has small, irregularly shaped indentations or craters on its surface."
        ],
        "overall_description": [
            "Pitted refers to a surface with small, irregular depressions or indentations, either scattered or evenly spaced, giving it a distinct texture.",
            "A pitted texture is characterized by small, indented marks or shallow holes evenly distributed across its surface, distinguishing it from other textures.",
            "Pitted texture is characterized by small depressions or indentations on the surface, resembling tiny holes or craters, which are shallow in nature.",
            "A pitted texture is characterized by small, indented holes or marks that are irregularly spaced and appear on the surface.",
            "A pitted texture is characterized by rough, uneven surfaces with small, irregularly shaped indentations or crater-like features."
        ],
        "structure": [
            [
                {
                    "A": "surface",
                    "R": "refers to",
                    "B": "pitted"
                },
                {
                    "A": "surface",
                    "R": "has",
                    "B": "small depressions"
                },
                {
                    "A": "surface",
                    "R": "has",
                    "B": "irregular depressions"
                },
                {
                    "A": "surface",
                    "R": "has",
                    "B": "indentations"
                },
                {
                    "A": "indentations",
                    "R": "are",
                    "B": "scattered"
                },
                {
                    "A": "indentations",
                    "R": "are",
                    "B": "evenly spaced"
                },
                {
                    "A": "surface",
                    "R": "gives",
                    "B": "distinct texture"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "pitted texture"
                },
                {
                    "A": "pitted texture",
                    "R": "is distinguished from",
                    "B": "other textures"
                },
                {
                    "A": "pitted texture",
                    "R": "is characterized by",
                    "B": "small, indented marks"
                },
                {
                    "A": "pitted texture",
                    "R": "is characterized by",
                    "B": "shallow holes"
                },
                {
                    "A": "small, indented marks",
                    "R": "are distributed across",
                    "B": "its surface"
                },
                {
                    "A": "shallow holes",
                    "R": "are distributed across",
                    "B": "its surface"
                }
            ],
            [
                {
                    "A": "Pitted texture",
                    "R": "is characterized by",
                    "B": "small depressions or indentations on the surface"
                },
                {
                    "A": "small depressions or indentations on the surface",
                    "R": "resembling",
                    "B": "tiny holes or craters"
                },
                {
                    "A": "tiny holes or craters",
                    "R": "are",
                    "B": "shallow in nature"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "pitted"
                },
                {
                    "A": "holes or marks",
                    "R": "appear on",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "surfaces"
                },
                {
                    "A": "surfaces",
                    "R": "with",
                    "B": "indentations"
                },
                {
                    "A": "indentations",
                    "R": "or",
                    "B": "features"
                }
            ]
        ]
    },
    "pleated": {
        "coarse_description": [
            "A pleated texture can be identified by its multiple parallel folds, creating a distinctive pattern of creases.",
            "A pleated texture appears as a series of folded and creased patterns, distinct from other textures in its structured and layered appearance.",
            "A pleated texture is characterized by parallel folds or creases that give a three-dimensional, accordion-like appearance.",
            "A pleated texture is visually distinguished by its evenly spaced, folded, and layered appearance.",
            "A pleated texture typically has evenly spaced folds or creases that create a three-dimensional, ribbed surface appearance."
        ],
        "fine_description": [
            "A pleated texture is characterized by multiple parallel folds that create a three-dimensional, rippled pattern.",
            "A pleated texture is characterized by evenly spaced folds or creases that add depth and dimension.",
            "A pleated texture is characterized by regular folds or creases that create a three-dimensional, structured pattern.",
            "A pleated texture is distinguished by its evenly spaced folds or creases running in parallel lines.",
            "A pleated texture typically features evenly spaced folds or creases, creating a structured and textured surface."
        ],
        "overall_description": [
            "A pleated texture is identified by its distinctive pattern of multiple parallel folds, creating a three-dimensional, rippled appearance.",
            "A pleated texture is a structured and layered pattern with evenly spaced folds or creases, adding depth and dimension to the object's surface.",
            "Pleated texture is defined by parallel, regular folds or creases that create a three-dimensional, accordion-like appearance with a structured pattern.",
            "Pleated texture is visually distinguished by evenly spaced, folded, and layered appearance, characterized by parallel lines of evenly spaced folds or creases.",
            "Pleated texture is characterized by evenly spaced folds or creases, creating a three-dimensional, ribbed and structured surface appearance."
        ],
        "structure": [
            [
                {
                    "A": "pleated texture",
                    "R": "is identified by",
                    "B": "distinctive pattern"
                },
                {
                    "A": "pleated texture",
                    "R": "is identified by",
                    "B": "multiple parallel folds"
                },
                {
                    "A": "pleated texture",
                    "R": "creates",
                    "B": "three-dimensional, rippled appearance"
                }
            ],
            [],
            [
                {
                    "A": "texture",
                    "R": "is defined by",
                    "B": "folds or creases"
                },
                {
                    "A": "folds or creases",
                    "R": "create",
                    "B": "three-dimensional, accordion-like appearance"
                },
                {
                    "A": "three-dimensional, accordion-like appearance",
                    "R": "has",
                    "B": "structured pattern"
                }
            ],
            [],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "pleated"
                },
                {
                    "A": "pleated",
                    "R": "creates",
                    "B": "folds"
                },
                {
                    "A": "pleated",
                    "R": "creates",
                    "B": "creases"
                },
                {
                    "A": "pleated",
                    "R": "creates",
                    "B": "surface appearance"
                },
                {
                    "A": "pleated",
                    "R": "creates",
                    "B": "three-dimensional appearance"
                },
                {
                    "A": "pleated",
                    "R": "creates",
                    "B": "ribbed appearance"
                },
                {
                    "A": "pleated",
                    "R": "creates",
                    "B": "structured appearance"
                }
            ]
        ]
    },
    "polka-dotted": {
        "coarse_description": [
            "Polka-dotted texture is uniquely characterized by regularly spaced circular dots of the same size and color.",
            "A polka-dotted texture has evenly spaced, round dots, contrasting with other textures that lack this specific pattern.",
            "A polka-dotted texture is characterized by evenly spaced, round or circular dots of the same size and color.",
            "A polka-dotted texture is distinguished visually by its repeated pattern of small, round dots in various colors or sizes.",
            "A polka-dotted texture typically consists of small, round dots evenly spaced on a smooth surface."
        ],
        "fine_description": [
            "Polka-dotted texture is characterized by round, evenly spaced dots of the same size and color.",
            "Polka-dotted texture refers to a pattern of regularly spaced, round dots on a surface, creating a playful and whimsical look.",
            "A polka-dotted texture is characterized by evenly spaced, round dots of the same size and color.",
            "A polka-dotted texture is distinguished by evenly spaced, round dots of the same size and color.",
            "A polka-dotted texture is characterized by small, evenly spaced, and round dots covering the surface."
        ],
        "overall_description": [
            "Polka-dotted texture is defined by evenly spaced, circular dots of the same size and color, forming a distinctive pattern.",
            "Polka-dotted refers to a playful pattern of evenly spaced, round dots on a surface, creating a whimsical and contrasting look.",
            "Polka-dotted refers to a texture with evenly spaced, round or circular dots of the same size and color.",
            "Polka-dotted texture is visually characterized by a repeated pattern of evenly spaced, round dots of the same size and color, in various colors or sizes.",
            "Polka-dotted refers to a texture with small, evenly spaced, round dots covering a smooth surface."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is defined by",
                    "B": "dots"
                },
                {
                    "A": "dots",
                    "R": "are",
                    "B": "spaced"
                },
                {
                    "A": "dots",
                    "R": "are",
                    "B": "circular"
                },
                {
                    "A": "dots",
                    "R": "are",
                    "B": "of the same size and color"
                },
                {
                    "A": "dots",
                    "R": "form",
                    "B": "a distinctive pattern"
                }
            ],
            [
                {
                    "A": "pattern",
                    "R": "refers to",
                    "B": "polka-dotted"
                },
                {
                    "A": "dots",
                    "R": "creates",
                    "B": "pattern"
                },
                {
                    "A": "dots",
                    "R": "are spaced on",
                    "B": "surface"
                },
                {
                    "A": "surface",
                    "R": "creates",
                    "B": "look"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "refers to",
                    "B": "Polka-dotted"
                },
                {
                    "A": "dots",
                    "R": "of",
                    "B": "same size and color"
                },
                {
                    "A": "dots",
                    "R": "are spaced evenly on",
                    "B": "texture"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is visually characterized by",
                    "B": "repeated pattern"
                },
                {
                    "A": "repeated pattern",
                    "R": "is visually characterized by",
                    "B": "round dots"
                },
                {
                    "A": "round dots",
                    "R": "is visually characterized by",
                    "B": "same size and color"
                },
                {
                    "A": "round dots",
                    "R": "is visually characterized by",
                    "B": "in various colors or sizes"
                }
            ],
            [
                {
                    "A": "Polka-dotted",
                    "R": "refers to",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "has",
                    "B": "dots"
                },
                {
                    "A": "dots",
                    "R": "cover",
                    "B": "surface"
                }
            ]
        ]
    },
    "porous": {
        "coarse_description": [
            "Presence of small holes or gaps distributed unevenly across the surface is a unique visual cue of a porous texture.",
            "A porous texture appears to have small, interconnected holes or gaps, unlike other types of textures which lack these features.",
            "A porous texture is characterized by the presence of small, interconnected holes or voids on its surface.",
            "A porous texture appears to have small, interconnected holes or spaces on its surface.",
            "A porous texture typically has small, interconnected holes or voids that allow for the absorption or passage of fluids or gases."
        ],
        "fine_description": [
            "A porous texture typically exhibits numerous interconnected small holes or openings on its surface.",
            "A porous texture refers to a material that has small openings or spaces, allowing the passage of fluids or air.",
            "A porous texture has numerous small holes or spaces that allow substances to pass through easily.",
            "A porous texture is characterized by small, interconnected openings or voids, allowing the passage of liquids or gases.",
            "A porous texture typically consists of small, interconnected holes or voids on its surface."
        ],
        "overall_description": [
            "A porous texture is characterized by the presence of unevenly distributed small holes or openings, forming an interconnected network on its surface.",
            "A porous texture is characterized by small interconnected holes or gaps that allow the passage of fluids or air.",
            "A porous texture is characterized by the presence of interconnected holes or voids on its surface, allowing substances to pass through easily.",
            "A porous texture is characterized by small, interconnected holes or openings on its surface, enabling the passage of liquids or gases.",
            "Porous objects have small, interconnected holes or voids on their surface or throughout their structure, allowing for the absorption or passage of fluids or gases."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "presence of small holes or openings"
                },
                {
                    "A": "holes or openings",
                    "R": "forming",
                    "B": "interconnected network"
                }
            ],
            [
                {
                    "A": "porous texture",
                    "R": "is characterized by",
                    "B": "small interconnected holes or gaps"
                },
                {
                    "A": "small interconnected holes or gaps",
                    "R": "allow",
                    "B": "passage of fluids or air"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "presence"
                },
                {
                    "A": "presence",
                    "R": "is characterized by",
                    "B": "holes or voids"
                },
                {
                    "A": "holes or voids",
                    "R": "are interconnected with",
                    "B": "surface"
                },
                {
                    "A": "surface",
                    "R": "allows",
                    "B": "substances to pass through easily"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "holes"
                },
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "openings"
                },
                {
                    "A": "holes",
                    "R": "enable passage of",
                    "B": "liquids"
                },
                {
                    "A": "holes",
                    "R": "enable passage of",
                    "B": "gases"
                },
                {
                    "A": "openings",
                    "R": "enable passage of",
                    "B": "liquids"
                },
                {
                    "A": "openings",
                    "R": "enable passage of",
                    "B": "gases"
                }
            ],
            [
                {
                    "A": "objects",
                    "R": "have",
                    "B": "holes"
                },
                {
                    "A": "objects",
                    "R": "have",
                    "B": "voids"
                },
                {
                    "A": "holes",
                    "R": "on",
                    "B": "surface"
                },
                {
                    "A": "voids",
                    "R": "throughout",
                    "B": "structure"
                },
                {
                    "A": "objects",
                    "R": "allowing for",
                    "B": "absorption"
                },
                {
                    "A": "objects",
                    "R": "allowing for",
                    "B": "passage"
                },
                {
                    "A": "absorption",
                    "R": "of",
                    "B": "fluids"
                },
                {
                    "A": "passage",
                    "R": "of",
                    "B": "fluids"
                },
                {
                    "A": "passage",
                    "R": "of",
                    "B": "gases"
                }
            ]
        ]
    },
    "potholed": {
        "coarse_description": [
            "Uneven and bumpy surface with irregular depressions is the unique visual cue of a potholed texture.",
            "A potholed texture appears rough and uneven, distinct from other textures that are typically smoother and more uniform.",
            "A potholed texture is characterized by irregular depressions or holes on the surface, giving it an uneven and bumpy appearance.",
            "A potholed texture is characterized by irregular depressions and bumps on the surface, resembling small craters or holes.",
            "A potholed texture typically exhibits rough and uneven surface characteristics with irregular depressions or indentations."
        ],
        "fine_description": [
            "Potholed texture displays irregular and deep craters, distinguishing it from pitted and bumpy textures.",
            "A potholed texture has uneven and rough depressions on its surface, resembling small craters or holes.",
            "A potholed texture appears as uneven, irregular depressions or holes on a surface, giving it a rugged appearance.",
            "A potholed texture appears as irregular, deep holes on the surface, creating an uneven and rough appearance.",
            "A potholed texture typically consists of irregular depressions or craters on the surface, creating an uneven and rough feel."
        ],
        "overall_description": [
            "A potholed texture is characterized by an uneven and bumpy surface with irregular depressions and deep craters, distinguishing it from pitted and bumpy textures.",
            "Potholed texture is characterized by its rough and uneven appearance, with depressions resembling small craters or holes on its surface.",
            "A potholed texture is characterized by uneven and bumpy surfaces with irregular depressions or holes, giving it a rugged and rugged appearance.",
            "A potholed texture is characterized by irregular depressions, bumps, and deep holes on the surface, creating an uneven, rough appearance resembling small craters.",
            "A potholed texture is characterized by a rough and uneven surface with irregular depressions or craters, creating an uneven and rough feel."
        ],
        "structure": [
            [
                {
                    "A": "potholed texture",
                    "R": "is characterized by",
                    "B": "uneven and bumpy surface with irregular depressions and deep craters"
                },
                {
                    "A": "potholed texture",
                    "R": "distinguishing",
                    "B": "it from pitted and bumpy textures"
                }
            ],
            [
                {
                    "A": "Potholed texture",
                    "R": "is characterized by",
                    "B": "rough and uneven appearance"
                },
                {
                    "A": "rough and uneven appearance",
                    "R": "resembles",
                    "B": "small craters or holes on its surface"
                }
            ],
            [
                {
                    "A": "potholed texture",
                    "R": "is characterized by",
                    "B": "uneven and bumpy surfaces with irregular depressions or holes"
                },
                {
                    "A": "potholed texture",
                    "R": "gives",
                    "B": "it a rugged and rugged appearance"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "potholed"
                },
                {
                    "A": "potholed",
                    "R": "is characterized by",
                    "B": "irregular depressions, bumps, and deep holes"
                },
                {
                    "A": "irregular depressions, bumps, and deep holes",
                    "R": "create",
                    "B": "an uneven, rough appearance"
                },
                {
                    "A": "an uneven, rough appearance",
                    "R": "resembles",
                    "B": "small craters"
                }
            ],
            [
                {
                    "A": "potholed texture",
                    "R": "is characterized by",
                    "B": "rough and uneven surface"
                },
                {
                    "A": "rough and uneven surface",
                    "R": "with",
                    "B": "irregular depressions or craters"
                },
                {
                    "A": "irregular depressions or craters",
                    "R": "creating",
                    "B": "an uneven and rough feel"
                }
            ]
        ]
    },
    "scaly": {
        "coarse_description": [
            "The presence of overlapping, plate-like structures is a unique visual cue for a scaly texture.",
            "A scaly texture appears rough and layered, differing from other textures like smooth, bumpy, or fibrous.",
            "A scaly texture is characterized by a rough surface with small, overlapping, and distinct plate-like structures.",
            "A scaly texture is visually distinguished by its pattern of overlapping, rigid, and raised scales on the surface.",
            "A scaly texture typically consists of small, overlapping, and raised patterns resembling the scales of a reptile."
        ],
        "fine_description": [
            "A scaly texture typically exhibits a pattern of overlapping, thin, and flat plates or flakes.",
            "A scaly texture is characterized by small, overlapping, and rigid plates covering the surface.",
            "A scaly texture is characterized by small, overlapping, and closely spaced raised patterns resembling reptilian scales.",
            "A scaly texture is characterized by small, overlapping, and distinct patterns resembling reptile scales.",
            "A scaly texture is characterized by small, overlapping, and irregular patterns resembling the scales of a reptile."
        ],
        "overall_description": [
            "Scaly texture is characterized by the presence of overlapping, thin, flat plates or flakes, providing a unique visual cue.",
            "A scaly texture is rough and layered, with small, overlapping, and rigid plates covering the surface, distinguishing it from smooth, bumpy, or fibrous textures.",
            "Scaly texture refers to a rough surface with small, distinct, and overlapping plate-like structures or closely spaced raised patterns resembling reptilian scales.",
            "Scaly textures are visually defined by patterns of overlapping, rigid, raised scales resembling those found on reptiles.",
            "A scaly texture is characterized by small, overlapping, raised, and irregular patterns resembling the scales of a reptile."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "presence of plates or flakes"
                },
                {
                    "A": "plates or flakes",
                    "R": "provide",
                    "B": "visual cue"
                }
            ],
            [
                {
                    "A": "scaly texture",
                    "R": "is",
                    "B": "rough and layered"
                },
                {
                    "A": "rough and layered",
                    "R": "with",
                    "B": "small, overlapping, and rigid plates covering the surface"
                },
                {
                    "A": "small, overlapping, and rigid plates covering the surface",
                    "R": "distinguishing",
                    "B": "it from smooth, bumpy, or fibrous textures"
                }
            ],
            [
                {
                    "A": "Scaly texture",
                    "R": "refers to",
                    "B": "rough surface"
                },
                {
                    "A": "rough surface",
                    "R": "has",
                    "B": "small, distinct, and overlapping plate-like structures"
                },
                {
                    "A": "rough surface",
                    "R": "has",
                    "B": "closely spaced raised patterns resembling reptilian scales"
                }
            ],
            [
                {
                    "A": "textures",
                    "R": "defined by",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "resembling",
                    "B": "scales"
                },
                {
                    "A": "scales",
                    "R": "found on",
                    "B": "reptiles"
                }
            ],
            [
                {
                    "A": "scaly texture",
                    "R": "is characterized by",
                    "B": "small, overlapping, raised, and irregular patterns resembling the scales of a reptile"
                }
            ]
        ]
    },
    "smeared": {
        "coarse_description": [
            "A smeared texture typically exhibits an irregular and blurred appearance, lacking clear and defined patterns or details.",
            "A smeared texture appears as if it has been spread or blurred, distinguishing it from other types of texture.",
            "A smeared texture typically appears as a blurred and uneven surface with random streaks or smudges.",
            "A smeared texture appears as a blurred or softened surface, lacking distinct details and crispness.",
            "A smeared texture typically has a smooth and uneven surface with blurred and streaky marks."
        ],
        "fine_description": [
            "Smeared texture is characterized by a blurred and spread-out appearance, with no distinguishable patterns or specks.",
            "A smeared texture appears as if it has been spread or blurred, lacking defined edges or distinct patterns.",
            "A smeared texture has a blurred and spread out appearance, giving it a soft and hazy look.",
            "A smeared texture appears as a blurred and uneven surface with irregular and distorted patterns.",
            "A smeared texture typically has a smooth and blurred surface with uneven or streaky marks."
        ],
        "overall_description": [
            "Smeared texture is an irregular and blurred appearance without clear patterns or details, characterized by a spread-out and blurred look with no distinguishable patterns or specks.",
            "A smeared texture is characterized by a spread or blurred appearance, lacking defined edges or distinct patterns, distinguishing it from other types of texture.",
            "A smeared texture is characterized by a blurred and uneven surface with random streaks or smudges, giving it a soft, hazy, and spread out appearance.",
            "Smeared texture is a blurred, softened, and uneven surface with distorted patterns, lacking distinct details and crispness.",
            "A smeared texture is characterized by a smooth and uneven surface with blurred, streaky marks, creating a generally smooth and blurred appearance."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "appearance"
                },
                {
                    "A": "appearance",
                    "R": "without",
                    "B": "patterns"
                },
                {
                    "A": "appearance",
                    "R": "without",
                    "B": "details"
                },
                {
                    "A": "appearance",
                    "R": "characterized by",
                    "B": "look"
                },
                {
                    "A": "look",
                    "R": "with",
                    "B": "patterns"
                },
                {
                    "A": "look",
                    "R": "with",
                    "B": "specks"
                },
                {
                    "A": "look",
                    "R": "blurred",
                    "B": "spread-out"
                },
                {
                    "A": "look",
                    "R": "blurred",
                    "B": "distinguishable"
                }
            ],
            [
                {
                    "A": "smeared texture",
                    "R": "characterized by",
                    "B": "spread or blurred appearance"
                },
                {
                    "A": "smeared texture",
                    "R": "characterized by",
                    "B": "lacking defined edges"
                },
                {
                    "A": "smeared texture",
                    "R": "characterized by",
                    "B": "lacking distinct patterns"
                },
                {
                    "A": "smeared texture",
                    "R": "distinguishing it from",
                    "B": "other types of texture"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "blurred and uneven surface"
                },
                {
                    "A": "surface",
                    "R": "has",
                    "B": "random streaks or smudges"
                },
                {
                    "A": "surface",
                    "R": "gives",
                    "B": "soft, hazy, and spread out appearance"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "surface"
                },
                {
                    "A": "surface",
                    "R": "has",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "are",
                    "B": "distorted"
                },
                {
                    "A": "patterns",
                    "R": "lack",
                    "B": "details"
                },
                {
                    "A": "patterns",
                    "R": "lack",
                    "B": "crispness"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "smooth and uneven surface"
                },
                {
                    "A": "surface",
                    "R": "has",
                    "B": "blurred, streaky marks"
                },
                {
                    "A": "marks",
                    "R": "create",
                    "B": "smooth and blurred appearance"
                }
            ]
        ]
    },
    "spiralled": {
        "coarse_description": [
            "The unique visual cue of a spiralled texture is a pattern that resembles a coiling spiral shape.",
            "A spiralled texture appears as a coiled pattern, distinct from other textures due to its twisting and winding appearance.",
            "A spiralled texture is characterized by a twisting, coiled pattern that repeats in a circular or helical manner.",
            "A spiralled texture is visually characterized by a winding pattern that resembles the shape of a spiral.",
            "A spiralled texture typically exhibits a repetitive pattern of curved lines or coils on its surface."
        ],
        "fine_description": [
            "Spiralled texture consists of continuous, coiling lines that gradually curve inward or outward.",
            "A spiralled texture consists of smooth, continuous curves that wrap around a central point in a twisting fashion.",
            "A spiralled texture consists of a continuous, tightly wound pattern that follows a central axis.",
            "A spiralled texture consists of continuous and uniform curves wrapping around a central point.",
            "A spiralled texture typically has smooth, continuous curves that wrap around a central point."
        ],
        "overall_description": [
            "Spiralled texture is characterized by a distinct pattern resembling a coiling spiral shape, with continuous, coiling lines that gradually curve inward or outward.",
            "A spiralled texture is a distinct, coiled pattern with smooth, continuous curves that twist and wind around a central point.",
            "A spiralled texture is a tightly wound, twisting pattern that follows a central axis in a circular or helical manner.",
            "A spiralled texture is visually characterized by a winding pattern that resembles a spiral, consisting of continuous and uniform curves wrapping around a central point.",
            "A spiralled texture is characterized by a repetitive pattern of smooth, continuous curves or coils that wrap around a central point."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "resembling",
                    "B": "shape"
                },
                {
                    "A": "shape",
                    "R": "with",
                    "B": "lines"
                },
                {
                    "A": "lines",
                    "R": "that gradually curve",
                    "B": "inward"
                },
                {
                    "A": "lines",
                    "R": "that gradually curve",
                    "B": "outward"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "has",
                    "B": "curves"
                },
                {
                    "A": "curves",
                    "R": "twist and wind",
                    "B": "around a central point"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "follows",
                    "B": "axis"
                },
                {
                    "A": "axis",
                    "R": "in",
                    "B": "manner"
                }
            ],
            [
                {
                    "A": "spiralled texture",
                    "R": "is visually characterized by",
                    "B": "winding pattern"
                },
                {
                    "A": "winding pattern",
                    "R": "resembles",
                    "B": "spiral"
                },
                {
                    "A": "spiral",
                    "R": "consisting of",
                    "B": "continuous and uniform curves wrapping around a central point"
                }
            ],
            [
                {
                    "A": "spiralled texture",
                    "R": "characterized by",
                    "B": "repetitive pattern"
                },
                {
                    "A": "repetitive pattern",
                    "R": "characterized by",
                    "B": "smooth, continuous curves or coils"
                },
                {
                    "A": "smooth, continuous curves or coils",
                    "R": "wrap around",
                    "B": "central point"
                }
            ]
        ]
    },
    "sprinkled": {
        "coarse_description": [
            "The unique visual cue of a sprinkled texture is the presence of small, scattered particles or dots.",
            "A sprinkled texture appears as if small particles or dots are scattered randomly on the surface.",
            "A sprinkled texture is characterized by small, scattered particles or droplets dispersed evenly across a surface.",
            "A sprinkled texture is visually distinguished by the presence of small, scattered particles or specks on the surface.",
            "A sprinkled texture is characterized by small, scattered particles or specks evenly distributed across the surface."
        ],
        "fine_description": [
            "Sprinkled texture has evenly distributed small particles, giving a random and scattered appearance.",
            "A sprinkled texture consists of small, scattered particles evenly distributed over a surface, creating a speckled appearance.",
            "A sprinkled texture is characterized by randomly scattered and evenly distributed small particles or dots on a surface.",
            "A sprinkled texture consists of evenly distributed small particles covering a surface in a random pattern.",
            "Sprinkled texture typically consists of scattered particles or specks evenly distributed on the surface."
        ],
        "overall_description": [
            "Sprinkled texture is characterized by the presence of small, scattered particles or dots that are evenly distributed, giving a random and scattered appearance.",
            "A sprinkled texture is characterized by the random scattering of small particles or dots, creating an evenly distributed, speckled appearance on the surface.",
            "A sprinkled texture is defined by small particles or droplets that are randomly scattered and evenly distributed across a surface.",
            "A sprinkled texture is characterized by the presence of small particles or specks that are scattered and evenly distributed in a random pattern on the surface.",
            "A sprinkled texture is defined by the presence of small, scattered particles or specks that are evenly distributed across its surface."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "presence"
                },
                {
                    "A": "particles",
                    "R": "are distributed",
                    "B": "evenly"
                },
                {
                    "A": "particles",
                    "R": "are scattered",
                    "B": "randomly"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "random scattering"
                },
                {
                    "A": "random scattering",
                    "R": "creating",
                    "B": "speckled appearance"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is defined by",
                    "B": "particles"
                },
                {
                    "A": "particles",
                    "R": "are scattered",
                    "B": "surface"
                },
                {
                    "A": "particles",
                    "R": "are distributed across",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "presence of small particles or specks"
                },
                {
                    "A": "particles or specks",
                    "R": "scattered and evenly distributed in",
                    "B": "random pattern on the surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is defined by",
                    "B": "presence of small, scattered particles or specks"
                },
                {
                    "A": "particles or specks",
                    "R": "are evenly distributed across",
                    "B": "surface"
                }
            ]
        ]
    },
    "stained": {
        "coarse_description": [
            "The unique visual cue of a stained texture is the presence of discoloration or marks on its surface.",
            "A stained texture has visible marks or discoloration that differentiate it from other types of texture.",
            "A stained texture typically exhibits discoloration or markings caused by the absorption or deposition of foreign substances.",
            "A stained texture is visually distinguished by the presence of discoloration or marks on its surface.",
            "A stained texture typically has an uneven and blotchy surface with discoloration or marking caused by a staining agent."
        ],
        "fine_description": [
            "A stained texture appears as discolored patches or marks, distinct from the appearance of blotchy or smeared textures.",
            "A stained texture refers to a surface that has been discolored or marked in a consistent and uniform manner.",
            "A stained texture has irregular patches or marks on its surface, while blotchy and smeared textures lack distinct patterns or marks.",
            "A stained texture appears discolored or tinted due to the presence of a substance, without any distinct smearing or blotchiness.",
            "A stained texture typically has a mottled or discolored appearance, with uneven patches or marks on the surface."
        ],
        "overall_description": [
            "A stained texture is characterized by the presence of distinct discoloration or marks, differentiating it from blotchy or smeared textures.",
            "A stained texture is characterized by visible marks or discoloration that differentiate it from other textures, appearing in a consistent and uniform manner.",
            "A stained texture is characterized by discoloration, markings, irregular patches, and distinct patterns caused by the absorption or deposition of foreign substances.",
            "A stained texture is visually characterized by discoloration or marks on its surface, appearing discolored or tinted due to the presence of a substance without distinct smearing or blotchiness.",
            "A stained texture usually exhibits an uneven and blotchy surface with discoloration, marking, mottled appearance, and uneven patches or marks."
        ],
        "structure": [
            [
                {
                    "A": "stained texture",
                    "R": "is characterized by",
                    "B": "presence of distinct discoloration or marks"
                },
                {
                    "A": "stained texture",
                    "R": "differentiating",
                    "B": "from blotchy or smeared textures"
                }
            ],
            [
                {
                    "A": "stained texture",
                    "R": "characterized by",
                    "B": "visible marks or discoloration"
                },
                {
                    "A": "stained texture",
                    "R": "characterized by",
                    "B": "differentiate it from other textures"
                },
                {
                    "A": "stained texture",
                    "R": "appearing in",
                    "B": "a consistent and uniform manner"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "stained texture"
                },
                {
                    "A": "stained texture",
                    "R": "caused by",
                    "B": "absorption or deposition of foreign substances"
                },
                {
                    "A": "stained texture",
                    "R": "characterized by",
                    "B": "discoloration"
                },
                {
                    "A": "stained texture",
                    "R": "characterized by",
                    "B": "markings"
                },
                {
                    "A": "stained texture",
                    "R": "characterized by",
                    "B": "irregular patches"
                },
                {
                    "A": "stained texture",
                    "R": "characterized by",
                    "B": "distinct patterns"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "discoloration or marks"
                },
                {
                    "A": "texture",
                    "R": "appearing",
                    "B": "discolored or tinted"
                },
                {
                    "A": "texture",
                    "R": "due to",
                    "B": "presence of substance"
                },
                {
                    "A": "substance",
                    "R": "without",
                    "B": "distinct smearing or blotchiness"
                }
            ],
            [
                {
                    "A": "stained texture",
                    "R": "usually exhibits",
                    "B": "uneven and blotchy surface"
                },
                {
                    "A": "stained texture",
                    "R": "usually exhibits",
                    "B": "discoloration"
                },
                {
                    "A": "stained texture",
                    "R": "usually exhibits",
                    "B": "marking"
                },
                {
                    "A": "stained texture",
                    "R": "usually exhibits",
                    "B": "mottled appearance"
                },
                {
                    "A": "stained texture",
                    "R": "usually exhibits",
                    "B": "uneven patches or marks"
                }
            ]
        ]
    },
    "stratified": {
        "coarse_description": [
            "Distinct layers or bands of different colors or textures are unique to a stratified texture.",
            "A stratified texture appears in distinct layers, while other textures may lack these visible layers.",
            "A stratified texture is characterized by distinct layers or bands that are clearly visible within the object's surface.",
            "A stratified texture appears as distinct layers or bands, differentiating it from other textures with uniform or random patterns.",
            "A stratified texture typically exhibits distinct layers or bands of different colors, patterns, or materials."
        ],
        "fine_description": [
            "A stratified texture has distinct, parallel layers stacked on top of each other, creating a layered appearance.",
            "A stratified texture consists of distinct layers that are clearly visible and arranged in a pattern.",
            "A stratified texture is characterized by distinct layers or bands, creating a visibly stacked or tiered pattern.",
            "A stratified texture is characterized by distinct layers or bands running parallel to each other.",
            "A stratified texture typically has distinct layers or bands that are clearly visible and distinguishable."
        ],
        "overall_description": [
            "A stratified texture is characterized by distinct layers or bands of different colors or textures, creating a unique, parallel, and layered appearance.",
            "A stratified texture is characterized by distinct, visible layers arranged in a pattern, distinguishing it from textures lacking such visible layers.",
            "A stratified texture is characterized by clearly visible distinct layers or bands, creating a visibly stacked or tiered pattern on the object's surface.",
            "A stratified texture is distinguished by distinct layers or bands that run parallel to each other, setting it apart from textures with uniform or random patterns.",
            "A stratified texture is characterized by clearly visible and distinguishable layers or bands of different colors, patterns, or materials."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "distinct layers or bands"
                },
                {
                    "A": "layers or bands",
                    "R": "create",
                    "B": "unique, parallel, and layered appearance"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "distinct, visible layers"
                },
                {
                    "A": "layers",
                    "R": "arranged in",
                    "B": "a pattern"
                },
                {
                    "A": "pattern",
                    "R": "distinguishing",
                    "B": "it from textures lacking such visible layers"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "layers"
                },
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "bands"
                },
                {
                    "A": "layers",
                    "R": "create",
                    "B": "pattern"
                },
                {
                    "A": "bands",
                    "R": "create",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "is",
                    "B": "stacked"
                },
                {
                    "A": "pattern",
                    "R": "is",
                    "B": "tiered"
                },
                {
                    "A": "pattern",
                    "R": "is",
                    "B": "visibly"
                },
                {
                    "A": "pattern",
                    "R": "is",
                    "B": "on object's surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is distinguished by",
                    "B": "distinct layers"
                },
                {
                    "A": "layers",
                    "R": "run parallel to",
                    "B": "each other"
                },
                {
                    "A": "texture",
                    "R": "is set apart from",
                    "B": "textures with uniform or random patterns"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "layers or bands"
                },
                {
                    "A": "layers or bands",
                    "R": "are of",
                    "B": "different colors, patterns, or materials"
                }
            ]
        ]
    },
    "striped": {
        "coarse_description": [
            "The unique visual cue of a striped texture is the presence of evenly spaced parallel lines or bands.",
            "A striped texture consists of parallel lines, while other textures can vary in patterns, shapes, and arrangements.",
            "A striped texture is characterized by parallel lines of alternating colors, widths, or tones running across the surface.",
            "A striped texture is characterized by parallel lines of varying widths and colors running across the surface.",
            "A striped texture typically has alternating lines or bands of different colors or shades."
        ],
        "fine_description": [
            "The unique visual cue of a striped texture is the presence of parallel lines of different colors or shades.",
            "A striped texture consists of parallel lines of alternating colors or patterns, creating a visually linear and repetitive appearance.",
            "Striped texture is characterized by parallel lines of equal width that run along the surface.",
            "A striped texture is visually characterized by parallel lines of different colors or shades running across the surface.",
            "A striped texture typically consists of evenly spaced, parallel lines of different colors or tones."
        ],
        "overall_description": [
            "A striped texture is characterized by the presence of evenly spaced parallel lines or bands of different colors or shades.",
            "A striped texture is characterized by parallel lines of alternating colors or patterns, creating a visually linear and repetitive appearance within a larger variety of textures.",
            "Striped refers to a texture with parallel lines of alternating or equal width, colors, tones, or widths that run across the surface.",
            "A striped texture is characterized by visually appealing parallel lines of varying widths, colors, or shades running across the surface.",
            "A striped texture features alternating lines or evenly spaced, parallel bands of different colors or shades, creating a visually distinct pattern."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "presence"
                },
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "striped"
                },
                {
                    "A": "striped",
                    "R": "characterized by",
                    "B": "parallel lines"
                },
                {
                    "A": "parallel lines",
                    "R": "characterized by",
                    "B": "evenly spaced"
                },
                {
                    "A": "lines",
                    "R": "characterized by",
                    "B": "different colors"
                },
                {
                    "A": "lines",
                    "R": "characterized by",
                    "B": "different shades"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "striped texture"
                },
                {
                    "A": "lines",
                    "R": "of",
                    "B": "alternating colors or patterns"
                },
                {
                    "A": "striped texture",
                    "R": "creating",
                    "B": "visually linear and repetitive appearance"
                },
                {
                    "A": "appearance",
                    "R": "within",
                    "B": "variety of textures"
                }
            ],
            [
                {
                    "A": "Striped",
                    "R": "refers to",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "has",
                    "B": "parallel lines"
                },
                {
                    "A": "parallel lines",
                    "R": "are of",
                    "B": "alternating or equal width"
                },
                {
                    "A": "parallel lines",
                    "R": "have",
                    "B": "colors"
                },
                {
                    "A": "parallel lines",
                    "R": "have",
                    "B": "tones"
                },
                {
                    "A": "parallel lines",
                    "R": "have",
                    "B": "widths"
                },
                {
                    "A": "parallel lines",
                    "R": "run across",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "striped"
                },
                {
                    "A": "lines",
                    "R": "run across",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "features",
                    "B": "striped lines"
                },
                {
                    "A": "lines",
                    "R": "alternate",
                    "B": "colors"
                },
                {
                    "A": "lines",
                    "R": "alternate",
                    "B": "shades"
                },
                {
                    "A": "bands",
                    "R": "are spaced",
                    "B": "evenly"
                },
                {
                    "A": "bands",
                    "R": "have",
                    "B": "colors"
                },
                {
                    "A": "bands",
                    "R": "have",
                    "B": "shades"
                },
                {
                    "A": "pattern",
                    "R": "is",
                    "B": "visually distinct"
                }
            ]
        ]
    },
    "studded": {
        "coarse_description": [
            "The unique visual cue of a studded texture is the presence of small, raised, and pointy protrusions.",
            "A studded texture has small raised features resembling studs, unlike other textures which lack these distinct protrusions.",
            "A studded texture is characterized by the presence of small, raised protrusions evenly distributed across a surface.",
            "A studded texture is visually distinguished by its surface covered with small, raised and pointed elements.",
            "A studded texture typically consists of raised, evenly spaced protrusions on a surface, providing a tactile and rugged feel."
        ],
        "fine_description": [
            "A studded texture has raised, pointed protrusions that distinguish it from dotted or pitted textures.",
            "A studded texture refers to the presence of small raised or protruding elements on the surface.",
            "A studded texture is characterized by small, raised protrusions evenly spaced across a surface, creating a bumpy appearance.",
            "A studded texture is characterized by small raised elements evenly distributed across the surface.",
            "A studded texture typically has small, raised protrusions evenly spaced across its surface, resembling small studs or bumps."
        ],
        "overall_description": [
            "A studded texture is characterized by small, raised, and pointy protrusions that differentiate it from dotted or pitted textures.",
            "Studded refers to a texture with small raised features resembling studs, giving it a distinct and unique appearance on the surface.",
            "A studded texture is created by small, evenly distributed raised protrusions that give the surface a bumpy appearance.",
            "A studded texture is visually distinguished by its surface covered with small, raised and pointed elements, evenly distributed across the surface.",
            "Studded texture is characterized by evenly spaced raised protrusions on a surface, giving a tactile and rugged feel, resembling small studs or bumps."
        ],
        "structure": [
            [
                {
                    "A": "studded texture",
                    "R": "characterized by",
                    "B": "small, raised, and pointy protrusions"
                },
                {
                    "A": "studded texture",
                    "R": "differentiate",
                    "B": "from dotted or pitted textures"
                }
            ],
            [
                {
                    "A": "Studded",
                    "R": "refers to",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "has",
                    "B": "small raised features"
                },
                {
                    "A": "small raised features",
                    "R": "resemble",
                    "B": "studs"
                },
                {
                    "A": "studs",
                    "R": "give",
                    "B": "distinct and unique appearance"
                },
                {
                    "A": "distinct and unique appearance",
                    "R": "is on",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is created by",
                    "B": "raised protrusions"
                },
                {
                    "A": "protrusions",
                    "R": "give",
                    "B": "surface"
                },
                {
                    "A": "surface",
                    "R": "has",
                    "B": "appearance"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "distinguished by",
                    "B": "surface"
                },
                {
                    "A": "surface",
                    "R": "covered with",
                    "B": "elements"
                },
                {
                    "A": "elements",
                    "R": "distributed across",
                    "B": "surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "protrusions"
                },
                {
                    "A": "protrusions",
                    "R": "giving",
                    "B": "feel"
                },
                {
                    "A": "protrusions",
                    "R": "resembling",
                    "B": "studs"
                },
                {
                    "A": "protrusions",
                    "R": "resembling",
                    "B": "bumps"
                }
            ]
        ]
    },
    "swirly": {
        "coarse_description": [
            "The unique visual cue of a swirly texture is the presence of twisting, curving patterns in a fluid manner.",
            "A swirly texture has curving and twisting patterns, distinguishing it from other textures that lack such dynamic movements.",
            "A swirly texture is characterized by curved or spiraling patterns that create a sense of movement and flow.",
            "A swirly texture is visually distinguished by its curved and twisting patterns that create a sense of movement.",
            "A swirly texture typically exhibits smooth curves and flowing patterns, resembling the movements of swirling motion."
        ],
        "fine_description": [
            "A swirly texture has curved and intertwined lines that create a sense of fluid motion.",
            "A swirly texture appears as smooth, curving lines that create a sense of continuous motion.",
            "A swirly texture has curved lines that gently flow and interweave, creating a sense of graceful movement.",
            "A swirly texture appears as fluid, curvaceous patterns that seamlessly flow in a circular or wavy motion.",
            "A swirly texture typically has smoothly curving patterns that flow in circular or winding motions."
        ],
        "overall_description": [
            "A swirly texture is characterized by twisting, curving patterns that create a sense of fluid motion, with curved and intertwined lines.",
            "Swirly is a unique texture characterized by curving and twisting patterns that create a continuous sense of motion through smooth, dynamic movements.",
            "Swirly texture is characterized by curved or spiraling lines that flow and interweave, creating a sense of graceful movement and flow.",
            "Swirly encompasses visually distinct, curved and twisting patterns that create a sense of movement, appearing as fluid, curvaceous patterns that seamlessly flow in circular or wavy motion.",
            "Swirly textures are characterized by smooth, flowing patterns with circular or winding motions, resembling the movements of swirling motion."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "twisting patterns"
                },
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "curving patterns"
                },
                {
                    "A": "patterns",
                    "R": "create",
                    "B": "sense of fluid motion"
                },
                {
                    "A": "patterns",
                    "R": "create",
                    "B": "curved lines"
                },
                {
                    "A": "patterns",
                    "R": "create",
                    "B": "intertwined lines"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "curving and twisting patterns"
                },
                {
                    "A": "patterns",
                    "R": "create",
                    "B": "continuous sense of motion"
                },
                {
                    "A": "continuous sense of motion",
                    "R": "through",
                    "B": "smooth, dynamic movements"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "curved or spiraling lines"
                },
                {
                    "A": "curved or spiraling lines",
                    "R": "flow and interweave, creating",
                    "B": "a sense of graceful movement and flow"
                }
            ],
            [
                {
                    "A": "Swirly",
                    "R": "encompasses",
                    "B": "visually distinct, curved and twisting patterns"
                },
                {
                    "A": "patterns",
                    "R": "create",
                    "B": "a sense of movement"
                },
                {
                    "A": "patterns",
                    "R": "appear",
                    "B": "as fluid, curvaceous patterns"
                },
                {
                    "A": "patterns",
                    "R": "flow",
                    "B": "in circular or wavy motion"
                }
            ],
            [
                {
                    "A": "textures",
                    "R": "are characterized by",
                    "B": "smooth, flowing patterns"
                },
                {
                    "A": "patterns",
                    "R": "with",
                    "B": "circular or winding motions"
                },
                {
                    "A": "motions",
                    "R": "resembling",
                    "B": "movements of swirling motion"
                }
            ]
        ]
    },
    "veined": {
        "coarse_description": [
            "The unique visual cue of a veined texture is the presence of distinct, branching lines resembling veins.",
            "A veined texture is characterized by thin, meandering lines that resemble natural patterns found in leaves or marble.",
            "A veined texture is characterized by the presence of thin, branching lines that resemble the veins in leaves or marble.",
            "A veined texture is visually distinguished by the presence of thin, branching lines resembling veins on the surface.",
            "A veined texture typically exhibits thin, meandering lines or patterns resembling veins found in leaves or marble."
        ],
        "fine_description": [
            "Veined texture displays a network of branching and interconnected lines, resembling the patterns found in leaves or marble.",
            "Veined texture refers to the presence of visible vein-like patterns running through the surface of an object.",
            "A veined texture consists of thin, branching lines that resemble the pattern found in leaves or marble.",
            "A veined texture is characterized by thin, wavy lines that resemble the patterns found in tree leaves.",
            "Veined texture typically exhibits thin, meandering lines resembling the natural patterns found in leaves or marble."
        ],
        "overall_description": [
            "Veined texture is characterized by distinct, branching lines that form a network resembling the patterns found in leaves or marble.",
            "Veined texture is identified by thin, meandering lines resembling natural patterns found in leaves or marble, visible on the surface of an object.",
            "Veined texture is characterized by thin, branching lines resembling the patterns found in leaves or marble.",
            "Veined texture is visually characterized by thin, branching lines resembling veins or wavy lines resembling patterns found in tree leaves.",
            "Veined texture is characterized by thin, meandering lines that resemble the natural patterns found in leaves or marble."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "distinct, branching lines"
                },
                {
                    "A": "lines",
                    "R": "form",
                    "B": "network"
                },
                {
                    "A": "network",
                    "R": "resembles",
                    "B": "patterns"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is identified by",
                    "B": "thin, meandering lines"
                },
                {
                    "A": "lines",
                    "R": "resembling",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "found in",
                    "B": "leaves or marble"
                },
                {
                    "A": "leaves or marble",
                    "R": "visible on",
                    "B": "the surface of"
                },
                {
                    "A": "object",
                    "R": "of",
                    "B": "an"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "lines"
                },
                {
                    "A": "lines",
                    "R": "resembling",
                    "B": "patterns"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "veined lines"
                },
                {
                    "A": "veined lines",
                    "R": "resembling",
                    "B": "veins"
                },
                {
                    "A": "veined lines",
                    "R": "resembling",
                    "B": "wavy lines"
                },
                {
                    "A": "wavy lines",
                    "R": "resembling",
                    "B": "patterns found in tree leaves"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "thin, meandering lines"
                },
                {
                    "A": "lines",
                    "R": "resemble",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "found in",
                    "B": "leaves or marble"
                }
            ]
        ]
    },
    "waffled": {
        "coarse_description": [
            "The unique visual cue of a waffled texture is the presence of evenly spaced square or rectangular indentations.",
            "A waffled texture appears as a pattern with raised square or rectangular shapes, distinguishing it from other textures.",
            "A waffled texture is characterized by a grid-like pattern with raised squares or rectangular shapes.",
            "A waffled texture is visually distinguished by its grid-like pattern of raised and sunken squares.",
            "A waffled texture typically consists of repeated raised and indented patterns, resembling a grid or honeycomb structure."
        ],
        "fine_description": [
            "A waffled texture has raised, repeating square patterns, distinct from grid and crosshatched textures.",
            "A waffled texture has a raised pattern of square or rectangular shapes, resembling a grid, but with depth.",
            "A waffled texture is characterized by a raised pattern of interconnected squares or rectangles.",
            "A waffled texture is distinguished by its evenly spaced, square-shaped depressions, creating a grid-like pattern.",
            "A waffled texture typically has a raised pattern resembling a grid of small squares or rectangles."
        ],
        "overall_description": [
            "A waffled texture is characterized by evenly spaced square or rectangular indentations, creating raised, repeating square patterns that differentiate it from grid and crosshatched textures.",
            "A waffled texture is characterized by a raised grid-like pattern with square or rectangular shapes, creating a distinctive and three-dimensional appearance.",
            "A waffled texture is characterized by a raised grid-like pattern of interconnected squares or rectangular shapes.",
            "A waffled texture is visually characterized by evenly spaced, square-shaped depressions, creating a grid-like pattern of raised and sunken squares.",
            "A waffled texture is characterized by repeated raised and indented patterns resembling a grid or honeycomb structure, often consisting of small squares or rectangles."
        ],
        "structure": [
            [
                {
                    "A": "waffled texture",
                    "R": "characterized by",
                    "B": "evenly spaced square or rectangular indentations"
                },
                {
                    "A": "waffled texture",
                    "R": "creating",
                    "B": "raised, repeating square patterns"
                },
                {
                    "A": "raised, repeating square patterns",
                    "R": "differentiate",
                    "B": "it from grid and crosshatched textures"
                }
            ],
            [
                {
                    "A": "waffled texture",
                    "R": "is characterized by",
                    "B": "raised grid-like pattern"
                },
                {
                    "A": "raised grid-like pattern",
                    "R": "creates",
                    "B": "distinctive and three-dimensional appearance"
                },
                {
                    "A": "raised grid-like pattern",
                    "R": "has",
                    "B": "square or rectangular shapes"
                }
            ],
            [
                {
                    "A": "waffled texture",
                    "R": "characterized by",
                    "B": "raised grid-like pattern"
                },
                {
                    "A": "raised grid-like pattern",
                    "R": "consists of",
                    "B": "interconnected squares or rectangular shapes"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "depressions"
                },
                {
                    "A": "depressions",
                    "R": "create",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "consists of",
                    "B": "squares"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "patterns"
                },
                {
                    "A": "patterns",
                    "R": "resembling",
                    "B": "structure"
                },
                {
                    "A": "structure",
                    "R": "consisting of",
                    "B": "squares or rectangles"
                }
            ]
        ]
    },
    "woven": {
        "coarse_description": [
            "Interlacing of threads is a unique visual cue found in woven textures, creating a distinctive pattern of crossing and overlapping.",
            "A woven texture appears as a pattern of interlaced threads, distinct from other textures due to its organized structure.",
            "A woven texture is characterized by the visible crisscross pattern created by interlacing threads or fibers.",
            "A woven texture is visually distinguished by its interlacing pattern of threads or fibers creating a textured surface.",
            "A woven texture typically has a regular pattern of interlacing fibers, creating a tactile and visually textured surface."
        ],
        "fine_description": [
            "A woven texture is characterized by the crossing of horizontal and vertical threads, creating a crisscross pattern.",
            "A woven texture is created by intertwining individual strands, while an interlaced, braided appearance involves a complex intertwining pattern.",
            "A woven texture is created by interlacing threads over and under each other in a regular pattern.",
            "A woven texture is created by interlacing two or more threads over and under each other in a regular pattern.",
            "A woven texture typically has a tight and structured surface with interlaced threads creating a uniform pattern."
        ],
        "overall_description": [
            "Woven textures are characterized by the interlacing of horizontal and vertical threads, creating a unique crisscross pattern of crossing and overlapping.",
            "Woven texture is characterized by an organized and interlaced pattern of threads, resulting in a distinct appearance and sometimes a complex braided structure.",
            "Woven texture is characterized by a visible crisscross pattern created through the interlacing of threads or fibers in a regular manner.",
            "Woven is a texture characterized by an interlacing pattern of threads or fibers, creating a visually distinct and textured surface, achieved by weaving two or more threads in a regular manner.",
            "Woven is a texture characterized by a regular and structured pattern of interlaced fibers or threads, resulting in a tactile and visually textured surface."
        ],
        "structure": [
            [
                {
                    "A": "textures",
                    "R": "characterized by",
                    "B": "interlacing of threads"
                },
                {
                    "A": "threads",
                    "R": "creating",
                    "B": "crisscross pattern"
                },
                {
                    "A": "pattern",
                    "R": "of",
                    "B": "crossing and overlapping"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "pattern of threads"
                },
                {
                    "A": "pattern of threads",
                    "R": "results in",
                    "B": "distinct appearance"
                },
                {
                    "A": "pattern of threads",
                    "R": "results in",
                    "B": "complex braided structure"
                }
            ],
            [
                {
                    "A": "Woven texture",
                    "R": "is characterized by",
                    "B": "visible crisscross pattern"
                },
                {
                    "A": "visible crisscross pattern",
                    "R": "created through",
                    "B": "interlacing of threads or fibers"
                },
                {
                    "A": "interlacing of threads or fibers",
                    "R": "in a regular manner",
                    "B": "Woven texture"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "interlacing pattern of threads or fibers"
                },
                {
                    "A": "interlacing pattern of threads or fibers",
                    "R": "creating",
                    "B": "visually distinct and textured surface"
                },
                {
                    "A": "visually distinct and textured surface",
                    "R": "achieved by",
                    "B": "weaving two or more threads in a regular manner"
                }
            ],
            [
                {
                    "A": "Woven",
                    "R": "characterized by",
                    "B": "texture"
                },
                {
                    "A": "texture",
                    "R": "resulting in",
                    "B": "surface"
                },
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "structured",
                    "B": "fibers"
                },
                {
                    "A": "pattern",
                    "R": "interlaced with",
                    "B": "fibers"
                },
                {
                    "A": "fibers",
                    "R": "interlaced with",
                    "B": "threads"
                },
                {
                    "A": "threads",
                    "R": "interlaced with",
                    "B": "fibers"
                }
            ]
        ]
    },
    "wrinkled": {
        "coarse_description": [
            "The unique visual cue of a wrinkled texture is the presence of irregular and folded creases on the surface.",
            "A wrinkled texture appears folded or creased, while other textures may have smooth, rough, or patterned surfaces.",
            "A wrinkled texture is characterized by the presence of numerous folds and creases on its surface.",
            "A wrinkled texture is visually distinguished by its irregular, folded, and creased appearance on the surface.",
            "A wrinkled texture typically has uneven and creased surfaces, often appearing as folds or crinkles."
        ],
        "fine_description": [
            "A wrinkled texture appears as multiple small folds or creases on the surface, distinguishing it from other textures.",
            "A wrinkled texture refers to a surface that has numerous fine lines or creases.",
            "A wrinkled texture appears as multiple fine, closely spaced lines or folds on a surface.",
            "A wrinkled texture appears as a series of creases or folds on a surface.",
            "A wrinkled texture typically has fine, irregular creases and folds on its surface."
        ],
        "overall_description": [
            "Wrinkled texture is characterized by irregular and folded creases, appearing as multiple small folds or creases on the surface, setting it apart from other textures.",
            "A wrinkled texture is characterized by folded or creased appearance, with numerous fine lines or creases, distinguishing it from smooth, rough, or patterned surfaces.",
            "Wrinkled texture is defined by the presence of numerous closely spaced lines or folds, creating a surface with multiple folds and creases.",
            "Wrinkled is a texture characterized by irregular, folded, and creased appearance, often seen as a series of creases or folds on a surface.",
            "A wrinkled texture is characterized by uneven, creased surfaces with fine, irregular creases and folds, often appearing as folds or crinkles."
        ],
        "structure": [
            [
                {
                    "A": "Wrinkled texture",
                    "R": "is characterized by",
                    "B": "irregular and folded creases"
                },
                {
                    "A": "Wrinkled texture",
                    "R": "appearing as",
                    "B": "multiple small folds or creases"
                },
                {
                    "A": "Wrinkled texture",
                    "R": "setting it apart from",
                    "B": "other textures"
                }
            ],
            [
                {
                    "A": "wrinkled texture",
                    "R": "is characterized by",
                    "B": "folded or creased appearance"
                },
                {
                    "A": "wrinkled texture",
                    "R": "is characterized by",
                    "B": "numerous fine lines or creases"
                },
                {
                    "A": "wrinkled texture",
                    "R": "distinguishes from",
                    "B": "smooth, rough, or patterned surfaces"
                }
            ],
            [
                {
                    "A": "Wrinkled texture",
                    "R": "is defined by",
                    "B": "presence of numerous closely spaced lines or folds"
                },
                {
                    "A": "presence of numerous closely spaced lines or folds",
                    "R": "creates",
                    "B": "surface with multiple folds and creases"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "irregular, folded, and creased appearance"
                },
                {
                    "A": "appearance",
                    "R": "seen as",
                    "B": "a series of creases or folds on a surface"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "characterized by",
                    "B": "uneven, creased surfaces with fine, irregular creases and folds"
                },
                {
                    "A": "creases and folds",
                    "R": "appear as",
                    "B": "folds or crinkles"
                }
            ]
        ]
    },
    "zigzagged": {
        "coarse_description": [
            "Zigzagged texture is characterized by a pattern of sharp, alternating diagonal lines that create an angular and jagged appearance.",
            "A zigzagged texture appears as a series of sharp, diagonal lines, distinguishing it from other textures with varying patterns.",
            "A zigzagged texture is characterized by a series of sharp, angular lines that alternate in direction.",
            "A zigzagged texture is visually distinguished by its repeated diagonal pattern, resembling a series of connected sharp angles.",
            "A zigzagged texture typically consists of sharp, jagged lines that alternate in direction, creating a dynamic and angular surface."
        ],
        "fine_description": [
            "Zigzagged texture consists of repeated diagonal lines that alternate in direction, creating a distinctive crisscross pattern.",
            "A zigzagged texture consists of sharp, angular lines that alternate in direction, creating a dynamic and jagged pattern.",
            "A zigzagged texture is characterized by a series of sharp, angular, and alternating diagonal lines.",
            "A zigzagged texture appears as a series of sharp, diagonal angles in a repetitive pattern.",
            "A zigzagged texture typically consists of repeated angular patterns that create a dynamic and energetic surface."
        ],
        "overall_description": [
            "Zigzagged texture features sharp, alternating diagonal lines that create an angular, jagged appearance in a distinctive crisscross pattern.",
            "A zigzagged texture is characterized by sharp, angular lines that form a dynamic and jagged pattern, distinguishing it from other textures with varying patterns.",
            "A zigzagged texture is defined by a series of sharp, angular lines that alternate diagonally in direction, creating a distinctive pattern.",
            "A zigzagged texture is characterized by its repeated diagonal pattern, featuring connected sharp angles that create a visually distinctive and repetitive appearance.",
            "A zigzagged texture is characterized by sharp, jagged lines that alternate in direction, creating repeated angular patterns, resulting in a dynamic and energetic surface."
        ],
        "structure": [
            [
                {
                    "A": "texture",
                    "R": "features",
                    "B": "lines"
                },
                {
                    "A": "lines",
                    "R": "create",
                    "B": "appearance"
                },
                {
                    "A": "appearance",
                    "R": "in",
                    "B": "pattern"
                },
                {
                    "A": "pattern",
                    "R": "in",
                    "B": "crisscross"
                }
            ],
            [
                {
                    "A": "zigzagged texture",
                    "R": "is characterized by",
                    "B": "sharp, angular lines"
                },
                {
                    "A": "sharp, angular lines",
                    "R": "form",
                    "B": "dynamic and jagged pattern"
                },
                {
                    "A": "dynamic and jagged pattern",
                    "R": "distinguishing",
                    "B": "it from other textures with varying patterns"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "defined by",
                    "B": "series of lines"
                },
                {
                    "A": "lines",
                    "R": "alternate",
                    "B": "diagonally in direction"
                },
                {
                    "A": "lines",
                    "R": "create",
                    "B": "pattern"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "zigzagged texture"
                },
                {
                    "A": "pattern",
                    "R": "featuring",
                    "B": "diagonal pattern"
                },
                {
                    "A": "angles",
                    "R": "create",
                    "B": "sharp angles"
                },
                {
                    "A": "appearance",
                    "R": "create",
                    "B": "visually distinctive and repetitive appearance"
                }
            ],
            [
                {
                    "A": "texture",
                    "R": "is characterized by",
                    "B": "zigzagged"
                },
                {
                    "A": "lines",
                    "R": "alternate in",
                    "B": "direction"
                },
                {
                    "A": "lines",
                    "R": "create",
                    "B": "angular patterns"
                },
                {
                    "A": "patterns",
                    "R": "result in",
                    "B": "dynamic and energetic surface"
                }
            ]
        ]
    }
}