{
    "Annual Crop Land": {
        "coarse_description": [
            "Annual Crop Land is characterized by rectangular or square shapes with uniform colors and patterns, indicating crop rows and fields.",
            "Annual Crop Land appears as a grid of uniform, vibrant green or golden rectangles, often with straight edges and distinct boundaries.",
            "Annual Crop Land appears as a patchwork of uniform, rectangular fields with varying shades of green and brown.",
            "Annual crop land appears as uniform, geometric patterns of green or yellow fields, often with straight borders and roads.",
            "Annual Crop Land typically exhibits a mosaic of green, uniform, and rectangular fields with subtle ridges and furrows."
        ],
        "fine_description": [
            "Annual Crop Land features prominently cultivated rows of uniform, dense, and regularly spaced plantings of annual crops.",
            "Annual Crop Land typically features a uniform, cultivated landscape with rows of tall, dense, and often green vegetation.",
            "Annual Crop Land features uniform, dense, and regularly maintained rows of cultivated plants with distinct growth stages.",
            "Annual Crop Land is characterized by rows of uniform, lush, and vibrant green plants with varying heights and textures.",
            "Annual Crop Land typically features smooth, uniform, and often bare soil surfaces with occasional rows of plants."
        ],
        "overall_description": [
            "Annual Crop Land is characterized by rectangular or square shapes with uniform colors and patterns, featuring densely planted, regularly spaced rows of annual crops.",
            "Annual Crop Land appears as a uniform, cultivated landscape with rows of tall, dense, and often green vegetation, featuring rectangular plots with straight edges and distinct boundaries.",
            "Annual Crop Land is a patchwork of uniform, rectangular fields featuring dense, regularly maintained rows of cultivated plants with varying shades of green and brown, showcasing distinct growth stages.",
            "Annual Crop Land is characterized by uniform, geometric patterns of lush, green or yellow fields with straight borders, roads, and rows of varying height and texture plants.",
            "Annual Crop Land typically features uniform, rectangular fields with subtle ridges and furrows, or smooth, bare soil surfaces with occasional rows of plants, often exhibiting a mix of green and bare areas."
        ],
        "structure": [
            [
                {
                    "A": "Annual Crop Land",
                    "R": "is characterized by",
                    "B": "rectangular or square shapes with uniform colors and patterns"
                },
                {
                    "A": "Annual Crop Land",
                    "R": "features",
                    "B": "densely planted, regularly spaced rows of annual crops"
                }
            ],
            [
                {
                    "A": "Annual Crop Land",
                    "R": "appears",
                    "B": "uniform, cultivated landscape"
                },
                {
                    "A": "Annual Crop Land",
                    "R": "has",
                    "B": "rows of tall, dense, and often green vegetation"
                },
                {
                    "A": "Annual Crop Land",
                    "R": "features",
                    "B": "rectangular plots with straight edges and distinct boundaries"
                }
            ],
            [
                {
                    "A": "Annual Crop Land",
                    "R": "is",
                    "B": "a patchwork"
                },
                {
                    "A": "a patchwork",
                    "R": "of",
                    "B": "uniform, rectangular fields"
                },
                {
                    "A": "uniform, rectangular fields",
                    "R": "featuring",
                    "B": "dense, regularly maintained rows of cultivated plants"
                },
                {
                    "A": "dense, regularly maintained rows of cultivated plants",
                    "R": "with",
                    "B": "varying shades of green and brown"
                },
                {
                    "A": "varying shades of green and brown",
                    "R": "showcasing",
                    "B": "distinct growth stages"
                }
            ],
            [
                {
                    "A": "Annual Crop Land",
                    "R": "is characterized by",
                    "B": "uniform, geometric patterns"
                },
                {
                    "A": "uniform, geometric patterns",
                    "R": "of",
                    "B": "lush, green or yellow fields"
                },
                {
                    "A": "lush, green or yellow fields",
                    "R": "with",
                    "B": "straight borders, roads, and rows"
                },
                {
                    "A": "straight borders, roads, and rows",
                    "R": "of",
                    "B": "varying height and texture plants"
                }
            ],
            [
                {
                    "A": "Annual Crop Land",
                    "R": "typically features",
                    "B": "uniform, rectangular fields with subtle ridges and furrows"
                },
                {
                    "A": "Annual Crop Land",
                    "R": "typically features",
                    "B": "smooth, bare soil surfaces with occasional rows of plants"
                },
                {
                    "A": "Annual Crop Land",
                    "R": "often exhibits",
                    "B": "a mix of green and bare areas"
                }
            ]
        ]
    },
    "Forest": {
        "coarse_description": [
            "A unique visual cue of forest in a centered satellite photo is the dense, uniform canopy cover with varying shades of green.",
            "Forest areas appear as dense, green patches with defined boundaries, contrasting with other land types like grasslands or deserts.",
            "Forest areas in a centered satellite photo appear as dense, green, and irregularly shaped patches with varying tree densities.",
            "Forest is distinguished by dense, uniform greenery with varying shades, contrasting with surrounding features like water or urban areas.",
            "Forest areas typically exhibit a mix of green, brown, and tan hues with varying shades of texture, from smooth to rugged."
        ],
        "fine_description": [
            "Tall, dense tree canopy with a continuous layer of foliage, often with a closed or open understory.",
            "A forest typically features a dense canopy of towering trees with sprawling canopies and complex networks of branches.",
            "Forest is characterized by tall, dense, and layered tree canopies with a complex network of branches and foliage.",
            "Forest is characterized by a dense canopy of trees with a continuous layer of foliage and a well-defined understory.",
            "Forest typically features dense, rugged, and uneven tree bark, with rough, gnarled, and twisted trunks and branches."
        ],
        "overall_description": [
            "A forest is characterized by a dense, uniform canopy cover with varying shades of green, featuring tall, dense trees with a continuous layer of foliage and a possible open or closed understory.",
            "A forest is a dense, green area with defined boundaries, characterized by a towering canopy of trees with sprawling canopies and complex branch networks.",
            "Forest is a dense, green, and irregularly shaped area with tall, layered tree canopies, complex branching, and varying tree densities, characterized by a lush and intricate foliage.",
            "Forest is a dense and uniform ecosystem characterized by a continuous canopy of trees with varying shades of greenery, contrasting with surrounding features, and a well-defined understory.",
            "A forest is characterized by a mix of green, brown, and tan hues, with dense, rugged, and uneven tree bark, rough, gnarled, and twisted trunks and branches."
        ],
        "structure": [
            [
                {
                    "A": "forest",
                    "R": "is",
                    "B": "characterized"
                },
                {
                    "A": "characterized",
                    "R": "by",
                    "B": "a dense, uniform canopy cover"
                },
                {
                    "A": "a dense, uniform canopy cover",
                    "R": "with",
                    "B": "varying shades of green"
                },
                {
                    "A": "varying shades of green",
                    "R": "featuring",
                    "B": "tall, dense trees"
                },
                {
                    "A": "tall, dense trees",
                    "R": "with",
                    "B": "a continuous layer of foliage"
                },
                {
                    "A": "a continuous layer of foliage",
                    "R": "and",
                    "B": "a possible open or closed understory"
                }
            ],
            [
                {
                    "A": "forest",
                    "R": "is",
                    "B": "a dense, green area with defined boundaries"
                },
                {
                    "A": "a dense, green area with defined boundaries",
                    "R": "characterized by",
                    "B": "a towering canopy of trees with sprawling canopies and complex branch networks"
                },
                {
                    "A": "a towering canopy of trees with sprawling canopies and complex branch networks",
                    "R": "has",
                    "B": "towering canopy of trees with sprawling canopies and complex branch networks"
                }
            ],
            [
                {
                    "A": "Forest",
                    "R": "is",
                    "B": "a dense, green, and irregularly shaped area"
                },
                {
                    "A": "Forest",
                    "R": "has",
                    "B": "tall, layered tree canopies"
                },
                {
                    "A": "Forest",
                    "R": "has",
                    "B": "complex branching"
                },
                {
                    "A": "Forest",
                    "R": "has",
                    "B": "varying tree densities"
                },
                {
                    "A": "Forest",
                    "R": "is characterized by",
                    "B": "a lush and intricate foliage"
                }
            ],
            [
                {
                    "A": "satellite",
                    "R": "photo",
                    "B": "annual crop land"
                },
                {
                    "A": "annual crop land",
                    "R": "appears",
                    "B": "mosaic"
                },
                {
                    "A": "forest",
                    "R": "is",
                    "B": "dense and uniform ecosystem"
                },
                {
                    "A": "dense and uniform ecosystem",
                    "R": "characterized by",
                    "B": "continuous canopy of trees"
                },
                {
                    "A": "continuous canopy of trees",
                    "R": "with",
                    "B": "varying shades of greenery"
                },
                {
                    "A": "forest",
                    "R": "contrasting with",
                    "B": "surrounding features"
                },
                {
                    "A": "forest",
                    "R": "has",
                    "B": "well-defined understory"
                }
            ],
            [
                {
                    "A": "forest",
                    "R": "is",
                    "B": "characterized"
                },
                {
                    "A": "forest",
                    "R": "has",
                    "B": "mix"
                },
                {
                    "A": "mix",
                    "R": "of",
                    "B": "green"
                },
                {
                    "A": "mix",
                    "R": "of",
                    "B": "brown"
                },
                {
                    "A": "mix",
                    "R": "of",
                    "B": "tan"
                },
                {
                    "A": "forest",
                    "R": "has",
                    "B": "dense"
                },
                {
                    "A": "forest",
                    "R": "has",
                    "B": "rugged"
                },
                {
                    "A": "forest",
                    "R": "has",
                    "B": "uneven"
                },
                {
                    "A": "tree bark",
                    "R": "is",
                    "B": "dense"
                },
                {
                    "A": "tree bark",
                    "R": "is",
                    "B": "rugged"
                },
                {
                    "A": "tree bark",
                    "R": "is",
                    "B": "uneven"
                },
                {
                    "A": "trunks",
                    "R": "are",
                    "B": "rough"
                },
                {
                    "A": "trunks",
                    "R": "are",
                    "B": "gnarled"
                },
                {
                    "A": "trunks",
                    "R": "are",
                    "B": "twisted"
                },
                {
                    "A": "branches",
                    "R": "are",
                    "B": "rough"
                },
                {
                    "A": "branches",
                    "R": "are",
                    "B": "gnarled"
                },
                {
                    "A": "branches",
                    "R": "are",
                    "B": "twisted"
                }
            ]
        ]
    },
    "Herbaceous Vegetation Land": {
        "coarse_description": [
            "A distinctive pattern of green patches with irregular shapes and varying sizes is characteristic of Herbaceous Vegetation Land.",
            "Herbaceous Vegetation Land appears as a vibrant, green, and varied mosaic of grasses, wildflowers, and other non-woody plants.",
            "Herbaceous Vegetation Land appears as a mosaic of green patches with varying shapes, sizes, and densities amidst other land types.",
            "Herbaceous Vegetation Land appears as a mosaic of green patches with varying shades and textures, often with winding paths or roads.",
            "Herbaceous Vegetation Land typically features a mix of smooth, soft, and sometimes rough textures, with varying shades of green and brown hues."
        ],
        "fine_description": [
            "Herbaceous Vegetation Land features a dense understory of perennial grasses and wildflowers, often with a mix of shrubs and trees.",
            "Herbaceous Vegetation Land typically features a diverse array of non-woody plants, such as grasses, wildflowers, and shrubs, in a dynamic, changing landscape.",
            "Herbaceous Vegetation Land is characterized by a diverse mix of perennial and annual grasses, wildflowers, and shrubs with varying heights and textures.",
            "Herbaceous Vegetation Land is characterized by a lush, diverse, and dynamic mix of grasses, wildflowers, and shrubs.",
            "Herbaceous Vegetation Land typically features a dense, lush carpet of varied textures, including soft grasses, leafy stems, and delicate flower petals."
        ],
        "overall_description": [
            "Herbaceous Vegetation Land features a mosaic of irregularly shaped green patches, comprising a dense understory of perennial grasses, wildflowers, and a mix of shrubs and trees.",
            "Herbaceous Vegetation Land is a dynamic, vibrant landscape characterized by a diverse array of non-woody plants, including grasses, wildflowers, and shrubs, in a constantly changing mosaic of green hues.",
            "Herbaceous Vegetation Land is a diverse mosaic of green patches featuring a mix of perennial and annual grasses, wildflowers, and shrubs with varying heights, textures, and densities amidst other land types.",
            "Herbaceous Vegetation Land is a lush, dynamic mosaic of diverse green patches, featuring winding paths, varying shades, and textures, with a mix of grasses, wildflowers, and shrubs.",
            "Herbaceous Vegetation Land typically features a dense, lush carpet of varied textures, including soft grasses, leafy stems, and delicate flower petals, with a mix of smooth, soft, and sometimes rough textures in shades of green and brown."
        ],
        "structure": [
            [
                {
                    "A": "Herbaceous Vegetation Land",
                    "R": "features",
                    "B": "mosaic"
                },
                {
                    "A": "mosaic",
                    "R": "comprising",
                    "B": "a dense understory"
                },
                {
                    "A": "a dense understory",
                    "R": "of",
                    "B": "perennial grasses"
                },
                {
                    "A": "perennial grasses",
                    "R": "and",
                    "B": "wildflowers"
                },
                {
                    "A": "perennial grasses",
                    "R": "and",
                    "B": "a mix of shrubs and trees"
                },
                {
                    "A": "a mix of shrubs and trees",
                    "R": "and",
                    "B": "wildflowers"
                }
            ],
            [
                {
                    "A": "Herbaceous Vegetation Land",
                    "R": "is",
                    "B": "a dynamic, vibrant landscape"
                },
                {
                    "A": "dynamic, vibrant landscape",
                    "R": "characterized by",
                    "B": "a diverse array of non-woody plants"
                },
                {
                    "A": "a diverse array of non-woody plants",
                    "R": "including",
                    "B": "grasses, wildflowers, and shrubs"
                },
                {
                    "A": "grasses, wildflowers, and shrubs",
                    "R": "in",
                    "B": "a constantly changing mosaic of green hues"
                },
                {
                    "A": "a constantly changing mosaic of green hues",
                    "R": "of",
                    "B": "Herbaceous Vegetation Land"
                }
            ],
            [
                {
                    "A": "Herbaceous Vegetation Land",
                    "R": "is",
                    "B": "a diverse mosaic"
                },
                {
                    "A": "a diverse mosaic",
                    "R": "of",
                    "B": "green patches"
                },
                {
                    "A": "green patches",
                    "R": "featuring",
                    "B": "a mix"
                },
                {
                    "A": "a mix",
                    "R": "of",
                    "B": "perennial and annual grasses"
                },
                {
                    "A": "perennial and annual grasses",
                    "R": "and",
                    "B": "wildflowers"
                },
                {
                    "A": "perennial and annual grasses",
                    "R": "and",
                    "B": "shrubs"
                },
                {
                    "A": "shrubs",
                    "R": "with",
                    "B": "varying heights"
                },
                {
                    "A": "shrubs",
                    "R": "with",
                    "B": "textures"
                },
                {
                    "A": "shrubs",
                    "R": "with",
                    "B": "densities"
                },
                {
                    "A": "shrubs",
                    "R": "amidst",
                    "B": "other land types"
                }
            ],
            [
                {
                    "A": "Herbaceous Vegetation Land",
                    "R": "is",
                    "B": "a lush, dynamic mosaic"
                },
                {
                    "A": "a lush, dynamic mosaic",
                    "R": "of",
                    "B": "diverse green patches"
                },
                {
                    "A": "diverse green patches",
                    "R": "featuring",
                    "B": "winding paths, varying shades, and textures"
                },
                {
                    "A": "diverse green patches",
                    "R": "with",
                    "B": "a mix of grasses, wildflowers, and shrubs"
                },
                {
                    "A": "a mix of grasses, wildflowers, and shrubs",
                    "R": "of",
                    "B": "diverse green patches"
                }
            ],
            [
                {
                    "A": "Herbaceous Vegetation Land",
                    "R": "features",
                    "B": "dense, lush carpet"
                },
                {
                    "A": "dense, lush carpet",
                    "R": "of",
                    "B": "varied textures"
                },
                {
                    "A": "varied textures",
                    "R": "including",
                    "B": "soft grasses"
                },
                {
                    "A": "varied textures",
                    "R": "including",
                    "B": "leafy stems"
                },
                {
                    "A": "varied textures",
                    "R": "including",
                    "B": "delicate flower petals"
                },
                {
                    "A": "dense, lush carpet",
                    "R": "with",
                    "B": "mix of smooth, soft, and sometimes rough textures"
                },
                {
                    "A": "mix of smooth, soft, and sometimes rough textures",
                    "R": "in",
                    "B": "shades of green and brown"
                }
            ]
        ]
    },
    "Highway or Road": {
        "coarse_description": [
            "A highway or road is characterized by a linear, man-made feature with a distinctive, uniform width and alignment.",
            "Highways or roads appear as linear, man-made features with distinct edges, often with visible lanes, markings, and surrounding infrastructure.",
            "Highways or roads appear as long, thin, linear features with defined edges, often with visible lanes and markings.",
            "Highways or roads appear as straight or curved linear features with defined edges, often with a darker or lighter tone than surrounding terrain.",
            "Highways or roads typically exhibit a smooth, straight, and uniform gray or asphalt-colored surface with occasional markings and lines."
        ],
        "fine_description": [
            "A Highway or Road features a continuous, winding, or straight path of asphalt or concrete with marked lanes.",
            "Highways or roads are long, linear paths with a smooth surface, marked by lines, signs, and often flanked by guardrails.",
            "A highway or road is characterized by a long, flat, and narrow surface with marked lanes and a defined median.",
            "A highway or road is a long, linear infrastructure with a defined path, often marked by lines and bounded by curbs or medians.",
            "Highways typically feature a smooth, asphalt or concrete surface with subtle ridges and grooves for traction."
        ],
        "overall_description": [
            "A highway or road is a man-made, linear feature with a uniform width and alignment, featuring a continuous path of asphalt or concrete with marked lanes.",
            "Highways or roads are long, linear paths with smooth surfaces, marked by lines, signs, and distinct edges, often featuring visible lanes, markings, and surrounding infrastructure, including guardrails.",
            "A highway or road is a long, flat, and narrow surface with defined edges, marked lanes, and a median, appearing as a linear feature with visible boundaries.",
            "Highways or roads are long, linear infrastructure features with defined paths, marked by lines, and bounded by curbs or medians, appearing as straight or curved features with distinct edges and varying tones.",
            "Highways or roads typically have a smooth, uniform gray or asphalt-colored surface with occasional markings and lines, featuring subtle ridges and grooves for traction."
        ],
        "structure": [
            [
                {
                    "A": "highway or road",
                    "R": "is",
                    "B": "man-made"
                },
                {
                    "A": "highway or road",
                    "R": "has",
                    "B": "uniform width"
                },
                {
                    "A": "highway or road",
                    "R": "has",
                    "B": "alignment"
                },
                {
                    "A": "highway or road",
                    "R": "features",
                    "B": "continuous path"
                },
                {
                    "A": "highway or road",
                    "R": "features",
                    "B": "asphalt or concrete"
                },
                {
                    "A": "highway or road",
                    "R": "features",
                    "B": "marked lanes"
                }
            ],
            [
                {
                    "A": "Highways or roads",
                    "R": "are",
                    "B": "long, linear paths"
                },
                {
                    "A": "Highways or roads",
                    "R": "have",
                    "B": "smooth surfaces"
                },
                {
                    "A": "Highways or roads",
                    "R": "are",
                    "B": "marked by lines, signs, and distinct edges"
                },
                {
                    "A": "Highways or roads",
                    "R": "often feature",
                    "B": "visible lanes, markings, and surrounding infrastructure"
                },
                {
                    "A": "Highways or roads",
                    "R": "include",
                    "B": "guardrails"
                }
            ],
            [
                {
                    "A": "highway or road",
                    "R": "is",
                    "B": "a long, flat, and narrow surface"
                },
                {
                    "A": "highway or road",
                    "R": "has",
                    "B": "defined edges"
                },
                {
                    "A": "highway or road",
                    "R": "has",
                    "B": "marked lanes"
                },
                {
                    "A": "highway or road",
                    "R": "has",
                    "B": "a median"
                },
                {
                    "A": "highway or road",
                    "R": "appears as",
                    "B": "a linear feature with visible boundaries"
                }
            ],
            [
                {
                    "A": "Highways or roads",
                    "R": "are",
                    "B": "long, linear infrastructure features"
                },
                {
                    "A": "Highways or roads",
                    "R": "have",
                    "B": "defined paths"
                },
                {
                    "A": "Highways or roads",
                    "R": "are",
                    "B": "marked by lines"
                },
                {
                    "A": "Highways or roads",
                    "R": "are",
                    "B": "bounded by curbs or medians"
                },
                {
                    "A": "Highways or roads",
                    "R": "appear",
                    "B": "as straight or curved features"
                },
                {
                    "A": "Highways or roads",
                    "R": "have",
                    "B": "distinct edges"
                },
                {
                    "A": "Highways or roads",
                    "R": "have",
                    "B": "varying tones"
                }
            ],
            [
                {
                    "A": "highways",
                    "R": "have",
                    "B": "smooth, uniform gray or asphalt-colored surface"
                },
                {
                    "A": "highways",
                    "R": "typically",
                    "B": "roads"
                },
                {
                    "A": "roads",
                    "R": "have",
                    "B": "smooth, uniform gray or asphalt-colored surface"
                },
                {
                    "A": "roads",
                    "R": "typically",
                    "B": "highways"
                },
                {
                    "A": "smooth, uniform gray or asphalt-colored surface",
                    "R": "feature",
                    "B": "occasional markings and lines"
                },
                {
                    "A": "smooth, uniform gray or asphalt-colored surface",
                    "R": "have",
                    "B": "subtle ridges and grooves for traction"
                }
            ]
        ]
    },
    "Industrial Buildings": {
        "coarse_description": [
            "Industrial buildings are often characterized by a grid-like pattern of rectangular structures with straight lines and right angles.",
            "Industrial buildings appear as clusters of rectangular structures with varying sizes, often surrounded by parking lots and storage areas.",
            "Industrial buildings appear as rectangular or linear structures with flat roofs, often with metal or concrete exteriors and minimal landscaping.",
            "Industrial buildings appear as clusters of rectangular structures with straight lines, sharp angles, and occasional smoke or pollution plumes.",
            "Industrial buildings typically exhibit rough, weathered, and rusted metal surfaces, with occasional concrete, brick, or asphalt textures."
        ],
        "fine_description": [
            "Industrial Buildings are typically marked by large, rectangular structures with corrugated metal or concrete exteriors and multiple loading docks.",
            "Industrial Buildings typically feature large, rectangular structures with metal or concrete exteriors, often with loading docks, vents, and functional architecture.",
            "Industrial Buildings are typically characterized by functional, utilitarian designs with exposed structural elements, such as steel beams and concrete blocks.",
            "Industrial Buildings are typically characterized by large, rectangular structures with corrugated metal or concrete facades and functional, utilitarian designs.",
            "Industrial Buildings typically feature rough, weathered concrete, corrugated metal, and exposed brick, with prominent rivets and rusty accents."
        ],
        "overall_description": [
            "Industrial buildings typically feature large, rectangular structures with straight lines, right angles, and exteriors made of corrugated metal or concrete, often with multiple loading docks.",
            "Industrial buildings are clusters of rectangular structures with varying sizes, featuring metal or concrete exteriors, loading docks, vents, and functional architecture, often surrounded by parking lots and storage areas.",
            "Industrial buildings are rectangular or linear structures with flat roofs, metal or concrete exteriors, and minimal landscaping, featuring functional designs with exposed structural elements like steel beams and concrete blocks.",
            "Industrial buildings are typically large, rectangular structures with straight lines, sharp angles, and corrugated metal or concrete facades, often with functional and utilitarian designs.",
            "Industrial buildings typically exhibit rough, weathered surfaces with a mix of metal, concrete, brick, and asphalt textures, often featuring corrugated metal, exposed brick, rivets, and rusty accents."
        ],
        "structure": [
            [
                {
                    "A": "Industrial buildings",
                    "R": "typically feature",
                    "B": "large, rectangular structures"
                },
                {
                    "A": "large, rectangular structures",
                    "R": "have",
                    "B": "straight lines"
                },
                {
                    "A": "large, rectangular structures",
                    "R": "have",
                    "B": "right angles"
                },
                {
                    "A": "large, rectangular structures",
                    "R": "have",
                    "B": "exteriors made of corrugated metal or concrete"
                },
                {
                    "A": "large, rectangular structures",
                    "R": "often have",
                    "B": "multiple loading docks"
                }
            ],
            [
                {
                    "A": "Industrial buildings",
                    "R": "are",
                    "B": "clusters"
                },
                {
                    "A": "clusters",
                    "R": "of",
                    "B": "rectangular structures"
                },
                {
                    "A": "rectangular structures",
                    "R": "with",
                    "B": "varying sizes"
                },
                {
                    "A": "rectangular structures",
                    "R": "featuring",
                    "B": "metal or concrete exteriors"
                },
                {
                    "A": "rectangular structures",
                    "R": "featuring",
                    "B": "loading docks"
                },
                {
                    "A": "rectangular structures",
                    "R": "featuring",
                    "B": "vents"
                },
                {
                    "A": "rectangular structures",
                    "R": "featuring",
                    "B": "functional architecture"
                },
                {
                    "A": "Industrial buildings",
                    "R": "often",
                    "B": "surrounded by"
                },
                {
                    "A": "Industrial buildings",
                    "R": "often",
                    "B": "parking lots and storage areas"
                }
            ],
            [
                {
                    "A": "Industrial buildings",
                    "R": "are",
                    "B": "rectangular or linear structures"
                },
                {
                    "A": "rectangular or linear structures",
                    "R": "with",
                    "B": "flat roofs"
                },
                {
                    "A": "flat roofs",
                    "R": "with",
                    "B": "metal or concrete exteriors"
                },
                {
                    "A": "metal or concrete exteriors",
                    "R": "and",
                    "B": "minimal landscaping"
                },
                {
                    "A": "minimal landscaping",
                    "R": "and",
                    "B": "functional designs"
                },
                {
                    "A": "functional designs",
                    "R": "with",
                    "B": "exposed structural elements"
                },
                {
                    "A": "exposed structural elements",
                    "R": "like",
                    "B": "steel beams"
                },
                {
                    "A": "steel beams",
                    "R": "and",
                    "B": "concrete blocks"
                }
            ],
            [
                {
                    "A": "Industrial buildings",
                    "R": "are",
                    "B": "typically large"
                },
                {
                    "A": "Industrial buildings",
                    "R": "are",
                    "B": "rectangular structures"
                },
                {
                    "A": "Industrial buildings",
                    "R": "have",
                    "B": "straight lines"
                },
                {
                    "A": "Industrial buildings",
                    "R": "have",
                    "B": "sharp angles"
                },
                {
                    "A": "Industrial buildings",
                    "R": "have",
                    "B": "corrugated metal or concrete facades"
                },
                {
                    "A": "Industrial buildings",
                    "R": "often have",
                    "B": "functional and utilitarian designs"
                }
            ],
            [
                {
                    "A": "Industrial buildings",
                    "R": "exhibit",
                    "B": "rough surfaces"
                },
                {
                    "A": "Industrial buildings",
                    "R": "have",
                    "B": "weathered surfaces"
                },
                {
                    "A": "Industrial buildings",
                    "R": "feature",
                    "B": "mix of metal, concrete, brick, and asphalt textures"
                },
                {
                    "A": "Industrial buildings",
                    "R": "have",
                    "B": "corrugated metal"
                },
                {
                    "A": "Industrial buildings",
                    "R": "have",
                    "B": "exposed brick"
                },
                {
                    "A": "Industrial buildings",
                    "R": "have",
                    "B": "rivets"
                },
                {
                    "A": "Industrial buildings",
                    "R": "have",
                    "B": "rusty accents"
                }
            ]
        ]
    },
    "Pasture Land": {
        "coarse_description": [
            "Pasture Land is distinguished by its uniform green color and scattered, irregularly-shaped patches of darker green trees.",
            "Pasture Land appears as a patchwork of green, with varying shades of grass and occasional clusters of trees or farm buildings.",
            "Pasture Land appears as a lush, green area with scattered trees and occasional farm structures, often surrounded by fences.",
            "Pasture Land appears as a patchwork of green, irregularly shaped areas with scattered trees and gentle undulations.",
            "Pasture Land typically exhibits a uniform, lush, and slightly wavy green texture with scattered darker spots."
        ],
        "fine_description": [
            "Pasture Land features scattered, unevenly distributed grasses and wildflowers, with occasional shrubs and small trees.",
            "Pasture Land typically features lush, green grasses and wildflowers, often with scattered trees and minimal to no crop rows.",
            "Pasture Land features a lush, green landscape with scattered grasses, wildflowers, and occasional shrubs, often with visible grazing paths.",
            "Pasture Land is characterized by lush, green grasses and wildflowers, often with scattered trees and minimal infrastructure.",
            "Pasture Land typically features a lush, uneven, and slightly rough surface with scattered tufts of grass and occasional wildflowers."
        ],
        "overall_description": [
            "Pasture Land is characterized by its uniform green color, with scattered, irregularly-shaped patches of darker green trees, and features unevenly distributed grasses, wildflowers, shrubs, and small trees.",
            "Pasture Land is a scenic area featuring a patchwork of lush, green grasses and wildflowers, with scattered trees and minimal crop rows, often including farm buildings.",
            "Pasture Land is a lush, green area with scattered trees, grasses, wildflowers, and shrubs, often surrounded by fences and featuring visible grazing paths and occasional farm structures.",
            "Pasture Land is a patchwork of lush, green areas with scattered trees, gentle undulations, and minimal infrastructure, featuring lush grasses and wildflowers in a serene and natural setting.",
            "Pasture Land typically features a lush, uneven surface with a slightly rough texture, exhibiting a mix of uniform green and darker spots, with scattered tufts of grass and occasional wildflowers."
        ],
        "structure": [
            [
                {
                    "A": "Pasture Land",
                    "R": "is",
                    "B": "characterized"
                },
                {
                    "A": "Pasture Land",
                    "R": "has",
                    "B": "uniform green color"
                },
                {
                    "A": "Pasture Land",
                    "R": "has",
                    "B": "scattered, irregularly-shaped patches of darker green trees"
                },
                {
                    "A": "Pasture Land",
                    "R": "has",
                    "B": "unevenly distributed grasses"
                },
                {
                    "A": "Pasture Land",
                    "R": "has",
                    "B": "wildflowers"
                },
                {
                    "A": "Pasture Land",
                    "R": "has",
                    "B": "shrubs"
                },
                {
                    "A": "Pasture Land",
                    "R": "has",
                    "B": "small trees"
                }
            ],
            [
                {
                    "A": "satellite photo",
                    "R": "contains",
                    "B": "annual crop land"
                },
                {
                    "A": "annual crop land",
                    "R": "appears",
                    "B": "mosaic"
                },
                {
                    "A": "Pasture Land",
                    "R": "is",
                    "B": "scenic area"
                },
                {
                    "A": "scenic area",
                    "R": "featuring",
                    "B": "patchwork"
                },
                {
                    "A": "patchwork",
                    "R": "of",
                    "B": "lush, green grasses and wildflowers"
                },
                {
                    "A": "lush, green grasses and wildflowers",
                    "R": "with",
                    "B": "scattered trees"
                },
                {
                    "A": "lush, green grasses and wildflowers",
                    "R": "with",
                    "B": "minimal crop rows"
                },
                {
                    "A": "lush, green grasses and wildflowers",
                    "R": "including",
                    "B": "farm buildings"
                }
            ],
            [
                {
                    "A": "Pasture Land",
                    "R": "is",
                    "B": "a lush, green area"
                },
                {
                    "A": "a lush, green area",
                    "R": "with",
                    "B": "scattered trees, grasses, wildflowers, and shrubs"
                },
                {
                    "A": "scattered trees, grasses, wildflowers, and shrubs",
                    "R": "and",
                    "B": "often surrounded by fences and featuring visible grazing paths and occasional farm structures"
                },
                {
                    "A": "often surrounded by fences and featuring visible grazing paths and occasional farm structures",
                    "R": "is",
                    "B": "Pasture Land"
                }
            ],
            [
                {
                    "A": "Pasture Land",
                    "R": "is",
                    "B": "a patchwork"
                },
                {
                    "A": "a patchwork",
                    "R": "of",
                    "B": "lush, green areas"
                },
                {
                    "A": "lush, green areas",
                    "R": "with",
                    "B": "scattered trees"
                },
                {
                    "A": "lush, green areas",
                    "R": "with",
                    "B": "gentle undulations"
                },
                {
                    "A": "lush, green areas",
                    "R": "with",
                    "B": "minimal infrastructure"
                },
                {
                    "A": "lush grasses and wildflowers",
                    "R": "in",
                    "B": "a serene and natural setting"
                }
            ],
            [
                {
                    "A": "Pasture Land",
                    "R": "typically features",
                    "B": "a lush, uneven surface"
                },
                {
                    "A": "a lush, uneven surface",
                    "R": "with",
                    "B": "a slightly rough texture"
                },
                {
                    "A": "a slightly rough texture",
                    "R": "exhibiting",
                    "B": "a mix of uniform green and darker spots"
                },
                {
                    "A": "a mix of uniform green and darker spots",
                    "R": "with",
                    "B": "scattered tufts of grass and occasional wildflowers"
                }
            ]
        ]
    },
    "Permanent Crop Land": {
        "coarse_description": [
            "Permanent Crop Land is characterized by a uniform, geometric pattern of rows or plots, often with no natural vegetation.",
            "Permanent Crop Land appears as uniform, geometric patterns of planted rows, often with distinct boundaries and minimal vegetation variation.",
            "Permanent Crop Land appears as uniform, rectangular, and intensively cultivated areas with consistent crop patterns and minimal vegetation.",
            "Permanent Crop Land appears as uniform, intensely green or yellowish areas with consistent shapes and boundaries in satellite imagery.",
            "Permanent Crop Land typically exhibits uniform, smooth, and even surfaces with minimal topographic features and subtle color variations."
        ],
        "fine_description": [
            "Permanent Crop Land features rows of uniform, regularly spaced, and densely planted crops, often with a consistent height and texture.",
            "Permanent Crop Land features rows of uniform, cultivated plants with consistent spacing and growth patterns.",
            "Permanent Crop Land features uniform rows of cultivated plants with precise spacing, regular pruning, and deliberate soil management.",
            "Permanent Crop Land is characterized by uniform rows of mature, dense, and well-maintained crops with minimal soil exposure.",
            "Permanent Crop Land typically features smooth, uniform, and often glossy surfaces, such as rows of neatly trimmed vines or leaves."
        ],
        "overall_description": [
            "Permanent Crop Land is characterized by a uniform, geometric pattern of rows or plots, featuring regularly spaced and densely planted crops with consistent height and texture, often with no natural vegetation.",
            "Permanent Crop Land is characterized by uniform, geometric patterns of planted rows with distinct boundaries and consistent spacing and growth patterns of cultivated plants.",
            "Permanent Crop Land is characterized by uniform, rectangular areas with precise crop patterns, consistent spacing, regular pruning, and deliberate soil management, featuring minimal vegetation and intensive cultivation.",
            "Permanent Crop Land appears as uniform, intensely green or yellowish areas with consistent shapes and boundaries, featuring uniform rows of mature, dense, and well-maintained crops with minimal soil exposure.",
            "Permanent Crop Land typically exhibits smooth, uniform, and even surfaces with minimal topographic features, often featuring glossy surfaces with neatly trimmed vines or leaves."
        ],
        "structure": [
            [
                {
                    "A": "Permanent Crop Land",
                    "R": "is",
                    "B": "characterized"
                },
                {
                    "A": "characterized",
                    "R": "by",
                    "B": "a uniform, geometric pattern"
                },
                {
                    "A": "a uniform, geometric pattern",
                    "R": "of",
                    "B": "rows or plots"
                },
                {
                    "A": "rows or plots",
                    "R": "featuring",
                    "B": "regularly spaced and densely planted crops"
                },
                {
                    "A": "regularly spaced and densely planted crops",
                    "R": "with",
                    "B": "consistent height and texture"
                },
                {
                    "A": "consistent height and texture",
                    "R": "often",
                    "B": "with no natural vegetation"
                }
            ],
            [
                {
                    "A": "Permanent Crop Land",
                    "R": "is",
                    "B": "characterized"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "has",
                    "B": "uniform"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "has",
                    "B": "geometric patterns"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "has",
                    "B": "planted rows"
                },
                {
                    "A": "planted rows",
                    "R": "have",
                    "B": "distinct boundaries"
                },
                {
                    "A": "planted rows",
                    "R": "have",
                    "B": "consistent spacing"
                },
                {
                    "A": "planted rows",
                    "R": "have",
                    "B": "growth patterns"
                },
                {
                    "A": "planted rows",
                    "R": "of",
                    "B": "cultivated plants"
                }
            ],
            [
                {
                    "A": "Permanent Crop Land",
                    "R": "is characterized by",
                    "B": "uniform, rectangular areas"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "has",
                    "B": "precise crop patterns"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "has",
                    "B": "consistent spacing"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "has",
                    "B": "regular pruning"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "has",
                    "B": "deliberate soil management"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "features",
                    "B": "minimal vegetation"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "has",
                    "B": "intensive cultivation"
                }
            ],
            [
                {
                    "A": "Permanent Crop Land",
                    "R": "appears",
                    "B": "uniform, intensely green or yellowish areas"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "features",
                    "B": "uniform rows of mature, dense, and well-maintained crops"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "has",
                    "B": "consistent shapes and boundaries"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "has",
                    "B": "minimal soil exposure"
                }
            ],
            [
                {
                    "A": "Permanent Crop Land",
                    "R": "exhibits",
                    "B": "smooth, uniform, and even surfaces"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "has",
                    "B": "minimal topographic features"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "features",
                    "B": "glossy surfaces"
                },
                {
                    "A": "Permanent Crop Land",
                    "R": "features",
                    "B": "neatly trimmed vines or leaves"
                }
            ]
        ]
    },
    "Residential Buildings": {
        "coarse_description": [
            "Residential buildings are characterized by a uniform, grid-like pattern of rectangular shapes with straight edges and right angles.",
            "Residential buildings appear as clusters of rectangular shapes with varying sizes and colors, often surrounded by green spaces and roads.",
            "Residential buildings typically appear as rectangular or irregularly-shaped structures with flat roofs, straight walls, and varying heights.",
            "Residential buildings appear as clusters of rectangular shapes with varying sizes, densities, and colors amidst green spaces and roads.",
            "Residential buildings typically exhibit smooth, flat roofs, and walls with varied textures such as brick, stucco, or siding."
        ],
        "fine_description": [
            "Residential Buildings typically feature a variety of architectural styles, including pitched roofs, dormer windows, and ornate facades.",
            "Residential Buildings typically feature walls, windows, doors, and roofs, with varied architectural styles, colors, and textures.",
            "Residential Buildings typically feature a mix of materials, such as brick, wood, and glass, with varying rooflines and architectural styles.",
            "Residential Buildings are typically characterized by a mix of rectangular shapes, varying heights, and a combination of windows and doors.",
            "Residential Buildings typically feature smooth, weathered, and sometimes rough-textured surfaces, such as stucco, brick, or wood, with various architectural details."
        ],
        "overall_description": [
            "Residential buildings typically feature a uniform grid-like pattern with rectangular shapes and straight edges, and often exhibit a variety of architectural styles, including pitched roofs, dormer windows, and ornate facades.",
            "Residential buildings are clusters of rectangular structures with varied sizes, colors, and architectural styles, typically featuring walls, windows, doors, and roofs, often surrounded by green spaces and roads.",
            "Residential buildings are typically rectangular or irregularly-shaped structures with flat roofs, straight walls, and varying heights, featuring a mix of materials, rooflines, and architectural styles.",
            "Residential buildings are clusters of rectangular shapes with varying sizes, heights, and colors, often situated amidst green spaces and roads, featuring a mix of windows and doors.",
            "Residential buildings typically exhibit smooth, flat roofs and walls with varied textures, including smooth, weathered, or rough-textured surfaces made of materials like stucco, brick, wood, or siding."
        ],
        "structure": [
            [
                {
                    "A": "Residential buildings",
                    "R": "feature",
                    "B": "uniform grid-like pattern"
                },
                {
                    "A": "Residential buildings",
                    "R": "have",
                    "B": "rectangular shapes"
                },
                {
                    "A": "Residential buildings",
                    "R": "have",
                    "B": "straight edges"
                },
                {
                    "A": "Residential buildings",
                    "R": "exhibit",
                    "B": "variety of architectural styles"
                },
                {
                    "A": "Residential buildings",
                    "R": "include",
                    "B": "pitched roofs"
                },
                {
                    "A": "Residential buildings",
                    "R": "include",
                    "B": "dormer windows"
                },
                {
                    "A": "Residential buildings",
                    "R": "include",
                    "B": "ornate facades"
                }
            ],
            [
                {
                    "A": "satellite photo",
                    "R": "contains",
                    "B": "annual crop land"
                },
                {
                    "A": "annual crop land",
                    "R": "appears",
                    "B": "mosaic"
                },
                {
                    "A": "Residential buildings",
                    "R": "are",
                    "B": "clusters"
                },
                {
                    "A": "clusters",
                    "R": "of",
                    "B": "rectangular structures"
                },
                {
                    "A": "rectangular structures",
                    "R": "with",
                    "B": "varied sizes"
                },
                {
                    "A": "rectangular structures",
                    "R": "with",
                    "B": "colors"
                },
                {
                    "A": "rectangular structures",
                    "R": "with",
                    "B": "architectural styles"
                },
                {
                    "A": "Residential buildings",
                    "R": "typically featuring",
                    "B": "walls"
                },
                {
                    "A": "Residential buildings",
                    "R": "typically featuring",
                    "B": "windows"
                },
                {
                    "A": "Residential buildings",
                    "R": "typically featuring",
                    "B": "doors"
                },
                {
                    "A": "Residential buildings",
                    "R": "typically featuring",
                    "B": "roofs"
                },
                {
                    "A": "Residential buildings",
                    "R": "often surrounded by",
                    "B": "green spaces"
                },
                {
                    "A": "Residential buildings",
                    "R": "often surrounded by",
                    "B": "roads"
                }
            ],
            [
                {
                    "A": "Residential buildings",
                    "R": "are",
                    "B": "typically rectangular or irregularly-shaped structures"
                },
                {
                    "A": "Residential buildings",
                    "R": "have",
                    "B": "flat roofs"
                },
                {
                    "A": "Residential buildings",
                    "R": "have",
                    "B": "straight walls"
                },
                {
                    "A": "Residential buildings",
                    "R": "have",
                    "B": "varying heights"
                },
                {
                    "A": "Residential buildings",
                    "R": "feature",
                    "B": "a mix of materials"
                },
                {
                    "A": "Residential buildings",
                    "R": "feature",
                    "B": "rooflines"
                },
                {
                    "A": "Residential buildings",
                    "R": "feature",
                    "B": "architectural styles"
                }
            ],
            [
                {
                    "A": "Residential buildings",
                    "R": "are",
                    "B": "clusters"
                },
                {
                    "A": "Residential buildings",
                    "R": "are",
                    "B": "rectangular shapes"
                },
                {
                    "A": "Residential buildings",
                    "R": "have",
                    "B": "varying sizes"
                },
                {
                    "A": "Residential buildings",
                    "R": "have",
                    "B": "heights"
                },
                {
                    "A": "Residential buildings",
                    "R": "have",
                    "B": "colors"
                },
                {
                    "A": "Residential buildings",
                    "R": "are",
                    "B": "situated"
                },
                {
                    "A": "Residential buildings",
                    "R": "are",
                    "B": "amidst"
                },
                {
                    "A": "green spaces and roads",
                    "R": "are",
                    "B": "situated"
                },
                {
                    "A": "Residential buildings",
                    "R": "feature",
                    "B": "a mix"
                },
                {
                    "A": "Residential buildings",
                    "R": "feature",
                    "B": "windows"
                },
                {
                    "A": "Residential buildings",
                    "R": "feature",
                    "B": "doors"
                }
            ],
            [
                {
                    "A": "Residential buildings",
                    "R": "exhibit",
                    "B": "smooth, flat roofs"
                },
                {
                    "A": "Residential buildings",
                    "R": "exhibit",
                    "B": "walls with varied textures"
                },
                {
                    "A": "smooth, flat roofs",
                    "R": "have",
                    "B": "varied textures"
                },
                {
                    "A": "walls with varied textures",
                    "R": "have",
                    "B": "smooth, weathered, or rough-textured surfaces"
                },
                {
                    "A": "smooth, weathered, or rough-textured surfaces",
                    "R": "made of",
                    "B": "materials like stucco, brick, wood, or siding"
                }
            ]
        ]
    },
    "River": {
        "coarse_description": [
            "River's winding, serpentine shape and meandering course distinguish it from other landforms in a centered satellite photo.",
            "Rivers appear as winding, sinuous lines with gentle curves, often with a darker tone due to vegetation and sediment.",
            "River appears as a serpentine, winding feature with a clear or cloudy boundary and varying width and depth.",
            "River appears as a sinuous, winding line of blue or green, often surrounded by varying shades of land and vegetation.",
            "River surfaces typically exhibit a winding, serpentine pattern with smooth, reflective water and adjacent vegetated or sandy banks."
        ],
        "fine_description": [
            "River's banks are often defined by steep slopes and dense vegetation, distinguishing it from Sea's open shores.",
            "A river typically features a winding course, varying water depth, and a gradual slope with lush vegetation along its banks.",
            "A river's appearance is characterized by its winding course, gradual slope, and varied width, often with vegetation-lined banks.",
            "A river is characterized by its winding course, often with steep banks and a narrower, faster-moving water flow.",
            "Rivers typically feature a rough, rocky, or pebbly surface, with varying degrees of smoothness and irregularities."
        ],
        "overall_description": [
            "River is a winding and serpentine watercourse with steep, vegetated banks, distinguishable from other landforms and seas by its unique shape and terrain features.",
            "A river is a winding, sinuous watercourse with a gentle curve, varying depth, and gradual slope, often featuring a darker tone and lush vegetation along its banks.",
            "A river is a serpentine, winding feature with a clear or cloudy boundary, varying width and depth, gradual slope, and vegetation-lined banks, often with a varied appearance.",
            "A river is a sinuous, winding line of blue or green water, often surrounded by varying shades of land and vegetation, with steep banks and a narrower, faster-moving flow.",
            "Rivers typically feature a winding pattern with surfaces ranging from smooth and reflective to rough, rocky, or pebbly, often with varying degrees of smoothness and irregularities."
        ],
        "structure": [
            [
                {
                    "A": "River",
                    "R": "is",
                    "B": "a winding and serpentine watercourse"
                },
                {
                    "A": "River",
                    "R": "with",
                    "B": "steep, vegetated banks"
                },
                {
                    "A": "River",
                    "R": "distinguishable from",
                    "B": "other landforms and seas"
                },
                {
                    "A": "River",
                    "R": "by",
                    "B": "its unique shape and terrain features"
                }
            ],
            [
                {
                    "A": "river",
                    "R": "is",
                    "B": "a winding, sinuous watercourse"
                },
                {
                    "A": "river",
                    "R": "has",
                    "B": "a gentle curve"
                },
                {
                    "A": "river",
                    "R": "has",
                    "B": "varying depth"
                },
                {
                    "A": "river",
                    "R": "has",
                    "B": "a gradual slope"
                },
                {
                    "A": "river",
                    "R": "often features",
                    "B": "a darker tone"
                },
                {
                    "A": "river",
                    "R": "often features",
                    "B": "lush vegetation along its banks"
                }
            ],
            [
                {
                    "A": "river",
                    "R": "is",
                    "B": "serpentine, winding feature"
                },
                {
                    "A": "river",
                    "R": "has",
                    "B": "clear or cloudy boundary"
                },
                {
                    "A": "river",
                    "R": "has",
                    "B": "varying width and depth"
                },
                {
                    "A": "river",
                    "R": "has",
                    "B": "gradual slope"
                },
                {
                    "A": "river",
                    "R": "has",
                    "B": "vegetation-lined banks"
                },
                {
                    "A": "river",
                    "R": "often has",
                    "B": "varied appearance"
                }
            ],
            [
                {
                    "A": "river",
                    "R": "is",
                    "B": "sinuous, winding line of blue or green water"
                },
                {
                    "A": "river",
                    "R": "is",
                    "B": "often surrounded by varying shades of land and vegetation"
                },
                {
                    "A": "river",
                    "R": "has",
                    "B": "steep banks"
                },
                {
                    "A": "river",
                    "R": "has",
                    "B": "a narrower, faster-moving flow"
                }
            ],
            [
                {
                    "A": "Rivers",
                    "R": "typically feature",
                    "B": "a winding pattern"
                },
                {
                    "A": "Rivers",
                    "R": "have",
                    "B": "surfaces"
                },
                {
                    "A": "surfaces",
                    "R": "ranging",
                    "B": "from smooth and reflective to rough, rocky, or pebbly"
                },
                {
                    "A": "surfaces",
                    "R": "often",
                    "B": "with varying degrees of smoothness and irregularities"
                }
            ]
        ]
    },
    "Sea or Lake": {
        "coarse_description": [
            "The visual cue unique to Sea or Lake is the presence of a distinct shoreline or coastline with water's edge.",
            "Sea or lake appears as a distinct, reflective blue or gray area with a defined shoreline in a centered satellite photo.",
            "A sea or lake is characterized by a smooth, curved or irregular boundary, with a distinct shoreline and reflective surface.",
            "Sea or Lake appears as a large, smooth, and continuous body of water with a distinct shoreline or coastline.",
            "Sea or lake surfaces typically exhibit a smooth, reflective, and glassy appearance with subtle ripples or waves."
        ],
        "fine_description": [
            "Sea or Lake features a distinct horizon line, often with a visible sky-blue color, separating the water from the atmosphere.",
            "A sea or lake is a vast, calm body of water with a relatively flat surface and no visible current.",
            "A Sea or Lake is characterized by a calm, vast, and relatively still body of water with a distinct shoreline.",
            "A Sea or Lake appears as a vast, calm body of water with a visible horizon, often surrounded by land.",
            "Sea and Lake surfaces typically feature gentle ripples, calm waves, and a smooth, reflective sheen."
        ],
        "overall_description": [
            "A Sea or Lake is characterized by a distinct shoreline or coastline with a water's edge, and a horizon line separating the water from the atmosphere, often with a visible sky-blue color.",
            "A sea or lake is a vast, calm body of water with a flat surface, defined shoreline, and a reflective blue or gray appearance, often appearing as a distinct area in satellite photos.",
            "A sea or lake is a calm, vast, and relatively still body of water with a distinct shoreline, characterized by a smooth, curved or irregular boundary and reflective surface.",
            "A sea or lake is a vast, calm, and continuous body of water with a visible horizon, surrounded by land, featuring a distinct shoreline or coastline.",
            "Sea or lake surfaces typically display a smooth, reflective, and glassy appearance with gentle ripples, calm waves, and a subtle sheen, often exhibiting a serene and tranquil atmosphere."
        ],
        "structure": [
            [
                {
                    "A": "A Sea or Lake",
                    "R": "is characterized by",
                    "B": "a distinct shoreline or coastline"
                },
                {
                    "A": "A Sea or Lake",
                    "R": "has",
                    "B": "a water's edge"
                },
                {
                    "A": "A Sea or Lake",
                    "R": "has",
                    "B": "a horizon line"
                },
                {
                    "A": "A Sea or Lake",
                    "R": "separates",
                    "B": "the water from the atmosphere"
                },
                {
                    "A": "A Sea or Lake",
                    "R": "often has",
                    "B": "a visible sky-blue color"
                }
            ],
            [
                {
                    "A": "sea or lake",
                    "R": "is",
                    "B": "vast, calm body of water"
                },
                {
                    "A": "vast, calm body of water",
                    "R": "has",
                    "B": "flat surface"
                },
                {
                    "A": "vast, calm body of water",
                    "R": "has",
                    "B": "defined shoreline"
                },
                {
                    "A": "vast, calm body of water",
                    "R": "has",
                    "B": "reflective blue or gray appearance"
                },
                {
                    "A": "vast, calm body of water",
                    "R": "often appears as",
                    "B": "distinct area in satellite photos"
                }
            ],
            [
                {
                    "A": "a sea or lake",
                    "R": "is",
                    "B": "a calm, vast, and relatively still body of water"
                },
                {
                    "A": "a calm, vast, and relatively still body of water",
                    "R": "has",
                    "B": "a distinct shoreline"
                },
                {
                    "A": "a distinct shoreline",
                    "R": "characterized by",
                    "B": "a smooth, curved or irregular boundary"
                },
                {
                    "A": "a smooth, curved or irregular boundary",
                    "R": "and",
                    "B": "a reflective surface"
                }
            ],
            [
                {
                    "A": "sea or lake",
                    "R": "is",
                    "B": "vast, calm, and continuous body of water"
                },
                {
                    "A": "vast, calm, and continuous body of water",
                    "R": "has",
                    "B": "visible horizon"
                },
                {
                    "A": "vast, calm, and continuous body of water",
                    "R": "is",
                    "B": "surrounded by land"
                },
                {
                    "A": "vast, calm, and continuous body of water",
                    "R": "features",
                    "B": "distinct shoreline or coastline"
                }
            ],
            [
                {
                    "A": "Sea or lake surfaces",
                    "R": "typically display",
                    "B": "a smooth, reflective, and glassy appearance"
                },
                {
                    "A": "a smooth, reflective, and glassy appearance",
                    "R": "with",
                    "B": "gentle ripples"
                },
                {
                    "A": "a smooth, reflective, and glassy appearance",
                    "R": "with",
                    "B": "calm waves"
                },
                {
                    "A": "a smooth, reflective, and glassy appearance",
                    "R": "with",
                    "B": "a subtle sheen"
                },
                {
                    "A": "a smooth, reflective, and glassy appearance",
                    "R": "often exhibiting",
                    "B": "a serene and tranquil atmosphere"
                }
            ]
        ]
    }
}