{
    "abyssinian": {
        "coarse_description": [
            "A pet Abyssinian's unique visual cue is its ticked, agouti-patterned coat with distinctive M-shaped markings on the forehead.",
            "Abyssinian cats have a distinctive ticked coat, with agouti hairs featuring bands of color on each individual hair shaft.",
            "Abyssinian cats are characterized by their distinctive ticked, agouti coat pattern, medium-length fur, and slender, athletic build.",
            "An Abyssinian cat is distinguished by its ticked, agouti-patterned fur, slender build, and large ears with rounded tips.",
            "Abyssinian cats typically have a distinctive ticked coat with a soft, silky texture and a slightly wavy or ridged surface."
        ],
        "fine_description": [
            "Abyssinian's ticked coat features a distinctive, agouti-like pattern of alternating bands of color on each hair shaft.",
            "The Abyssinian has a ticked coat with a golden-brown base color and distinctive dark brown or black markings.",
            "The Abyssinian has a ticked, warm-toned coat with a distinctive M-shaped forehead marking and large, almond-shaped eyes.",
            "The Abyssinian has a ticked, agouti-like coat with a distinctive M-shaped marking on its forehead.",
            "Abyssinian cats have a soft, woolly coat with a distinctive ticked pattern, featuring tight, even curls of fur."
        ],
        "overall_description": [
            "The Abyssinian has a ticked, agouti-patterned coat with distinctive M-shaped forehead markings and alternating bands of color on each hair shaft, creating a unique and striking visual appearance.",
            "Abyssinian cats have a distinctive ticked coat with agouti hairs featuring bands of color on each shaft, typically golden-brown with dark brown or black markings.",
            "The Abyssinian cat features a ticked, warm-toned coat with a medium-length fur, slender build, and distinctive M-shaped forehead marking, complemented by large, almond-shaped eyes.",
            "The Abyssinian cat features a ticked, agouti-patterned coat, slender build, large ears with rounded tips, and a distinctive M-shaped marking on its forehead.",
            "Abyssinian cats have a distinctive ticked coat with a soft, silky or woolly texture, featuring tight, even curls or a slightly wavy/ridged surface with a soft, silky feel."
        ],
        "structure": [
            [
                {
                    "A": "The Abyssinian",
                    "R": "has",
                    "B": "ticked, agouti-patterned coat"
                },
                {
                    "A": "ticked, agouti-patterned coat",
                    "R": "with",
                    "B": "distinctive M-shaped forehead markings"
                },
                {
                    "A": "ticked, agouti-patterned coat",
                    "R": "with",
                    "B": "alternating bands of color on each hair shaft"
                },
                {
                    "A": "ticked, agouti-patterned coat",
                    "R": "creating",
                    "B": "unique and striking visual appearance"
                }
            ],
            [
                {
                    "A": "Abyssinian cats",
                    "R": "have",
                    "B": "distinctive ticked coat"
                },
                {
                    "A": "distinctive ticked coat",
                    "R": "with",
                    "B": "agouti hairs"
                },
                {
                    "A": "agouti hairs",
                    "R": "featuring",
                    "B": "bands of color"
                },
                {
                    "A": "bands of color",
                    "R": "on",
                    "B": "each shaft"
                },
                {
                    "A": "each shaft",
                    "R": "typically",
                    "B": "golden-brown"
                },
                {
                    "A": "golden-brown",
                    "R": "with",
                    "B": "dark brown or black markings"
                }
            ],
            [
                {
                    "A": "Abyssinian cat",
                    "R": "features",
                    "B": "ticked, warm-toned coat"
                },
                {
                    "A": "Abyssinian cat",
                    "R": "has",
                    "B": "medium-length fur"
                },
                {
                    "A": "Abyssinian cat",
                    "R": "has",
                    "B": "slender build"
                },
                {
                    "A": "Abyssinian cat",
                    "R": "has",
                    "B": "distinctive M-shaped forehead marking"
                },
                {
                    "A": "Abyssinian cat",
                    "R": "has",
                    "B": "large, almond-shaped eyes"
                }
            ],
            [
                {
                    "A": "Abyssinian cat",
                    "R": "features",
                    "B": "ticked, agouti-patterned coat"
                },
                {
                    "A": "Abyssinian cat",
                    "R": "has",
                    "B": "slender build"
                },
                {
                    "A": "Abyssinian cat",
                    "R": "has",
                    "B": "large ears with rounded tips"
                },
                {
                    "A": "Abyssinian cat",
                    "R": "has",
                    "B": "a distinctive M-shaped marking on its forehead"
                }
            ],
            [
                {
                    "A": "Abyssinian cats",
                    "R": "have",
                    "B": "a distinctive ticked coat"
                },
                {
                    "A": "a distinctive ticked coat",
                    "R": "with",
                    "B": "a soft, silky or woolly texture"
                },
                {
                    "A": "a soft, silky or woolly texture",
                    "R": "featuring",
                    "B": "tight, even curls or a slightly wavy/ridged surface"
                },
                {
                    "A": "tight, even curls or a slightly wavy/ridged surface",
                    "R": "with",
                    "B": "a soft, silky feel"
                }
            ]
        ]
    },
    "american bulldog": {
        "coarse_description": [
            "A pet American Bulldog's distinctive wrinkled, folded skin on its face and head, resembling a \"mask\" or \"frown.\"",
            "A pet American Bulldog has a sturdy, muscular build, wrinkled face, and a distinctive \"bat ear\" shape.",
            "A pet American Bulldog typically has a sturdy, muscular build, wrinkled skin, and a distinctive \"bat ear\" shape.",
            "A pet American Bulldog is distinguished by its sturdy build, wrinkled face, and distinctive \"bat ears\" and underbite.",
            "A pet American Bulldog typically has a short, smooth, and slightly coarse coat with a subtle sheen."
        ],
        "fine_description": [
            "The pet American Bulldog has a distinctive \"scooped\" muzzle with a prominent stop, giving it a unique facial profile.",
            "The American Bulldog has a broad, wrinkled head, a flat face, and a distinctive \"box-like\" muzzle with a prominent underbite.",
            "The American Bulldog has a sturdy, muscular build with a wrinkled, broad head and a distinctive \"bat ear\" shape.",
            "The American Bulldog has a distinctive wrinkled face, prominent underbite, and sturdy build with a muscular, athletic physique.",
            "American bulldogs have a distinctive, rougher, and more pronounced wrinkled skin with a slightly coarse, suede-like texture."
        ],
        "overall_description": [
            "The American Bulldog has a distinctive facial appearance, characterized by wrinkled, folded skin resembling a \"mask\" or \"frown\", a \"scooped\" muzzle with a prominent stop, and a unique facial profile.",
            "The American Bulldog has a sturdy, muscular build, with a broad, wrinkled head, flat face, \"bat ear\" shape, and distinctive \"box-like\" muzzle featuring a prominent underbite.",
            "The American Bulldog is a sturdy, muscular dog with wrinkled skin, a broad head, and distinctive \"bat ear\" shape, characterized by its robust build and unique facial features.",
            "The American Bulldog is a sturdy dog with a wrinkled face, prominent underbite, and distinctive \"bat ears\", featuring a muscular and athletic physique.",
            "An American Bulldog typically has a short, smooth to slightly coarse coat with a subtle sheen, and distinctive wrinkled skin with a suede-like texture."
        ],
        "structure": [
            [
                {
                    "A": "The American Bulldog",
                    "R": "has",
                    "B": "a distinctive facial appearance"
                },
                {
                    "A": "a distinctive facial appearance",
                    "R": "is characterized by",
                    "B": "wrinkled, folded skin resembling a'mask' or 'frown'"
                },
                {
                    "A": "a distinctive facial appearance",
                    "R": "is characterized by",
                    "B": "a'scooped' muzzle with a prominent stop"
                },
                {
                    "A": "a distinctive facial appearance",
                    "R": "is characterized by",
                    "B": "a unique facial profile"
                }
            ],
            [
                {
                    "A": "The American Bulldog",
                    "R": "has",
                    "B": "a sturdy, muscular build"
                },
                {
                    "A": "a sturdy, muscular build",
                    "R": "with",
                    "B": "a broad, wrinkled head"
                },
                {
                    "A": "a broad, wrinkled head",
                    "R": "has",
                    "B": "a flat face"
                },
                {
                    "A": "a flat face",
                    "R": "has",
                    "B": "a \"bat ear\" shape"
                },
                {
                    "A": "a \"bat ear\" shape",
                    "R": "and",
                    "B": "a distinctive \"box-like\" muzzle"
                },
                {
                    "A": "a distinctive \"box-like\" muzzle",
                    "R": "features",
                    "B": "a prominent underbite"
                }
            ],
            [
                {
                    "A": "American Bulldog",
                    "R": "is",
                    "B": "a sturdy, muscular dog"
                },
                {
                    "A": "American Bulldog",
                    "R": "has",
                    "B": "wrinkled skin"
                },
                {
                    "A": "American Bulldog",
                    "R": "has",
                    "B": "a broad head"
                },
                {
                    "A": "American Bulldog",
                    "R": "has",
                    "B": "distinctive 'bat ear' shape"
                },
                {
                    "A": "American Bulldog",
                    "R": "is",
                    "B": "characterized by its robust build"
                },
                {
                    "A": "American Bulldog",
                    "R": "has",
                    "B": "unique facial features"
                }
            ],
            [
                {
                    "A": "The American Bulldog",
                    "R": "is",
                    "B": "a sturdy dog"
                },
                {
                    "A": "a sturdy dog",
                    "R": "with",
                    "B": "a wrinkled face"
                },
                {
                    "A": "a wrinkled face",
                    "R": "has",
                    "B": "prominent underbite"
                },
                {
                    "A": "a sturdy dog",
                    "R": "has",
                    "B": "prominent underbite"
                },
                {
                    "A": "a sturdy dog",
                    "R": "has",
                    "B": "distinctive 'bat ears'"
                },
                {
                    "A": "a sturdy dog",
                    "R": "features",
                    "B": "a muscular and athletic physique"
                }
            ],
            [
                {
                    "A": "American Bulldog",
                    "R": "has",
                    "B": "short, smooth to slightly coarse coat"
                },
                {
                    "A": "American Bulldog",
                    "R": "has",
                    "B": "subtle sheen"
                },
                {
                    "A": "American Bulldog",
                    "R": "has",
                    "B": "distinctive wrinkled skin"
                },
                {
                    "A": "American Bulldog",
                    "R": "has",
                    "B": "suede-like texture"
                }
            ]
        ]
    },
    "american pit bull terrier": {
        "coarse_description": [
            "A pet American Pit Bull Terrier's distinctive \"stop\" at the eyes, where the muzzle meets the forehead, is unique.",
            "American Pit Bull Terriers have a muscular build, short coats, and distinctive \"scissors\" bite, with a broad, flat head and erect ears.",
            "A pet American Pit Bull Terrier typically features a muscular build, short coat, and distinctive head shape with a flat skull.",
            "A pet American Pit Bull Terrier is distinguished by its muscular build, short coat, and distinctive broad head with a flat forehead.",
            "Pet American Pit Bull Terriers typically have a short, smooth, and glossy coat with a subtle sheen and fine texture."
        ],
        "fine_description": [
            "The American Pit Bull Terrier's distinctive \"scissors\" bite, where upper and lower teeth intersect, sets it apart.",
            "The American Pit Bull Terrier has a muscular build, with a broad chest and well-defined shoulders, and a short, smooth coat.",
            "The American Pit Bull Terrier has a muscular build, broad chest, and distinctive \"scissors\" bite with an underbite.",
            "The American Pit Bull Terrier has a distinctive muscular build, with a broad chest and a curved tail.",
            "The American Pit Bull Terrier's coat often features a smooth, glossy texture with a subtle sheen, feeling slightly velvety to the touch."
        ],
        "overall_description": [
            "The American Pit Bull Terrier is characterized by its distinctive \"stop\" at the eyes and \"scissors\" bite, where upper and lower teeth intersect, setting it apart from other breeds.",
            "The American Pit Bull Terrier is a muscular breed with a broad, flat head, erect ears, short, smooth coat, and distinctive \"scissors\" bite, featuring a broad chest and well-defined shoulders.",
            "The American Pit Bull Terrier is a muscular breed with a short coat, distinctive flat skull, broad chest, and \"scissors\" bite with an underbite, characterized by its athletic build and unique facial features.",
            "The American Pit Bull Terrier is a muscular breed with a short coat, broad head, flat forehead, curved tail, and broad chest, characterized by its powerful build and distinctive features.",
            "The American Pit Bull Terrier has a short, smooth, glossy coat with a subtle sheen and fine texture, feeling slightly velvety to the touch."
        ],
        "structure": [
            [
                {
                    "A": "American Pit Bull Terrier",
                    "R": "is characterized by",
                    "B": "its distinctive'stop' at the eyes"
                },
                {
                    "A": "American Pit Bull Terrier",
                    "R": "has",
                    "B": "'scissors' bite"
                },
                {
                    "A": "American Pit Bull Terrier",
                    "R": "has",
                    "B": "upper and lower teeth intersect"
                },
                {
                    "A": "American Pit Bull Terrier",
                    "R": "sets it apart from",
                    "B": "other breeds"
                }
            ],
            [
                {
                    "A": "The American Pit Bull Terrier",
                    "R": "is",
                    "B": "a muscular breed"
                },
                {
                    "A": "a muscular breed",
                    "R": "with",
                    "B": "a broad, flat head"
                },
                {
                    "A": "a broad, flat head",
                    "R": "has",
                    "B": "erect ears"
                },
                {
                    "A": "a broad, flat head",
                    "R": "has",
                    "B": "short, smooth coat"
                },
                {
                    "A": "a broad, flat head",
                    "R": "has",
                    "B": "distinctive \"scissors\" bite"
                },
                {
                    "A": "a broad, flat head",
                    "R": "has",
                    "B": "a broad chest"
                },
                {
                    "A": "a broad, flat head",
                    "R": "has",
                    "B": "well-defined shoulders"
                }
            ],
            [
                {
                    "A": "American Pit Bull Terrier",
                    "R": "is",
                    "B": "a muscular breed"
                },
                {
                    "A": "American Pit Bull Terrier",
                    "R": "has",
                    "B": "a short coat"
                },
                {
                    "A": "American Pit Bull Terrier",
                    "R": "has",
                    "B": "distinctive flat skull"
                },
                {
                    "A": "American Pit Bull Terrier",
                    "R": "has",
                    "B": "broad chest"
                },
                {
                    "A": "American Pit Bull Terrier",
                    "R": "has",
                    "B": "a scissors bite with an underbite"
                },
                {
                    "A": "American Pit Bull Terrier",
                    "R": "is",
                    "B": "characterized by its athletic build and unique facial features"
                }
            ],
            [
                {
                    "A": "The American Pit Bull Terrier",
                    "R": "is",
                    "B": "a muscular breed"
                },
                {
                    "A": "a muscular breed",
                    "R": "with",
                    "B": "a short coat"
                },
                {
                    "A": "a short coat",
                    "R": "has",
                    "B": "broad head"
                },
                {
                    "A": "broad head",
                    "R": "has",
                    "B": "flat forehead"
                },
                {
                    "A": "curved tail",
                    "R": "has",
                    "B": "broad chest"
                },
                {
                    "A": "broad chest",
                    "R": "characterized by",
                    "B": "its powerful build"
                },
                {
                    "A": "its powerful build",
                    "R": "and",
                    "B": "distinctive features"
                }
            ],
            [
                {
                    "A": "The American Pit Bull Terrier",
                    "R": "has",
                    "B": "a short, smooth, glossy coat"
                },
                {
                    "A": "a short, smooth, glossy coat",
                    "R": "with",
                    "B": "a subtle sheen"
                },
                {
                    "A": "a short, smooth, glossy coat",
                    "R": "with",
                    "B": "fine texture"
                },
                {
                    "A": "a short, smooth, glossy coat",
                    "R": "feeling",
                    "B": "slightly velvety to the touch"
                }
            ]
        ]
    },
    "basset hound": {
        "coarse_description": [
            "The distinctive \"bat ears\" of a pet basset hound, characterized by their long, droopy, and curved ear shape.",
            "A pet basset hound has a distinctive short stature, long ears, and a wrinkled, droopy face with a sweet expression.",
            "A pet basset hound is characterized by its short, stout body, long ears, and distinctive wrinkled face with a droopy expression.",
            "A pet basset hound is distinguished by its short, stout body, long ears, and distinctive wrinkled face.",
            "A pet basset hound typically has a short, smooth, and velvety coat with a slightly wrinkled skin surface."
        ],
        "fine_description": [
            "The pet basset hound's distinctive visual cue is its extremely short, curved legs and long, droopy ears.",
            "The basset hound has a distinctive short, curved tail and droopy ears, with a wrinkled, smooth coat.",
            "A basset hound's distinctive appearance features a short, smooth coat, wrinkled face, and long, droopy ears.",
            "The pet basset hound is characterized by its short, curved legs and distinctive wrinkled, droopy ears.",
            "A basset hound's short, smooth coat has a velvety softness with a subtle sheen, often featuring a distinctive \"break\" at the neck."
        ],
        "overall_description": [
            "A basset hound is a dog breed characterized by its distinctive features, including long, droopy, and curved ears, and extremely short, curved legs, giving it a unique and recognizable appearance.",
            "A basset hound is a short-statured dog with a distinctive appearance, featuring a wrinkled, droopy face, curved tail, and droopy ears, with a smooth, wrinkled coat.",
            "A basset hound is a short, stout dog with a smooth coat, distinctive wrinkled face, and long, droopy ears, giving it a distinctive, droopy expression.",
            "A basset hound is a short, stout dog with a distinctive wrinkled face, long curved ears, and short legs, featuring a unique combination of physical characteristics.",
            "A basset hound has a short, smooth, and velvety coat with a subtle sheen, featuring a distinctive \"break\" at the neck, and slightly wrinkled skin on its surface."
        ],
        "structure": [
            [
                {
                    "A": "basset hound",
                    "R": "is",
                    "B": "dog breed"
                },
                {
                    "A": "basset hound",
                    "R": "characterized",
                    "B": "distinctive features"
                },
                {
                    "A": "distinctive features",
                    "R": "including",
                    "B": "long, droopy, and curved ears"
                },
                {
                    "A": "distinctive features",
                    "R": "including",
                    "B": "extremely short, curved legs"
                },
                {
                    "A": "basset hound",
                    "R": "giving",
                    "B": "unique and recognizable appearance"
                }
            ],
            [
                {
                    "A": "basset hound",
                    "R": "is",
                    "B": "a short-statured dog"
                },
                {
                    "A": "basset hound",
                    "R": "has",
                    "B": "a distinctive appearance"
                },
                {
                    "A": "basset hound",
                    "R": "features",
                    "B": "a wrinkled, droopy face"
                },
                {
                    "A": "basset hound",
                    "R": "features",
                    "B": "curved tail"
                },
                {
                    "A": "basset hound",
                    "R": "features",
                    "B": "droopy ears"
                },
                {
                    "A": "basset hound",
                    "R": "has",
                    "B": "a smooth, wrinkled coat"
                }
            ],
            [
                {
                    "A": "A basset hound",
                    "R": "is",
                    "B": "a short, stout dog"
                },
                {
                    "A": "a short, stout dog",
                    "R": "has",
                    "B": "a smooth coat"
                },
                {
                    "A": "a short, stout dog",
                    "R": "has",
                    "B": "distinctive wrinkled face"
                },
                {
                    "A": "a short, stout dog",
                    "R": "has",
                    "B": "long, droopy ears"
                },
                {
                    "A": "a short, stout dog",
                    "R": "gives",
                    "B": "a distinctive, droopy expression"
                }
            ],
            [
                {
                    "A": "basset hound",
                    "R": "is",
                    "B": "a short, stout dog"
                },
                {
                    "A": "basset hound",
                    "R": "has",
                    "B": "a distinctive wrinkled face"
                },
                {
                    "A": "basset hound",
                    "R": "has",
                    "B": "long curved ears"
                },
                {
                    "A": "basset hound",
                    "R": "has",
                    "B": "short legs"
                },
                {
                    "A": "basset hound",
                    "R": "features",
                    "B": "a unique combination of physical characteristics"
                }
            ],
            [
                {
                    "A": "basset hound",
                    "R": "has",
                    "B": "short, smooth, and velvety coat"
                },
                {
                    "A": "short, smooth, and velvety coat",
                    "R": "with",
                    "B": "subtle sheen"
                },
                {
                    "A": "short, smooth, and velvety coat",
                    "R": "featuring",
                    "B": "distinctive \"break\" at the neck"
                },
                {
                    "A": "short, smooth, and velvety coat",
                    "R": "and",
                    "B": "slightly wrinkled skin on its surface"
                }
            ]
        ]
    },
    "beagle": {
        "coarse_description": [
            "A pet beagle's distinctive feature is its floppy, triangular ears that hang down from its head.",
            "Pet beagles have a compact, muscular body, floppy ears, and a distinctive \"fox-like\" head shape with a black nose.",
            "A pet beagle typically has a small to medium size, floppy ears, and a short, smooth, and tri-colored coat.",
            "A pet beagle is distinguished by its compact, muscular build, floppy ears, and distinctive black and tan coat pattern.",
            "Pet beagles typically have a short, smooth, and slightly soft coat with a subtle sheen and fine, velvety fur."
        ],
        "fine_description": [
            "A pet beagle's distinctive visual cue is its floppy, triangular ears that are moderately long and slightly rounded at the tips.",
            "A pet beagle has a short, smooth coat, floppy ears, and a sweet, curious expression on its friendly face.",
            "A beagle has a compact, muscular build, with a short, smooth coat and floppy ears.",
            "A pet beagle has a compact, muscular body with a distinctive rounded head, floppy ears, and a short, smooth coat.",
            "A pet beagle's smooth, glossy coat has a subtle sheen and a fine, velvety softness to the touch."
        ],
        "overall_description": [
            "A pet beagle is characterized by its distinctive floppy, triangular ears that are moderately long, slightly rounded at the tips, and hang down from its head.",
            "A pet beagle has a compact, muscular body, a short, smooth coat, distinctive \"fox-like\" head shape, floppy ears, and a friendly face with a sweet, curious expression.",
            "A beagle is a small to medium-sized dog with a compact, muscular build, floppy ears, and a short, smooth, tri-colored coat.",
            "A pet beagle is a compact, muscular dog with a distinctive black and tan coat pattern, rounded head, floppy ears, and short, smooth coat.",
            "Pet beagles have a short, smooth, and soft coat with a subtle sheen and fine, velvety fur, offering a glossy and velvety softness to the touch."
        ],
        "structure": [
            [
                {
                    "A": "pet beagle",
                    "R": "is characterized by",
                    "B": "its distinctive floppy, triangular ears"
                },
                {
                    "A": "its distinctive floppy, triangular ears",
                    "R": "that are",
                    "B": "moderately long"
                },
                {
                    "A": "its distinctive floppy, triangular ears",
                    "R": "that are",
                    "B": "slightly rounded at the tips"
                },
                {
                    "A": "its distinctive floppy, triangular ears",
                    "R": "and",
                    "B": "hang down from its head"
                }
            ],
            [
                {
                    "A": "pet beagle",
                    "R": "has",
                    "B": "compact, muscular body"
                },
                {
                    "A": "pet beagle",
                    "R": "has",
                    "B": "short, smooth coat"
                },
                {
                    "A": "pet beagle",
                    "R": "has",
                    "B": "distinctive 'fox-like' head shape"
                },
                {
                    "A": "pet beagle",
                    "R": "has",
                    "B": "floppy ears"
                },
                {
                    "A": "pet beagle",
                    "R": "has",
                    "B": "friendly face with a sweet, curious expression"
                }
            ],
            [
                {
                    "A": "beagle",
                    "R": "is",
                    "B": "a small to medium-sized dog"
                },
                {
                    "A": "beagle",
                    "R": "has",
                    "B": "a compact, muscular build"
                },
                {
                    "A": "beagle",
                    "R": "has",
                    "B": "floppy ears"
                },
                {
                    "A": "beagle",
                    "R": "has",
                    "B": "a short, smooth, tri-colored coat"
                }
            ],
            [
                {
                    "A": "pet beagle",
                    "R": "is",
                    "B": "a compact, muscular dog"
                },
                {
                    "A": "a compact, muscular dog",
                    "R": "has",
                    "B": "a distinctive black and tan coat pattern"
                },
                {
                    "A": "a compact, muscular dog",
                    "R": "has",
                    "B": "rounded head"
                },
                {
                    "A": "a compact, muscular dog",
                    "R": "has",
                    "B": "floppy ears"
                },
                {
                    "A": "a compact, muscular dog",
                    "R": "has",
                    "B": "short, smooth coat"
                }
            ],
            [
                {
                    "A": "beagles",
                    "R": "have",
                    "B": "a short, smooth, and soft coat"
                },
                {
                    "A": "a short, smooth, and soft coat",
                    "R": "with",
                    "B": "a subtle sheen"
                },
                {
                    "A": "a short, smooth, and soft coat",
                    "R": "with",
                    "B": "fine, velvety fur"
                },
                {
                    "A": "fine, velvety fur",
                    "R": "offering",
                    "B": "a glossy and velvety softness"
                },
                {
                    "A": "a glossy and velvety softness",
                    "R": "to",
                    "B": "the touch"
                }
            ]
        ]
    },
    "bengal": {
        "coarse_description": [
            "A pet Bengal's distinctive visual cue is its striking, spotted or marbled coat pattern, often with a golden or brown base.",
            "Pet Bengals have distinctive spotted or marbled coats, large eyes, and a muscular build, resembling a wild cat.",
            "A pet Bengal typically features a muscular build, short coat with distinctive rosettes, and a broad, rounded head with a short muzzle.",
            "A pet Bengal is distinguished by its distinctive spotted or marbled coat, with a mix of brown, gray, and white colors.",
            "Pet Bengal cats typically have a short, smooth, and glossy coat with a fine, velvety texture and a subtle sheen."
        ],
        "fine_description": [
            "A pet Bengal's distinctive visual cue is its striking spotted or marbled coat pattern with darker and lighter colors.",
            "Pet Bengals have distinctive spotted or marbled coats with a short, smooth, and glossy texture.",
            "A Bengal cat features a distinctive spotted or marbled coat with a medium-length, smooth, and glossy texture.",
            "A pet Bengal's striking coat features distinctive spotted or marbled patterns on a warm golden or brown background.",
            "A pet Bengal's fur typically features a smooth, glossy coat with a subtle sheen, showcasing fine, tight curls."
        ],
        "overall_description": [
            "A Bengal's distinctive visual cue is its striking, spotted or marbled coat pattern featuring darker and lighter colors on a golden or brown base.",
            "Pet Bengals have distinctive spotted or marbled coats with a short, smooth, and glossy texture, large eyes, and a muscular build, resembling a wild cat.",
            "A Bengal cat typically has a muscular build, short to medium-length coat with distinctive rosettes or spots, and a broad, rounded head with a short muzzle, featuring a smooth and glossy texture.",
            "A Bengal's striking coat features distinctive spotted or marbled patterns on a warm golden or brown background, with a mix of brown, gray, and white colors.",
            "Pet Bengal cats have a short, smooth, and glossy coat with a fine, velvety texture, subtle sheen, and tight curls, showcasing a luxurious and eye-catching appearance."
        ],
        "structure": [
            [
                {
                    "A": "Bengal's distinctive visual cue",
                    "R": "is",
                    "B": "its striking, spotted or marbled coat pattern"
                },
                {
                    "A": "its striking, spotted or marbled coat pattern",
                    "R": "featuring",
                    "B": "darker and lighter colors"
                },
                {
                    "A": "darker and lighter colors",
                    "R": "on",
                    "B": "a golden or brown base"
                }
            ],
            [
                {
                    "A": "Pet Bengals",
                    "R": "have",
                    "B": "distinctive spotted or marbled coats"
                },
                {
                    "A": "distinctive spotted or marbled coats",
                    "R": "with",
                    "B": "a short, smooth, and glossy texture"
                },
                {
                    "A": "distinctive spotted or marbled coats",
                    "R": "with",
                    "B": "large eyes"
                },
                {
                    "A": "distinctive spotted or marbled coats",
                    "R": "with",
                    "B": "a muscular build"
                },
                {
                    "A": "Pet Bengals",
                    "R": "resembling",
                    "B": "a wild cat"
                }
            ],
            [
                {
                    "A": "Bengal cat",
                    "R": "has",
                    "B": "muscular build"
                },
                {
                    "A": "Bengal cat",
                    "R": "has",
                    "B": "short to medium-length coat"
                },
                {
                    "A": "Bengal cat",
                    "R": "has",
                    "B": "distinctive rosettes or spots"
                },
                {
                    "A": "Bengal cat",
                    "R": "has",
                    "B": "broad, rounded head"
                },
                {
                    "A": "Bengal cat",
                    "R": "has",
                    "B": "short muzzle"
                },
                {
                    "A": "Bengal cat",
                    "R": "features",
                    "B": "smooth and glossy texture"
                }
            ],
            [
                {
                    "A": "Bengal's striking coat",
                    "R": "features",
                    "B": "distinctive spotted or marbled patterns"
                },
                {
                    "A": "distinctive spotted or marbled patterns",
                    "R": "on",
                    "B": "a warm golden or brown background"
                },
                {
                    "A": "a warm golden or brown background",
                    "R": "with",
                    "B": "a mix of brown, gray, and white colors"
                }
            ],
            [
                {
                    "A": "Pet Bengal cats",
                    "R": "have",
                    "B": "a short, smooth, and glossy coat"
                },
                {
                    "A": "a short, smooth, and glossy coat",
                    "R": "with",
                    "B": "a fine, velvety texture"
                },
                {
                    "A": "a fine, velvety texture",
                    "R": "and",
                    "B": "subtle sheen"
                },
                {
                    "A": "a fine, velvety texture",
                    "R": "and",
                    "B": "tight curls"
                },
                {
                    "A": "a short, smooth, and glossy coat",
                    "R": "with",
                    "B": "a fine, velvety texture, subtle sheen, and tight curls"
                },
                {
                    "A": "a short, smooth, and glossy coat with a fine, velvety texture, subtle sheen, and tight curls",
                    "R": "showcasing",
                    "B": "a luxurious and eye-catching appearance"
                }
            ]
        ]
    },
    "birman": {
        "coarse_description": [
            "A pet Birman's unique visual cue is the \"gloved\" or white-gloved paws, with the white fur extending up to the wrist.",
            "Pet Birmans have a distinctive white \"glove\" on each paw and a silky, medium-length coat with a golden or brown tint.",
            "A pet Birman's appearance is characterized by a white \"glove\" on each paw, blue eyes, and a medium-length coat.",
            "A pet Birman is distinguished by its distinctive \"gloved\" paw pads, white \"gloves\" on its paws, and striking blue eyes.",
            "Pet Birmans typically have a silky, soft, and fine coat with a subtle sheen and a velvety texture."
        ],
        "fine_description": [
            "The pet Birman's unique visual cue is its white \"gloves\" or paws, which are a distinctive marking on its paws.",
            "The Pet Birman has a medium-length, silky coat with a distinctive white \"glove\" on each paw, resembling a soft, fluffy sock.",
            "The pet Birman has a medium-length, silky coat with a cream-colored body and darker points or patches.",
            "A pet Birman has a white \"glove\" on each paw, with a medium-length, silky, and fine coat in various point colors.",
            "A pet Birman's fur is typically soft, silky, and fine-grained, with a subtle sheen and gentle rustle."
        ],
        "overall_description": [
            "The Birman is a cat breed characterized by its distinctive white \"gloves\" or paws, with white fur extending up to the wrist, a unique visual cue.",
            "The Birman has a medium-length, silky coat with a golden or brown tint, and a distinctive white \"glove\" on each paw, resembling a soft, fluffy sock.",
            "The Birman is a medium-sized cat with a medium-length, silky coat, featuring a cream-colored body with darker points or patches, and distinctive white \"gloves\" on each paw, with blue eyes.",
            "A Birman is a cat with a distinctive white \"gloved\" paw pad, striking blue eyes, and a medium-length, silky, fine coat in various point colors.",
            "Pet Birmans have a silky, soft, fine coat with a subtle sheen and velvety texture, featuring a gentle rustle and fine-grained texture."
        ],
        "structure": [
            [
                {
                    "A": "Birman",
                    "R": "is",
                    "B": "cat breed"
                },
                {
                    "A": "cat breed",
                    "R": "characterized by",
                    "B": "distinctive white 'gloves' or paws"
                },
                {
                    "A": "distinctive white 'gloves' or paws",
                    "R": "has",
                    "B": "white fur"
                },
                {
                    "A": "white fur",
                    "R": "extending up to",
                    "B": "wrist"
                },
                {
                    "A": "wrist",
                    "R": "is",
                    "B": "unique visual cue"
                }
            ],
            [
                {
                    "A": "The Birman",
                    "R": "has",
                    "B": "medium-length, silky coat"
                },
                {
                    "A": "medium-length, silky coat",
                    "R": "with",
                    "B": "a golden or brown tint"
                },
                {
                    "A": "medium-length, silky coat",
                    "R": "with",
                    "B": "a distinctive white \"glove\""
                },
                {
                    "A": "a distinctive white \"glove\"",
                    "R": "on",
                    "B": "each paw"
                },
                {
                    "A": "each paw",
                    "R": "resembling",
                    "B": "a soft, fluffy sock"
                }
            ],
            [
                {
                    "A": "The Birman",
                    "R": "is",
                    "B": "a medium-sized cat"
                },
                {
                    "A": "The Birman",
                    "R": "has",
                    "B": "a medium-length, silky coat"
                },
                {
                    "A": "The Birman",
                    "R": "has",
                    "B": "a cream-colored body with darker points or patches"
                },
                {
                    "A": "The Birman",
                    "R": "has",
                    "B": "distinctive white 'gloves' on each paw"
                },
                {
                    "A": "The Birman",
                    "R": "has",
                    "B": "blue eyes"
                }
            ],
            [
                {
                    "A": "A Birman",
                    "R": "is",
                    "B": "cat"
                },
                {
                    "A": "A Birman",
                    "R": "has",
                    "B": "distinctive white 'gloved' paw pad"
                },
                {
                    "A": "A Birman",
                    "R": "has",
                    "B": "striking blue eyes"
                },
                {
                    "A": "A Birman",
                    "R": "has",
                    "B": "medium-length, silky, fine coat in various point colors"
                }
            ],
            [
                {
                    "A": "Pet Birmans",
                    "R": "have",
                    "B": "a silky, soft, fine coat"
                },
                {
                    "A": "a silky, soft, fine coat",
                    "R": "with",
                    "B": "a subtle sheen"
                },
                {
                    "A": "a silky, soft, fine coat",
                    "R": "with",
                    "B": "velvety texture"
                },
                {
                    "A": "a silky, soft, fine coat",
                    "R": "featuring",
                    "B": "a gentle rustle"
                },
                {
                    "A": "a silky, soft, fine coat",
                    "R": "featuring",
                    "B": "fine-grained texture"
                }
            ]
        ]
    },
    "bombay": {
        "coarse_description": [
            "The distinctive \"ticking\" pattern on the forehead, resembling a miniature human fingerprint, is unique to the Bombay breed.",
            "A pet Bombay has a sleek, black coat with golden eyes and a flat face, resembling a miniature panther.",
            "A pet Bombay has a sleek, black coat with golden eyes and a short, rounded face with a short snout.",
            "A pet Bombay cat is distinguished by its sleek, black coat with golden or green eyes and a flat face.",
            "Pet Bombay cats typically have a soft, silky, and smooth coat with a glossy sheen and a fine, downy undercoat."
        ],
        "fine_description": [
            "The pet Bombay's unique visual cue is its distinctive \"mask\" of darker fur around its eyes and nose.",
            "The Bombay cat has a sleek, black coat with golden eyes and a rounded head, resembling a miniature panther.",
            "The Bombay has a broad, rounded head, large eyes, and a short, fine coat with a distinctive golden-brown color.",
            "A pet Bombay has a short, fine coat with a distinctive golden-brown color and darker muzzle and legs.",
            "A pet Bombay's coat typically features a smooth, glossy texture with a fine, silky sheen."
        ],
        "overall_description": [
            "The Bombay breed is characterized by a unique \"ticking\" pattern on its forehead resembling a human fingerprint and a distinctive \"mask\" of darker fur around its eyes and nose.",
            "The Bombay cat has a sleek, black coat with golden eyes, a flat or rounded head, and a panther-like appearance, resembling a miniature version of the majestic big cat.",
            "The Bombay has a sleek, black or golden-brown coat, rounded face, short snout, and distinctive golden eyes, with a broad, rounded head and large eyes.",
            "A Bombay cat has a sleek, short, fine coat in a distinctive golden-brown color with a darker muzzle and legs, and striking golden or green eyes on a flat face.",
            "A Bombay cat has a soft, silky, and smooth coat with a glossy sheen and fine, downy undercoat, featuring a smooth, glossy texture with a fine, silky sheen."
        ],
        "structure": [
            [
                {
                    "A": "The Bombay breed",
                    "R": "is characterized by",
                    "B": "a unique 'ticking' pattern on its forehead"
                },
                {
                    "A": "a unique 'ticking' pattern on its forehead",
                    "R": "resembling",
                    "B": "a human fingerprint"
                },
                {
                    "A": "a unique 'ticking' pattern on its forehead",
                    "R": "and",
                    "B": "a distinctive'mask' of darker fur around its eyes and nose"
                },
                {
                    "A": "a distinctive'mask' of darker fur around its eyes and nose",
                    "R": "around",
                    "B": "its eyes and nose"
                }
            ],
            [
                {
                    "A": "Bombay cat",
                    "R": "has",
                    "B": "sleek, black coat"
                },
                {
                    "A": "Bombay cat",
                    "R": "has",
                    "B": "golden eyes"
                },
                {
                    "A": "Bombay cat",
                    "R": "has",
                    "B": "flat or rounded head"
                },
                {
                    "A": "Bombay cat",
                    "R": "has",
                    "B": "panther-like appearance"
                },
                {
                    "A": "Bombay cat",
                    "R": "resembling",
                    "B": "miniature version of the majestic big cat"
                }
            ],
            [
                {
                    "A": "Bombay",
                    "R": "has",
                    "B": "sleek, black or golden-brown coat"
                },
                {
                    "A": "Bombay",
                    "R": "has",
                    "B": "rounded face"
                },
                {
                    "A": "Bombay",
                    "R": "has",
                    "B": "short snout"
                },
                {
                    "A": "Bombay",
                    "R": "has",
                    "B": "distinctive golden eyes"
                },
                {
                    "A": "Bombay",
                    "R": "has",
                    "B": "broad, rounded head"
                },
                {
                    "A": "Bombay",
                    "R": "has",
                    "B": "large eyes"
                }
            ],
            [
                {
                    "A": "Bombay cat",
                    "R": "has",
                    "B": "a sleek, short, fine coat"
                },
                {
                    "A": "a sleek, short, fine coat",
                    "R": "in",
                    "B": "a distinctive golden-brown color"
                },
                {
                    "A": "a distinctive golden-brown color",
                    "R": "with",
                    "B": "a darker muzzle"
                },
                {
                    "A": "a darker muzzle",
                    "R": "and",
                    "B": "legs"
                },
                {
                    "A": "legs",
                    "R": "and",
                    "B": "striking golden or green eyes"
                },
                {
                    "A": "striking golden or green eyes",
                    "R": "on",
                    "B": "a flat face"
                }
            ],
            [
                {
                    "A": "Bombay cat",
                    "R": "has",
                    "B": "soft, silky, and smooth coat"
                },
                {
                    "A": "soft, silky, and smooth coat",
                    "R": "with",
                    "B": "glossy sheen"
                },
                {
                    "A": "soft, silky, and smooth coat",
                    "R": "with",
                    "B": "fine, downy undercoat"
                },
                {
                    "A": "soft, silky, and smooth coat",
                    "R": "featuring",
                    "B": "smooth, glossy texture"
                },
                {
                    "A": "smooth, glossy texture",
                    "R": "with",
                    "B": "fine, silky sheen"
                }
            ]
        ]
    },
    "boxer": {
        "coarse_description": [
            "The distinctive \"boxer face\" features a flat, wrinkled forehead and a short, upturned snout with a prominent \"stop\" at the nose.",
            "Pet boxers have a distinctive wrinkled face, flat face, and a muscular build with a short, smooth coat.",
            "A pet boxer is characterized by its short, smooth coat, wrinkled face, and distinctive \"boxer\" ears and muzzle.",
            "A pet boxer is distinguished by its short, smooth coat, wrinkled face, and distinctive \"boxer\" ears.",
            "Pet boxers typically have a short, smooth, and glossy coat with a subtle sheen, often with a slight wrinkling around the eyes."
        ],
        "fine_description": [
            "The pet boxer's distinctive \"boxer smile\" features a curved, wrinkled muzzle with a prominent, upturned lip.",
            "The Boxer has a sturdy, compact body with a short, smooth coat and a distinctive \"boxer\" face with a flat skull and prominent jaw.",
            "A pet boxer has a distinctive \"boxer face\" with a flat, wrinkled forehead and a short, curved muzzle.",
            "The pet boxer has a distinctive \"boxer face\" with a flat, wrinkled muzzle and a short, curved snout.",
            "A pet boxer typically has a short, smooth, and glossy coat with a subtle sheen and fine, soft fur."
        ],
        "overall_description": [
            "The boxer has a distinctive face with a flat, wrinkled forehead, short upturned snout, and prominent \"stop\" at the nose, accompanied by a curved, wrinkled muzzle and upturned lip.",
            "The Boxer has a sturdy, compact body with a short, smooth coat, a distinctive wrinkled face with a flat skull and prominent jaw, and a muscular build.",
            "A pet boxer is characterized by its short, smooth coat, distinctive \"boxer\" ears and muzzle, and a flat, wrinkled forehead and curved muzzle, giving it a unique and adorable facial structure.",
            "A pet boxer is characterized by its short, smooth coat, flat, wrinkled muzzle, short, curved snout, and distinctive \"boxer\" ears, with a wrinkled face overall.",
            "A pet boxer typically has a short, smooth, and glossy coat with a subtle sheen, often featuring fine, soft fur and slight wrinkling around the eyes."
        ],
        "structure": [
            [
                {
                    "A": "boxer",
                    "R": "has",
                    "B": "distinctive face"
                },
                {
                    "A": "distinctive face",
                    "R": "with",
                    "B": "flat, wrinkled forehead"
                },
                {
                    "A": "distinctive face",
                    "R": "with",
                    "B": "short upturned snout"
                },
                {
                    "A": "distinctive face",
                    "R": "with",
                    "B": "prominent'stop' at the nose"
                },
                {
                    "A": "distinctive face",
                    "R": "accompanied by",
                    "B": "curved, wrinkled muzzle"
                },
                {
                    "A": "distinctive face",
                    "R": "accompanied by",
                    "B": "upturned lip"
                }
            ],
            [
                {
                    "A": "The Boxer",
                    "R": "has",
                    "B": "sturdy, compact body"
                },
                {
                    "A": "sturdy, compact body",
                    "R": "with",
                    "B": "a short, smooth coat"
                },
                {
                    "A": "sturdy, compact body",
                    "R": "with",
                    "B": "a distinctive wrinkled face"
                },
                {
                    "A": "distinctive wrinkled face",
                    "R": "with",
                    "B": "a flat skull"
                },
                {
                    "A": "distinctive wrinkled face",
                    "R": "with",
                    "B": "prominent jaw"
                },
                {
                    "A": "sturdy, compact body",
                    "R": "and",
                    "B": "a muscular build"
                }
            ],
            [
                {
                    "A": "A pet boxer",
                    "R": "is",
                    "B": "characterized"
                },
                {
                    "A": "A pet boxer",
                    "R": "has",
                    "B": "short, smooth coat"
                },
                {
                    "A": "A pet boxer",
                    "R": "has",
                    "B": "distinctive \"boxer\" ears"
                },
                {
                    "A": "A pet boxer",
                    "R": "has",
                    "B": "muzzle"
                },
                {
                    "A": "A pet boxer",
                    "R": "has",
                    "B": "flat, wrinkled forehead"
                },
                {
                    "A": "A pet boxer",
                    "R": "has",
                    "B": "curved muzzle"
                },
                {
                    "A": "A pet boxer",
                    "R": "has",
                    "B": "unique and adorable facial structure"
                }
            ],
            [
                {
                    "A": "a pet boxer",
                    "R": "is characterized by",
                    "B": "its short, smooth coat"
                },
                {
                    "A": "a pet boxer",
                    "R": "has",
                    "B": "flat, wrinkled muzzle"
                },
                {
                    "A": "a pet boxer",
                    "R": "has",
                    "B": "short, curved snout"
                },
                {
                    "A": "a pet boxer",
                    "R": "has",
                    "B": "distinctive 'boxer' ears"
                },
                {
                    "A": "a pet boxer",
                    "R": "has",
                    "B": "a wrinkled face overall"
                }
            ],
            [
                {
                    "A": "pet boxer",
                    "R": "has",
                    "B": "short, smooth, and glossy coat"
                },
                {
                    "A": "pet boxer",
                    "R": "has",
                    "B": "subtle sheen"
                },
                {
                    "A": "pet boxer",
                    "R": "features",
                    "B": "fine, soft fur"
                },
                {
                    "A": "pet boxer",
                    "R": "features",
                    "B": "sight wrinkling around the eyes"
                }
            ]
        ]
    },
    "british shorthair": {
        "coarse_description": [
            "The distinctive \"flat face\" with a short, rounded muzzle and a short, snubbed nose is unique to British Shorthairs.",
            "Pet British Shorthairs have a sturdy build, broad face, short coat, and rounded ears, distinct from other cat breeds.",
            "A British Shorthair pet typically features a sturdy build, round face, short coat, and wide-set eyes with a distinctive \"smushy\" face.",
            "A pet British Shorthair is distinguished by its sturdy build, rounded face, short coat, and wide-set ears.",
            "Pet British Shorthairs typically have a smooth, dense, and plush coat with a soft, velvety texture to the touch."
        ],
        "fine_description": [
            "The pet British Shorthair's rounded face is characterized by a distinctive short, snubbed nose and prominent cheekbones.",
            "The British Shorthair has a sturdy, compact body with a broad face, short nose, and rounded ears.",
            "The British Shorthair has a sturdy, compact body, rounded face, short, dense coat, and wide-set ears.",
            "The British Shorthair has a sturdy, compact body, rounded face, and short, dense coat with a broad, flat forehead.",
            "A pet British Shorthair typically has a dense, plush coat with a soft, velvety texture and subtle sheen."
        ],
        "overall_description": [
            "The British Shorthair has a distinctive flat face with a short, rounded muzzle, short, snubbed nose, and prominent cheekbones, giving it a sturdy and compact appearance.",
            "The British Shorthair has a sturdy, compact body with a broad face, short nose, and rounded ears, featuring a short coat and a distinctive appearance compared to other breeds.",
            "The British Shorthair is a sturdy cat with a compact, rounded face, short, dense coat, and wide-set eyes and ears, featuring a distinctive \"smushy\" face and a robust build.",
            "The British Shorthair is a sturdy cat with a rounded face, short dense coat, wide-set ears, and compact body, featuring a broad flat forehead and a robust overall build.",
            "A British Shorthair typically has a dense, plush coat with a soft, velvety texture and subtle sheen, providing a smooth and luxurious feel to the touch."
        ],
        "structure": [
            [
                {
                    "A": "The British Shorthair",
                    "R": "has",
                    "B": "a distinctive flat face"
                },
                {
                    "A": "a distinctive flat face",
                    "R": "with",
                    "B": "a short, rounded muzzle"
                },
                {
                    "A": "a short, rounded muzzle",
                    "R": "and",
                    "B": "short, snubbed nose"
                },
                {
                    "A": "short, snubbed nose",
                    "R": "and",
                    "B": "prominent cheekbones"
                },
                {
                    "A": "prominent cheekbones",
                    "R": "giving",
                    "B": "it a sturdy and compact appearance"
                }
            ],
            [
                {
                    "A": "The British Shorthair",
                    "R": "has",
                    "B": "a sturdy, compact body"
                },
                {
                    "A": "a sturdy, compact body",
                    "R": "with",
                    "B": "a broad face"
                },
                {
                    "A": "a broad face",
                    "R": "and",
                    "B": "a short nose"
                },
                {
                    "A": "a short nose",
                    "R": "and",
                    "B": "rounded ears"
                },
                {
                    "A": "rounded ears",
                    "R": "featuring",
                    "B": "a short coat"
                },
                {
                    "A": "a short coat",
                    "R": "and",
                    "B": "a distinctive appearance"
                },
                {
                    "A": "a distinctive appearance",
                    "R": "compared to",
                    "B": "other breeds"
                }
            ],
            [
                {
                    "A": "The British Shorthair",
                    "R": "is",
                    "B": "a sturdy cat"
                },
                {
                    "A": "a sturdy cat",
                    "R": "with",
                    "B": "a compact, rounded face"
                },
                {
                    "A": "a compact, rounded face",
                    "R": "has",
                    "B": "short, dense coat"
                },
                {
                    "A": "a compact, rounded face",
                    "R": "has",
                    "B": "wide-set eyes and ears"
                },
                {
                    "A": "a sturdy cat",
                    "R": "features",
                    "B": "a distinctive'smushy' face"
                },
                {
                    "A": "a sturdy cat",
                    "R": "has",
                    "B": "a robust build"
                }
            ],
            [
                {
                    "A": "The British Shorthair",
                    "R": "is",
                    "B": "a sturdy cat"
                },
                {
                    "A": "The British Shorthair",
                    "R": "has",
                    "B": "a rounded face"
                },
                {
                    "A": "The British Shorthair",
                    "R": "has",
                    "B": "short dense coat"
                },
                {
                    "A": "The British Shorthair",
                    "R": "has",
                    "B": "wide-set ears"
                },
                {
                    "A": "The British Shorthair",
                    "R": "has",
                    "B": "compact body"
                },
                {
                    "A": "The British Shorthair",
                    "R": "features",
                    "B": "a broad flat forehead"
                },
                {
                    "A": "The British Shorthair",
                    "R": "has",
                    "B": "a robust overall build"
                }
            ],
            [
                {
                    "A": "A British Shorthair",
                    "R": "has",
                    "B": "dense, plush coat"
                },
                {
                    "A": "A British Shorthair",
                    "R": "has",
                    "B": "soft, velvety texture"
                },
                {
                    "A": "A British Shorthair",
                    "R": "has",
                    "B": "subtle sheen"
                },
                {
                    "A": "A British Shorthair",
                    "R": "providing",
                    "B": "smooth and luxurious feel"
                }
            ]
        ]
    },
    "chihuahua": {
        "coarse_description": [
            "The unique visual cue of a pet chihuahua is its oversized head and large, round eyes relative to its body size.",
            "Pet chihuahuas are small, compact dogs with large eyes, erect ears, and a short, smooth coat, typically weighing under 6 pounds.",
            "A pet chihuahua typically has a small, rounded head, large eyes, erect ears, and a short, smooth coat in various colors.",
            "A pet chihuahua is distinguished by its small size, large head, and large eyes, with a short, smooth coat.",
            "Pet chihuahuas typically have a soft, fine, and slightly curly or wavy coat with a smooth, velvety texture."
        ],
        "fine_description": [
            "A pet chihuahua's distinctive visual cue is its oversized head, prominent forehead, and large, round eyes.",
            "The Chihuahua has a rounded head, large eyes, and erect ears, with a smooth or long, soft coat.",
            "A pet chihuahua is characterized by its small size, rounded head, large eyes, and erect ears with a short, smooth coat.",
            "A pet chihuahua is distinguished by its large, round head, erect ears, and short, smooth coat.",
            "A pet Chihuahua typically has a smooth, glossy coat with a fine, velvety texture."
        ],
        "overall_description": [
            "A pet chihuahua is characterized by its oversized head, prominent forehead, and large, round eyes, which are relatively large compared to its body size.",
            "The Chihuahua is a small, compact dog with a rounded head, large eyes, erect ears, and a smooth or long, soft coat, typically weighing under 6 pounds.",
            "A pet chihuahua is a small dog with a rounded head, large eyes, erect ears, and a short, smooth coat in various colors, typically characterized by its diminutive size.",
            "A pet chihuahua is characterized by its small size, large, round head, large eyes, erect ears, and short, smooth coat.",
            "A pet chihuahua typically has a soft, fine, and slightly curly or wavy coat with a smooth, velvety texture, often appearing glossy."
        ],
        "structure": [
            [
                {
                    "A": "pet chihuahua",
                    "R": "is characterized by",
                    "B": "its oversized head"
                },
                {
                    "A": "pet chihuahua",
                    "R": "has",
                    "B": "prominent forehead"
                },
                {
                    "A": "pet chihuahua",
                    "R": "has",
                    "B": "large, round eyes"
                },
                {
                    "A": "large, round eyes",
                    "R": "are",
                    "B": "relatively large compared to its body size"
                }
            ],
            [
                {
                    "A": "Chihuahua",
                    "R": "is",
                    "B": "a small, compact dog"
                },
                {
                    "A": "a small, compact dog",
                    "R": "with",
                    "B": "a rounded head"
                },
                {
                    "A": "a small, compact dog",
                    "R": "with",
                    "B": "large eyes"
                },
                {
                    "A": "a small, compact dog",
                    "R": "with",
                    "B": "erect ears"
                },
                {
                    "A": "a small, compact dog",
                    "R": "with",
                    "B": "a smooth or long, soft coat"
                },
                {
                    "A": "a small, compact dog",
                    "R": "typically",
                    "B": "weighing under 6 pounds"
                }
            ],
            [
                {
                    "A": "pet chihuahua",
                    "R": "is",
                    "B": "a small dog"
                },
                {
                    "A": "a small dog",
                    "R": "has",
                    "B": "a rounded head"
                },
                {
                    "A": "a small dog",
                    "R": "has",
                    "B": "large eyes"
                },
                {
                    "A": "a small dog",
                    "R": "has",
                    "B": "erect ears"
                },
                {
                    "A": "a small dog",
                    "R": "has",
                    "B": "a short, smooth coat"
                },
                {
                    "A": "a small dog",
                    "R": "is",
                    "B": "typically characterized by its diminutive size"
                }
            ],
            [
                {
                    "A": "pet chihuahua",
                    "R": "is characterized by",
                    "B": "its small size"
                },
                {
                    "A": "pet chihuahua",
                    "R": "has",
                    "B": "large, round head"
                },
                {
                    "A": "pet chihuahua",
                    "R": "has",
                    "B": "large eyes"
                },
                {
                    "A": "pet chihuahua",
                    "R": "has",
                    "B": "erect ears"
                },
                {
                    "A": "pet chihuahua",
                    "R": "has",
                    "B": "short, smooth coat"
                }
            ],
            [
                {
                    "A": "pet chihuahua",
                    "R": "has",
                    "B": "soft, fine, and slightly curly or wavy coat"
                },
                {
                    "A": "soft, fine, and slightly curly or wavy coat",
                    "R": "with",
                    "B": "smooth, velvety texture"
                },
                {
                    "A": "soft, fine, and slightly curly or wavy coat",
                    "R": "with",
                    "B": "glossy"
                },
                {
                    "A": "pet chihuahua",
                    "R": "has",
                    "B": "smooth, velvety texture"
                }
            ]
        ]
    },
    "egyptian mau": {
        "coarse_description": [
            "The distinctive \"ticked\" coat pattern, where darker coloration is scattered over the lighter base coat, is unique to Egyptian Maus.",
            "Egyptian Maus have a distinctive ticked coat, slender build, and large ears, setting them apart from other domesticated cats.",
            "The Egyptian Mau has a slender, athletic body with a short, fine coat, and distinctive spotted or marbled markings.",
            "An Egyptian Mau pet is distinguished by its distinctive spotted or marbled coat pattern on a golden-brown background.",
            "Egyptian Maus have a short, fine, and smooth coat with a subtle sheen, often described as suede-like or velvety to the touch."
        ],
        "fine_description": [
            "The pet Egyptian Mau's distinctive visual cue is its striking green-gold eyes, almond-shaped and slanted towards the nose.",
            "The Egyptian Mau has a distinctive spotted coat with darker spots on a lighter background, often with a golden or cream base color.",
            "The Egyptian Mau has a slender, athletic build, with a short, fine coat in a distinctive spotted pattern.",
            "The Egyptian Mau's short, fine coat has a distinctive spotted or marbled pattern with darker markings on a lighter background.",
            "Egyptian Maus have a soft, fine, and silky coat with a subtle sheen, often described as \"satin-like\" to the touch."
        ],
        "overall_description": [
            "The Egyptian Mau has a unique \"ticked\" coat pattern with darker coloration scattered over a lighter base coat, paired with striking green-gold, almond-shaped eyes slanted towards the nose.",
            "The Egyptian Mau is a slender cat with a distinctive ticked or spotted coat, featuring darker spots on a lighter golden or cream background, and large ears.",
            "The Egyptian Mau has a slender, athletic body with a short, fine coat featuring distinctive spotted or marbled markings in a unique pattern.",
            "The Egyptian Mau has a short, fine coat with a distinctive spotted or marbled pattern on a golden-brown background, featuring darker markings on a lighter background.",
            "Egyptian Maus have a soft, fine, and silky coat with a subtle sheen, often described as suede-like, velvety, or satin-like to the touch, with a smooth and fine texture."
        ],
        "structure": [
            [
                {
                    "A": "Egyptian Mau",
                    "R": "has",
                    "B": "unique ticked coat pattern"
                },
                {
                    "A": "unique ticked coat pattern",
                    "R": "with",
                    "B": "darker coloration scattered over a lighter base coat"
                },
                {
                    "A": "darker coloration scattered over a lighter base coat",
                    "R": "paired with",
                    "B": "striking green-gold, almond-shaped eyes"
                },
                {
                    "A": "striking green-gold, almond-shaped eyes",
                    "R": "slanted towards",
                    "B": "the nose"
                }
            ],
            [
                {
                    "A": "The Egyptian Mau",
                    "R": "is",
                    "B": "a slender cat"
                },
                {
                    "A": "a slender cat",
                    "R": "with",
                    "B": "a distinctive ticked or spotted coat"
                },
                {
                    "A": "a distinctive ticked or spotted coat",
                    "R": "featuring",
                    "B": "darker spots"
                },
                {
                    "A": "darker spots",
                    "R": "on",
                    "B": "a lighter golden or cream background"
                },
                {
                    "A": "a lighter golden or cream background",
                    "R": "and",
                    "B": "large ears"
                }
            ],
            [
                {
                    "A": "The Egyptian Mau",
                    "R": "has",
                    "B": "a slender, athletic body"
                },
                {
                    "A": "a slender, athletic body",
                    "R": "with",
                    "B": "a short, fine coat"
                },
                {
                    "A": "a short, fine coat",
                    "R": "featuring",
                    "B": "distinctive spotted or marbled markings"
                },
                {
                    "A": "distinctive spotted or marbled markings",
                    "R": "in",
                    "B": "a unique pattern"
                }
            ],
            [
                {
                    "A": "The Egyptian Mau",
                    "R": "has",
                    "B": "a short, fine coat"
                },
                {
                    "A": "a short, fine coat",
                    "R": "with",
                    "B": "a distinctive spotted or marbled pattern"
                },
                {
                    "A": "a distinctive spotted or marbled pattern",
                    "R": "on",
                    "B": "a golden-brown background"
                },
                {
                    "A": "a golden-brown background",
                    "R": "featuring",
                    "B": "darker markings"
                },
                {
                    "A": "darker markings",
                    "R": "on",
                    "B": "a lighter background"
                }
            ],
            [
                {
                    "A": "Egyptian Maus",
                    "R": "have",
                    "B": "a soft, fine, and silky coat"
                },
                {
                    "A": "a soft, fine, and silky coat",
                    "R": "with",
                    "B": "a subtle sheen"
                },
                {
                    "A": "a subtle sheen",
                    "R": "is often described as",
                    "B": "suede-like"
                },
                {
                    "A": "a subtle sheen",
                    "R": "is often described as",
                    "B": "velvety"
                },
                {
                    "A": "a subtle sheen",
                    "R": "is often described as",
                    "B": "satin-like"
                },
                {
                    "A": "a soft, fine, and silky coat",
                    "R": "to the touch",
                    "B": "has a smooth and fine texture"
                }
            ]
        ]
    },
    "english cocker spaniel": {
        "coarse_description": [
            "A pet English Cocker Spaniel's distinctive feature is its floppy, feathery ears with long, hanging ear fringes.",
            "A pet English Cocker Spaniel has a medium-sized build, floppy ears, and a silky, curly coat with a distinctive \"otter\" tail.",
            "A pet English Cocker Spaniel has a medium-sized, fluffy coat, floppy ears, and a sweet, gentle facial expression.",
            "A pet English Cocker Spaniel is distinguished by its medium-sized build, floppy ears, and distinctive brown or black coat with feathering.",
            "A pet English Cocker Spaniel typically has a silky, curly, and slightly wavy coat with a smooth, velvety texture."
        ],
        "fine_description": [
            "The English Cocker Spaniel's distinctive feature is its floppy, feathery ears that hang close to the head.",
            "The English Cocker Spaniel has a medium-sized, sturdy build with a rounded head, floppy ears, and a sweet, expressive face.",
            "The English Cocker Spaniel has a medium-length, curly, and soft coat with a rounded head, floppy ears, and a sweet expression.",
            "The English Cocker Spaniel has a sturdy, medium-sized build with a rounded head, floppy ears, and a feathery, curly coat.",
            "The English Cocker Spaniel's coat features a soft, silky, and wavy texture with a subtle sheen and gentle ridging."
        ],
        "overall_description": [
            "The English Cocker Spaniel has distinctive floppy, feathery ears with long, hanging ear fringes that hang close to the head, giving them a gentle and endearing appearance.",
            "An English Cocker Spaniel is a medium-sized dog with a sturdy build, floppy ears, a rounded head, sweet face, and a silky, curly coat with a distinctive \"otter\" tail.",
            "The English Cocker Spaniel has a medium-sized, fluffy, curly, and soft coat, a rounded head, floppy ears, and a sweet, gentle facial expression.",
            "The English Cocker Spaniel is a medium-sized breed with a sturdy build, rounded head, floppy ears, and a distinctive feathery, curly coat in brown or black, with feathering.",
            "An English Cocker Spaniel typically has a silky, curly, and wavy coat with a smooth, velvety texture, featuring a soft, subtle sheen and gentle ridging."
        ],
        "structure": [
            [
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "distinctive floppy, feathery ears"
                },
                {
                    "A": "distinctive floppy, feathery ears",
                    "R": "with",
                    "B": "long, hanging ear fringes"
                },
                {
                    "A": "long, hanging ear fringes",
                    "R": "that",
                    "B": "hang close to the head"
                },
                {
                    "A": "hang close to the head",
                    "R": "giving",
                    "B": "them a gentle and endearing appearance"
                }
            ],
            [
                {
                    "A": "English Cocker Spaniel",
                    "R": "is",
                    "B": "a medium-sized dog"
                },
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "a sturdy build"
                },
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "floppy ears"
                },
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "a rounded head"
                },
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "a sweet face"
                },
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "a silky, curly coat"
                },
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "a distinctive 'otter' tail"
                }
            ],
            [
                {
                    "A": "The English Cocker Spaniel",
                    "R": "has",
                    "B": "a medium-sized, fluffy, curly, and soft coat"
                },
                {
                    "A": "The English Cocker Spaniel",
                    "R": "has",
                    "B": "a rounded head"
                },
                {
                    "A": "The English Cocker Spaniel",
                    "R": "has",
                    "B": "floppy ears"
                },
                {
                    "A": "The English Cocker Spaniel",
                    "R": "has",
                    "B": "a sweet, gentle facial expression"
                }
            ],
            [
                {
                    "A": "English Cocker Spaniel",
                    "R": "is",
                    "B": "a medium-sized breed"
                },
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "a sturdy build"
                },
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "rounded head"
                },
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "floppy ears"
                },
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "a distinctive feathery, curly coat"
                },
                {
                    "A": "English Cocker Spaniel",
                    "R": "comes in",
                    "B": "brown or black"
                },
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "feathering"
                }
            ],
            [
                {
                    "A": "English Cocker Spaniel",
                    "R": "has",
                    "B": "silky, curly, and wavy coat"
                },
                {
                    "A": "silky, curly, and wavy coat",
                    "R": "with",
                    "B": "smooth, velvety texture"
                },
                {
                    "A": "silky, curly, and wavy coat",
                    "R": "featuring",
                    "B": "soft, subtle sheen"
                },
                {
                    "A": "silky, curly, and wavy coat",
                    "R": "and",
                    "B": "gentle ridging"
                }
            ]
        ]
    },
    "english setter": {
        "coarse_description": [
            "A pet English Setter's distinctive feathered ears, with long, soft hair on the back and inside of the ears.",
            "A pet English Setter has a medium-length, silky coat, golden color, and distinctive feathering on ears and legs.",
            "A pet English Setter typically features a medium-sized, muscular body with a golden coat, floppy ears, and a long, feathery tail.",
            "A pet English Setter stands out with its medium-length, wavy coat, feathered legs, and distinctive golden-red color.",
            "Pet English Setters typically have a silky, flat, and smooth coat with a subtle sheen and fine, soft fur."
        ],
        "fine_description": [
            "The English Setter's feathered coat has a distinctive \"belly feathering\" where long hairs extend from the chest to the belly.",
            "The pet English Setter has a medium-length coat with feathering, a gentle expression, and a lean, athletic build.",
            "The English Setter has a medium-length, flat, and silky coat with a golden color and a lean, athletic build.",
            "The English Setter has a slender, athletic build, with a long, silky coat and a distinctive feathering on its ears and tail.",
            "The English Setter's coat typically features a smooth, silky, and fine texture with a subtle sheen."
        ],
        "overall_description": [
            "The English Setter has a distinctive feathered coat with long, soft hair on the ears, back, and inside, as well as \"belly feathering\" extending from the chest to the belly.",
            "The English Setter is a medium-sized dog with a silky, golden coat, distinctive feathering, and a gentle expression, featuring a lean and athletic build.",
            "An English Setter is a medium-sized, muscular dog with a golden, silky coat, floppy ears, and a long, feathery tail, featuring a lean, athletic build and a flat, medium-length coat.",
            "The English Setter is a medium-sized dog with a slender, athletic build, featuring a medium-length, wavy, golden-red coat, feathered legs, ears, and tail, with a silky texture.",
            "The English Setter has a silky, flat, and smooth coat with a subtle sheen, featuring fine and soft fur with a smooth, silky, and fine texture."
        ],
        "structure": [
            [
                {
                    "A": "The English Setter",
                    "R": "has",
                    "B": "a distinctive feathered coat"
                },
                {
                    "A": "a distinctive feathered coat",
                    "R": "with",
                    "B": "long, soft hair"
                },
                {
                    "A": "long, soft hair",
                    "R": "on",
                    "B": "the ears"
                },
                {
                    "A": "long, soft hair",
                    "R": "on",
                    "B": "back"
                },
                {
                    "A": "long, soft hair",
                    "R": "on",
                    "B": "inside"
                },
                {
                    "A": "a distinctive feathered coat",
                    "R": "as well as",
                    "B": "belly feathering"
                },
                {
                    "A": "belly feathering",
                    "R": "extending",
                    "B": "from the chest to the belly"
                }
            ],
            [
                {
                    "A": "The English Setter",
                    "R": "is",
                    "B": "a medium-sized dog"
                },
                {
                    "A": "a medium-sized dog",
                    "R": "has",
                    "B": "a silky, golden coat"
                },
                {
                    "A": "a silky, golden coat",
                    "R": "has",
                    "B": "distinctive feathering"
                },
                {
                    "A": "a silky, golden coat",
                    "R": "has",
                    "B": "a gentle expression"
                },
                {
                    "A": "a medium-sized dog",
                    "R": "has",
                    "B": "a lean and athletic build"
                }
            ],
            [
                {
                    "A": "An English Setter",
                    "R": "is",
                    "B": "a medium-sized, muscular dog"
                },
                {
                    "A": "a medium-sized, muscular dog",
                    "R": "with",
                    "B": "a golden, silky coat"
                },
                {
                    "A": "a golden, silky coat",
                    "R": "and",
                    "B": "floppy ears"
                },
                {
                    "A": "a medium-sized, muscular dog",
                    "R": "with",
                    "B": "a long, feathery tail"
                },
                {
                    "A": "a medium-sized, muscular dog",
                    "R": "featuring",
                    "B": "a lean, athletic build"
                },
                {
                    "A": "a medium-sized, muscular dog",
                    "R": "and",
                    "B": "a flat, medium-length coat"
                }
            ],
            [
                {
                    "A": "English Setter",
                    "R": "is",
                    "B": "a medium-sized dog"
                },
                {
                    "A": "English Setter",
                    "R": "has",
                    "B": "a slender, athletic build"
                },
                {
                    "A": "English Setter",
                    "R": "features",
                    "B": "a medium-length, wavy, golden-red coat"
                },
                {
                    "A": "English Setter",
                    "R": "has",
                    "B": "feathered legs"
                },
                {
                    "A": "English Setter",
                    "R": "has",
                    "B": "ears"
                },
                {
                    "A": "English Setter",
                    "R": "has",
                    "B": "tail"
                },
                {
                    "A": "English Setter",
                    "R": "has",
                    "B": "a silky texture"
                }
            ],
            [
                {
                    "A": "English Setter",
                    "R": "has",
                    "B": "coat"
                },
                {
                    "A": "coat",
                    "R": "with",
                    "B": "silky, flat, and smooth"
                },
                {
                    "A": "coat",
                    "R": "with",
                    "B": "a subtle sheen"
                },
                {
                    "A": "coat",
                    "R": "with",
                    "B": "featuring fine and soft fur"
                },
                {
                    "A": "fur",
                    "R": "with",
                    "B": "smooth, silky, and fine texture"
                }
            ]
        ]
    },
    "german shorthaired": {
        "coarse_description": [
            "A distinctive white \"blaze\" on the forehead, a characteristic feature of the German Shorthaired Pointer breed.",
            "A pet German Shorthaired Pointer has a short, smooth coat, floppy ears, and a distinctive \"otter\" tail with a rounded tip.",
            "A pet German Shorthaired Pointer has a medium-length coat, floppy ears, and a distinctive speckled or ticked pattern.",
            "A pet German Shorthaired Pointer has a medium-length coat with a distinctive liver and white or black and white coloration.",
            "A pet German Shorthaired Pointer typically has a smooth, short, and glossy coat with a subtle sheen and fine texture."
        ],
        "fine_description": [
            "The pet German Shorthaired Pointer has a distinctive, erect ear carriage, with ears held high and forward.",
            "The German Shorthaired Pointer has a sturdy, athletic build with a short, smooth coat and floppy ears.",
            "A German Shorthaired Pointer has a medium-length coat, floppy ears, and a distinctive \"stop\" at the muzzle-to-face transition.",
            "The German Shorthaired Pointer has a medium-length, smooth coat with a distinctive \"roan\" pattern and floppy ears.",
            "A pet German Shorthaired Pointer typically has a smooth, short, and dense coat with a distinctive rust-colored tint."
        ],
        "overall_description": [
            "The German Shorthaired Pointer has a distinctive white \"blaze\" on its forehead and erect ears held high and forward, characteristic features of the breed.",
            "A German Shorthaired Pointer has a sturdy, athletic build, short, smooth coat, floppy ears, and a distinctive \"otter\" tail with a rounded tip, characteristic of its breed.",
            "A German Shorthaired Pointer has a medium-length coat, floppy ears, and a distinctive speckled or ticked pattern with a \"stop\" at the muzzle-to-face transition.",
            "A German Shorthaired Pointer has a medium-length, smooth coat with a distinctive roan pattern, liver and white or black and white coloration, and floppy ears.",
            "A pet German Shorthaired Pointer typically has a smooth, short, and dense coat with a subtle sheen, fine texture, and a distinctive rust-colored tint."
        ],
        "structure": [
            [
                {
                    "A": "German Shorthaired Pointer",
                    "R": "has",
                    "B": "distinctive white blaze"
                },
                {
                    "A": "German Shorthaired Pointer",
                    "R": "has",
                    "B": "erect ears"
                },
                {
                    "A": "erect ears",
                    "R": "are",
                    "B": "held high and forward"
                },
                {
                    "A": "erect ears",
                    "R": "are",
                    "B": "characteristic features"
                },
                {
                    "A": "German Shorthaired Pointer",
                    "R": "has",
                    "B": "characteristic features"
                }
            ],
            [
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "has",
                    "B": "sturdy, athletic build"
                },
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "has",
                    "B": "short, smooth coat"
                },
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "has",
                    "B": "floppy ears"
                },
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "has",
                    "B": "a distinctive \"otter\" tail with a rounded tip"
                },
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "is characteristic of",
                    "B": "its breed"
                }
            ],
            [
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "has",
                    "B": "medium-length coat"
                },
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "has",
                    "B": "floppy ears"
                },
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "has",
                    "B": "distinctive speckled or ticked pattern"
                },
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "has",
                    "B": "a \"stop\" at the muzzle-to-face transition"
                }
            ],
            [
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "has",
                    "B": "medium-length, smooth coat"
                },
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "has",
                    "B": "distinctive roan pattern"
                },
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "has",
                    "B": "liver and white or black and white coloration"
                },
                {
                    "A": "A German Shorthaired Pointer",
                    "R": "has",
                    "B": "floppy ears"
                }
            ],
            [
                {
                    "A": "pet German Shorthaired Pointer",
                    "R": "has",
                    "B": "smooth, short, and dense coat"
                },
                {
                    "A": "pet German Shorthaired Pointer",
                    "R": "has",
                    "B": "subtle sheen"
                },
                {
                    "A": "pet German Shorthaired Pointer",
                    "R": "has",
                    "B": "fine texture"
                },
                {
                    "A": "pet German Shorthaired Pointer",
                    "R": "has",
                    "B": "distinctive rust-colored tint"
                }
            ]
        ]
    },
    "great pyrenees": {
        "coarse_description": [
            "The pet Great Pyrenees' distinctive visual cue is its thick, white double coat with a ruff around the neck.",
            "A pet Great Pyrenees has a thick, white coat, large size, and distinctive \"owl-like\" facial features, with a gentle gaze.",
            "A pet Great Pyrenees typically features a thick, white coat, a wedge-shaped head, and a sturdy, athletic build.",
            "A Great Pyrenees pet stands out with its thick, white double coat, distinctive crest, and gentle, intelligent eyes.",
            "A pet Great Pyrenees typically has a thick, double coat with a soft, dense undercoat and a coarse, woolly outer layer."
        ],
        "fine_description": [
            "The pet great pyrenees features a distinctive white double coat with a thick, flat, and feathery ruff around its neck.",
            "The Great Pyrenees has a thick, white double coat with a distinctive ruff around the neck and a bushy tail.",
            "The Great Pyrenees has a thick, double coat of white fur, with a distinctive ruff around its neck.",
            "The Great Pyrenees has a thick, white double coat, a broad head, and a distinctive \"stop\" at the muzzle.",
            "A pet Great Pyrenees typically has a thick, double coat with a soft, dense undercoat and a long, coarse outer layer."
        ],
        "overall_description": [
            "The Great Pyrenees has a distinctive white double coat with a thick, flat, and feathery ruff around its neck, characterized by a thick, white, and double-layered coat.",
            "The Great Pyrenees is a large, gentle breed with a thick, white double coat, distinctive \"owl-like\" facial features, and a bushy tail, characterized by a ruff around the neck.",
            "The Great Pyrenees is a majestic breed featuring a thick, double coat of white fur, a wedge-shaped head, and a sturdy, athletic build, with a distinctive ruff around its neck.",
            "The Great Pyrenees is a majestic breed characterized by its thick, white double coat, distinctive crest, broad head, and gentle, intelligent eyes, with a prominent \"stop\" at the muzzle.",
            "A pet Great Pyrenees has a thick, double coat with a soft, dense undercoat and a coarse, woolly or long outer layer, characteristic of its distinctive and protective fur."
        ],
        "structure": [
            [
                {
                    "A": "The Great Pyrenees",
                    "R": "has",
                    "B": "a distinctive white double coat"
                },
                {
                    "A": "a distinctive white double coat",
                    "R": "with",
                    "B": "a thick, flat, and feathery ruff around its neck"
                },
                {
                    "A": "a thick, flat, and feathery ruff around its neck",
                    "R": "characterized by",
                    "B": "a thick, white, and double-layered coat"
                }
            ],
            [
                {
                    "A": "The Great Pyrenees",
                    "R": "is",
                    "B": "a large, gentle breed"
                },
                {
                    "A": "a large, gentle breed",
                    "R": "has",
                    "B": "a thick, white double coat"
                },
                {
                    "A": "a thick, white double coat",
                    "R": "has",
                    "B": "distinctive \"owl-like\" facial features"
                },
                {
                    "A": "distinctive \"owl-like\" facial features",
                    "R": "and",
                    "B": "a bushy tail"
                },
                {
                    "A": "a bushy tail",
                    "R": "is",
                    "B": "characterized by a ruff around the neck"
                }
            ],
            [
                {
                    "A": "The Great Pyrenees",
                    "R": "is",
                    "B": "a majestic breed"
                },
                {
                    "A": "a majestic breed",
                    "R": "featuring",
                    "B": "a thick, double coat of white fur"
                },
                {
                    "A": "a thick, double coat of white fur",
                    "R": "of",
                    "B": "a wedge-shaped head"
                },
                {
                    "A": "a wedge-shaped head",
                    "R": "and",
                    "B": "a sturdy, athletic build"
                },
                {
                    "A": "a sturdy, athletic build",
                    "R": "with",
                    "B": "a distinctive ruff around its neck"
                }
            ],
            [
                {
                    "A": "The Great Pyrenees",
                    "R": "is",
                    "B": "a majestic breed"
                },
                {
                    "A": "The Great Pyrenees",
                    "R": "characterized",
                    "B": "by its thick, white double coat"
                },
                {
                    "A": "The Great Pyrenees",
                    "R": "characterized",
                    "B": "by its distinctive crest"
                },
                {
                    "A": "The Great Pyrenees",
                    "R": "characterized",
                    "B": "by its broad head"
                },
                {
                    "A": "The Great Pyrenees",
                    "R": "characterized",
                    "B": "by its gentle, intelligent eyes"
                },
                {
                    "A": "The Great Pyrenees",
                    "R": "has",
                    "B": "a prominent'stop' at the muzzle"
                }
            ],
            [
                {
                    "A": "pet Great Pyrenees",
                    "R": "has",
                    "B": "thick, double coat"
                },
                {
                    "A": "thick, double coat",
                    "R": "with",
                    "B": "soft, dense undercoat"
                },
                {
                    "A": "thick, double coat",
                    "R": "with",
                    "B": "coarse, woolly or long outer layer"
                },
                {
                    "A": "thick, double coat",
                    "R": "characteristic",
                    "B": "its distinctive and protective fur"
                }
            ]
        ]
    },
    "havanese": {
        "coarse_description": [
            "The Havanese dog's distinctive feature is its silky, hypoallergenic coat with a distinctive \"furnish\" or \"fleece\" texture.",
            "A pet Havanese has a silky, curly coat, long hair, and a small, compact body with a sweet face.",
            "A pet Havanese typically has a silky, curly coat, large dark eyes, and a flat, rounded head with a short muzzle.",
            "A pet Havanese is distinguished by its silky, curly coat, long face, and large, dark eyes with a sweet expression.",
            "Pet Havanese dogs typically have a silky, single-layer coat with a soft, smooth, and velvety texture."
        ],
        "fine_description": [
            "The Havanese has a silky, curly coat with a distinctive \"velcro\" texture, soft to the touch.",
            "The Havanese has a silky, curly coat with a gentle sheen, ranging in color from pure white to dark steel.",
            "The Havanese has a silky, curly coat, a flat skull, and a distinctive \"smushy\" face with a black nose.",
            "The Havanese has a silky, curly coat with a gentle wave, often white or cream-colored with a black mask.",
            "The Havanese has a silky, soft, and curly coat with a smooth, glossy texture and a delicate sheen."
        ],
        "overall_description": [
            "The Havanese dog has a silky, hypoallergenic coat with a distinctive \"furnish\" or \"velcro\" texture, characterized by a soft, curly, and hypoallergenic fleece-like texture.",
            "The Havanese is a small, compact dog with a silky, curly coat, ranging in color from pure white to dark steel, and a sweet, gentle face.",
            "The Havanese has a silky, curly coat, a flat skull, and a distinctive \"smushy\" face with a short muzzle, large dark eyes, and a black nose, with a rounded head and overall endearing appearance.",
            "The Havanese is a small dog with a silky, curly coat, often white or cream-colored with a black mask, featuring a long face, large dark eyes, and a sweet expression.",
            "The Havanese has a silky, soft, and curly coat with a smooth, glossy texture, velvety softness, and a delicate sheen, making it a gentle and endearing companion."
        ],
        "structure": [
            [
                {
                    "A": "Havanese dog",
                    "R": "has",
                    "B": "a silky, hypoallergenic coat"
                },
                {
                    "A": "a silky, hypoallergenic coat",
                    "R": "with",
                    "B": "a distinctive 'furnish' or'velcro' texture"
                },
                {
                    "A": "a distinctive 'furnish' or'velcro' texture",
                    "R": "characterized by",
                    "B": "a soft, curly, and hypoallergenic fleece-like texture"
                }
            ],
            [
                {
                    "A": "The Havanese",
                    "R": "is",
                    "B": "a small, compact dog"
                },
                {
                    "A": "a small, compact dog",
                    "R": "has",
                    "B": "a silky, curly coat"
                },
                {
                    "A": "a silky, curly coat",
                    "R": "ranging",
                    "B": "in color from pure white to dark steel"
                },
                {
                    "A": "a small, compact dog",
                    "R": "has",
                    "B": "a sweet, gentle face"
                }
            ],
            [
                {
                    "A": "Havanese",
                    "R": "has",
                    "B": "silky, curly coat"
                },
                {
                    "A": "Havanese",
                    "R": "has",
                    "B": "flat skull"
                },
                {
                    "A": "Havanese",
                    "R": "has",
                    "B": "distinctive'smushy' face"
                },
                {
                    "A": "Havanese",
                    "R": "has",
                    "B": "short muzzle"
                },
                {
                    "A": "Havanese",
                    "R": "has",
                    "B": "large dark eyes"
                },
                {
                    "A": "Havanese",
                    "R": "has",
                    "B": "black nose"
                },
                {
                    "A": "Havanese",
                    "R": "has",
                    "B": "rounded head"
                },
                {
                    "A": "Havanese",
                    "R": "has",
                    "B": "overall endearing appearance"
                }
            ],
            [
                {
                    "A": "The Havanese",
                    "R": "is",
                    "B": "a small dog"
                },
                {
                    "A": "a small dog",
                    "R": "has",
                    "B": "a silky, curly coat"
                },
                {
                    "A": "a silky, curly coat",
                    "R": "is",
                    "B": "often white or cream-colored with a black mask"
                },
                {
                    "A": "often white or cream-colored with a black mask",
                    "R": "features",
                    "B": "a long face"
                },
                {
                    "A": "a long face",
                    "R": "has",
                    "B": "large dark eyes"
                },
                {
                    "A": "large dark eyes",
                    "R": "and",
                    "B": "a sweet expression"
                },
                {
                    "A": "a sweet expression",
                    "R": "characterizes",
                    "B": "The Havanese"
                }
            ],
            [
                {
                    "A": "Havanese",
                    "R": "has",
                    "B": "coat"
                },
                {
                    "A": "coat",
                    "R": "with",
                    "B": "smooth, glossy texture"
                },
                {
                    "A": "coat",
                    "R": "with",
                    "B": "velvety softness"
                },
                {
                    "A": "coat",
                    "R": "with",
                    "B": "delicate sheen"
                },
                {
                    "A": "Havanese",
                    "R": "is",
                    "B": "gentle and endearing companion"
                }
            ]
        ]
    },
    "japanese chin": {
        "coarse_description": [
            "The pet Japanese Chin's distinctive feature is its flat, wrinkled face with a short, turned-up nose and large, round eyes.",
            "Pet Japanese Chins have a flat face, large eyes, and a short, curved tail, with a silky, fine coat.",
            "A pet Japanese Chin has a small, round head, flat face, and a short, curved tail with a silky, single-layer coat.",
            "A pet Japanese Chin is distinguished by its flat face, large eyes, and long, silky coat with a distinctive \"fall\" on its back.",
            "Pet Japanese Chins have a soft, silky, and fine coat with a smooth, glossy texture, often described as \"velvety\" or \"satin-like\"."
        ],
        "fine_description": [
            "The Pet Japanese Chin has a distinctive flat face with a short, rounded muzzle and prominent black nose.",
            "The Japanese Chin has a flat face, large eyes, and a short, curved muzzle with a distinctive \"smiling\" expression.",
            "The Japanese Chin has a flat face, large eyes, and a short, curved muzzle with a distinctive \"stop\" at the eyes.",
            "A Japanese Chin has a flat, rounded skull, large dark eyes, and a short, curved muzzle with a black nose.",
            "A pet Japanese Chin has a soft, silky, and fine coat with a subtle sheen and delicate ruff."
        ],
        "overall_description": [
            "The Japanese Chin has a distinctive flat, wrinkled face with a short, turned-up or rounded muzzle, prominent black nose, and large, round eyes.",
            "The Japanese Chin is a small dog with a flat face, large eyes, short curved muzzle, and a silky coat, often giving a \"smiling\" expression.",
            "The Japanese Chin has a small, round head, flat face, large eyes, short, curved muzzle, and tail, with a silky, single-layer coat, featuring a distinctive \"stop\" at the eyes.",
            "A Japanese Chin is a small dog with a flat, rounded skull, large dark eyes, short curved muzzle, black nose, and a long, silky coat with a distinctive \"fall\" on its back.",
            "A Japanese Chin has a soft, silky, and fine coat with a smooth, velvety texture, subtle sheen, and delicate ruff, often described as \"satin-like\" or \"glossy\"."
        ],
        "structure": [
            [
                {
                    "A": "The Japanese Chin",
                    "R": "has",
                    "B": "a distinctive flat, wrinkled face"
                },
                {
                    "A": "a distinctive flat, wrinkled face",
                    "R": "with",
                    "B": "a short, turned-up or rounded muzzle"
                },
                {
                    "A": "a short, turned-up or rounded muzzle",
                    "R": "and",
                    "B": "prominent black nose"
                },
                {
                    "A": "a short, turned-up or rounded muzzle",
                    "R": "and",
                    "B": "large, round eyes"
                }
            ],
            [
                {
                    "A": "The Japanese Chin",
                    "R": "is",
                    "B": "a small dog"
                },
                {
                    "A": "a small dog",
                    "R": "has",
                    "B": "a flat face"
                },
                {
                    "A": "a small dog",
                    "R": "has",
                    "B": "large eyes"
                },
                {
                    "A": "a small dog",
                    "R": "has",
                    "B": "short curved muzzle"
                },
                {
                    "A": "a small dog",
                    "R": "has",
                    "B": "a silky coat"
                },
                {
                    "A": "a small dog",
                    "R": "gives",
                    "B": "a'smiling' expression"
                }
            ],
            [
                {
                    "A": "The Japanese Chin",
                    "R": "has",
                    "B": "a small, round head"
                },
                {
                    "A": "a small, round head",
                    "R": "has",
                    "B": "flat face"
                },
                {
                    "A": "a small, round head",
                    "R": "has",
                    "B": "large eyes"
                },
                {
                    "A": "a small, round head",
                    "R": "has",
                    "B": "short, curved muzzle"
                },
                {
                    "A": "a small, round head",
                    "R": "has",
                    "B": "and tail"
                },
                {
                    "A": "a small, round head",
                    "R": "has",
                    "B": "with a silky, single-layer coat"
                },
                {
                    "A": "a small, round head",
                    "R": "has",
                    "B": "featuring a distinctive \"stop\" at the eyes"
                }
            ],
            [
                {
                    "A": "Japanese Chin",
                    "R": "is",
                    "B": "a small dog"
                },
                {
                    "A": "Japanese Chin",
                    "R": "has",
                    "B": "a flat, rounded skull"
                },
                {
                    "A": "Japanese Chin",
                    "R": "has",
                    "B": "large dark eyes"
                },
                {
                    "A": "Japanese Chin",
                    "R": "has",
                    "B": "short curved muzzle"
                },
                {
                    "A": "Japanese Chin",
                    "R": "has",
                    "B": "black nose"
                },
                {
                    "A": "Japanese Chin",
                    "R": "has",
                    "B": "a long, silky coat"
                },
                {
                    "A": "Japanese Chin",
                    "R": "has",
                    "B": "a distinctive 'fall' on its back"
                }
            ],
            [
                {
                    "A": "A Japanese Chin",
                    "R": "has",
                    "B": "soft, silky, and fine coat"
                },
                {
                    "A": "soft, silky, and fine coat",
                    "R": "with",
                    "B": "smooth, velvety texture"
                },
                {
                    "A": "smooth, velvety texture",
                    "R": "and",
                    "B": "subtle sheen"
                },
                {
                    "A": "smooth, velvety texture",
                    "R": "and",
                    "B": "delicate ruff"
                },
                {
                    "A": "smooth, velvety texture, subtle sheen, and delicate ruff",
                    "R": "often described as",
                    "B": "satin-like or glossy"
                }
            ]
        ]
    },
    "keeshond": {
        "coarse_description": [
            "The distinctive silver-gray \"ruff\" around a pet Keeshond's neck is a unique visual cue among all types of pets.",
            "A pet Keeshond has a thick, double coat, silver-gray fur, and a distinctive \"smiling\" face with a black mask.",
            "A pet Keeshond has a thick, silver-gray coat with a black tip, a rounded head, and a bushy tail.",
            "A pet Keeshond has a thick, fluffy double coat, silver-gray fur, and a distinctive black \"saddle\" on its back.",
            "Pet Keeshonds typically have a thick, double coat with a soft, dense undercoat and a harsh, straight outer coat."
        ],
        "fine_description": [
            "A pet keeshond's distinctive silver-gray coat has a distinctive \"lynx\" tip on each guard hair, giving a silky sheen.",
            "The Keeshond has a thick, double coat with a silver-gray base color and black tips, giving a fox-like appearance.",
            "A pet keeshond has a thick, double coat with a silver-gray color and a distinctive black mask on its face.",
            "A pet Keeshond has a thick, double coat with a silvery-gray color, and a distinctive black mask on its face.",
            "A pet Keeshond's coat typically features a soft, dense, and fluffy texture with a silky sheen."
        ],
        "overall_description": [
            "A Keeshond has a distinctive silver-gray coat with a ruff around the neck and a silky sheen due to the \"lynx\" tip on each guard hair, setting it apart from other pets.",
            "The Keeshond is a medium-sized dog with a thick, double coat featuring silver-gray fur with black tips, a distinctive \"smiling\" face, and a black mask, giving a fox-like appearance.",
            "A Keeshond is a pet with a thick, double silver-gray coat, black-tipped fur, a rounded head, bushy tail, and distinctive black mask on its face.",
            "A Keeshond is a medium-sized dog with a thick, fluffy double coat, silvery-gray color, and distinctive features including a black \"saddle\" on its back and a black mask on its face.",
            "A Keeshond's coat is typically thick and double-layered, featuring a soft, dense undercoat and a harsh, straight outer coat with a silky sheen and fluffy texture."
        ],
        "structure": [
            [
                {
                    "A": "A Keeshond",
                    "R": "has",
                    "B": "distinctive silver-gray coat"
                },
                {
                    "A": "distinctive silver-gray coat",
                    "R": "with",
                    "B": "a ruff around the neck"
                },
                {
                    "A": "a ruff around the neck",
                    "R": "and",
                    "B": "a silky sheen"
                },
                {
                    "A": "a silky sheen",
                    "R": "due to",
                    "B": "the 'lynx' tip on each guard hair"
                },
                {
                    "A": "the 'lynx' tip on each guard hair",
                    "R": "on",
                    "B": "each guard hair"
                },
                {
                    "A": "each guard hair",
                    "R": "setting",
                    "B": "it apart from other pets"
                }
            ],
            [
                {
                    "A": "The Keeshond",
                    "R": "is",
                    "B": "a medium-sized dog"
                },
                {
                    "A": "The Keeshond",
                    "R": "has",
                    "B": "a thick, double coat"
                },
                {
                    "A": "a thick, double coat",
                    "R": "featuring",
                    "B": "silver-gray fur with black tips"
                },
                {
                    "A": "a thick, double coat",
                    "R": "featuring",
                    "B": "a distinctive'smiling' face"
                },
                {
                    "A": "a thick, double coat",
                    "R": "featuring",
                    "B": "a black mask"
                },
                {
                    "A": "a thick, double coat",
                    "R": "giving",
                    "B": "a fox-like appearance"
                }
            ],
            [
                {
                    "A": "A Keeshond",
                    "R": "is",
                    "B": "a pet"
                },
                {
                    "A": "a Keeshond",
                    "R": "has",
                    "B": "a thick, double silver-gray coat"
                },
                {
                    "A": "a Keeshond",
                    "R": "has",
                    "B": "black-tipped fur"
                },
                {
                    "A": "a Keeshond",
                    "R": "has",
                    "B": "a rounded head"
                },
                {
                    "A": "a Keeshond",
                    "R": "has",
                    "B": "a bushy tail"
                },
                {
                    "A": "a Keeshond",
                    "R": "has",
                    "B": "a distinctive black mask on its face"
                }
            ],
            [
                {
                    "A": "Keeshond",
                    "R": "is",
                    "B": "a medium-sized dog"
                },
                {
                    "A": "Keeshond",
                    "R": "has",
                    "B": "a thick, fluffy double coat"
                },
                {
                    "A": "Keeshond",
                    "R": "has",
                    "B": "silvery-gray color"
                },
                {
                    "A": "Keeshond",
                    "R": "has",
                    "B": "distinctive features"
                },
                {
                    "A": "Keeshond",
                    "R": "includes",
                    "B": "a black'saddle' on its back"
                },
                {
                    "A": "Keeshond",
                    "R": "includes",
                    "B": "a black mask on its face"
                }
            ],
            [
                {
                    "A": "A Keeshond's coat",
                    "R": "is",
                    "B": "typically thick and double-layered"
                },
                {
                    "A": "A Keeshond's coat",
                    "R": "featuring",
                    "B": "a soft, dense undercoat"
                },
                {
                    "A": "A Keeshond's coat",
                    "R": "featuring",
                    "B": "a harsh, straight outer coat"
                },
                {
                    "A": "A Keeshond's coat",
                    "R": "with",
                    "B": "a silky sheen"
                },
                {
                    "A": "A Keeshond's coat",
                    "R": "with",
                    "B": "fluffy texture"
                }
            ]
        ]
    },
    "leonberger": {
        "coarse_description": [
            "A pet Leonberger's unique visual cue is its distinctive shaggy coat with a thick, woolly undercoat and long, coarse outer coat.",
            "A pet Leonberger has a thick, golden coat, sturdy build, and distinctive beard, resembling a giant golden retriever-like dog.",
            "A pet Leonberger has a thick, double coat, golden-brown color, and a distinctive shaggy ruff around its neck.",
            "A pet Leonberger is distinguished by its thick, golden coat, massive size, and distinctive shaggy beard and eyebrows.",
            "Pet Leonbergers typically have a thick, double coat with a soft, dense undercoat and a harsh, wire-like outer coat."
        ],
        "fine_description": [
            "A pet Leonberger's distinctive feature is its striking lion-like ruff around the neck, forming a majestic mane.",
            "The Leonberger has a thick, golden coat with a distinctive ruff around its neck and a bushy tail.",
            "A Leonberger's thick, golden coat features a distinctive ruff and feathering, with a bushy tail and prominent eyebrows.",
            "A Leonberger has a thick, golden coat with a distinctive ruff around the neck and a bushy tail.",
            "A Leonberger's coat typically features a thick, soft, and curly texture with a silky sheen."
        ],
        "overall_description": [
            "A Leonberger is a majestic dog with a shaggy, thick-coated body and a striking lion-like ruff around its neck, resembling a majestic mane.",
            "A Leonberger is a large dog with a thick, golden coat, sturdy build, distinctive beard, ruff around its neck, and bushy tail, resembling a giant golden retriever-like dog.",
            "A Leonberger has a thick, double coat with a golden-brown color, featuring a distinctive shaggy ruff around its neck, feathering, bushy tail, and prominent eyebrows.",
            "A Leonberger is a large dog with a thick, golden coat, distinctive shaggy beard and eyebrows, and a bushy tail, featuring a ruff around the neck.",
            "A Leonberger's coat is typically thick, with a soft and dense undercoat, a harsh outer coat, and a curly texture with a silky sheen."
        ],
        "structure": [
            [
                {
                    "A": "A Leonberger",
                    "R": "is",
                    "B": "a majestic dog"
                },
                {
                    "A": "A Leonberger",
                    "R": "has",
                    "B": "a shaggy, thick-coated body"
                },
                {
                    "A": "A Leonberger",
                    "R": "has",
                    "B": "a striking lion-like ruff around its neck"
                },
                {
                    "A": "A Leonberger",
                    "R": "resembling",
                    "B": "a majestic mane"
                }
            ],
            [
                {
                    "A": "A Leonberger",
                    "R": "is",
                    "B": "a large dog"
                },
                {
                    "A": "A Leonberger",
                    "R": "has",
                    "B": "a thick, golden coat"
                },
                {
                    "A": "A Leonberger",
                    "R": "has",
                    "B": "sturdy build"
                },
                {
                    "A": "A Leonberger",
                    "R": "has",
                    "B": "distinctive beard"
                },
                {
                    "A": "A Leonberger",
                    "R": "has",
                    "B": "ruff around its neck"
                },
                {
                    "A": "A Leonberger",
                    "R": "has",
                    "B": "bushy tail"
                },
                {
                    "A": "A Leonberger",
                    "R": "resembles",
                    "B": "a giant golden retriever-like dog"
                }
            ],
            [
                {
                    "A": "Leonberger",
                    "R": "has",
                    "B": "thick, double coat"
                },
                {
                    "A": "thick, double coat",
                    "R": "with",
                    "B": "golden-brown color"
                },
                {
                    "A": "Leonberger",
                    "R": "features",
                    "B": "distinctive shaggy ruff around its neck"
                },
                {
                    "A": "Leonberger",
                    "R": "features",
                    "B": "feathering"
                },
                {
                    "A": "Leonberger",
                    "R": "features",
                    "B": "bushy tail"
                },
                {
                    "A": "Leonberger",
                    "R": "features",
                    "B": "prominent eyebrows"
                }
            ],
            [
                {
                    "A": "Leonberger",
                    "R": "is",
                    "B": "a large dog"
                },
                {
                    "A": "Leonberger",
                    "R": "has",
                    "B": "a thick, golden coat"
                },
                {
                    "A": "Leonberger",
                    "R": "has",
                    "B": "distinctive shaggy beard and eyebrows"
                },
                {
                    "A": "Leonberger",
                    "R": "has",
                    "B": "a bushy tail"
                },
                {
                    "A": "Leonberger",
                    "R": "features",
                    "B": "a ruff around the neck"
                }
            ],
            [
                {
                    "A": "A Leonberger's coat",
                    "R": "is",
                    "B": "typically thick"
                },
                {
                    "A": "A Leonberger's coat",
                    "R": "has",
                    "B": "a soft and dense undercoat"
                },
                {
                    "A": "A Leonberger's coat",
                    "R": "has",
                    "B": "a harsh outer coat"
                },
                {
                    "A": "A Leonberger's coat",
                    "R": "has",
                    "B": "a curly texture"
                },
                {
                    "A": "A Leonberger's coat",
                    "R": "has",
                    "B": "a silky sheen"
                }
            ]
        ]
    },
    "maine coon": {
        "coarse_description": [
            "A pet Maine Coon's distinctive shaggy ruff around the neck, resembling a lion's mane, sets it apart from other felines.",
            "Maine Coon cats have a distinctive shaggy coat, large size, and bushy tail, setting them apart from other feline breeds.",
            "A pet Maine Coon is characterized by its distinctive shaggy coat, large size, and bushy tail with a distinctive \"M\" marking.",
            "A pet Maine Coon is distinguished by its large size, fluffy coat, and distinctive shaggy ruff around its neck.",
            "Maine Coon cats typically have a soft, thick, and plush coat with a velvety texture and subtle sheen."
        ],
        "fine_description": [
            "The pet Maine Coon's distinctive shaggy ruff framing its face is a unique visual characteristic.",
            "The Maine Coon has a distinctive shaggy coat with a ruff around the neck, resembling a lion's mane.",
            "A pet Maine Coon has a sturdy, muscular body with a distinctive shaggy coat and a bushy tail.",
            "A Maine Coon has a distinctive shaggy, water-resistant coat with a ruff around the neck and a bushy tail.",
            "A pet Maine Coon's fur is typically soft, silky, and slightly wavy, with a subtle sheen and gentle ruffling."
        ],
        "overall_description": [
            "The Maine Coon has a distinctive shaggy ruff around its neck and face, resembling a lion's mane, setting it apart from other felines with its unique visual characteristic.",
            "The Maine Coon is a large, majestic feline with a distinctive shaggy coat, bushy tail, and a ruff-like mane around the neck, reminiscent of a lion's.",
            "A Maine Coon is a large, sturdy cat with a distinctive shaggy coat, bushy tail, and \"M\" marking, characterized by its muscular body and impressive size.",
            "A Maine Coon is a large cat with a fluffy, shaggy, and water-resistant coat, featuring a distinctive ruff around its neck and a bushy tail.",
            "Maine Coon cats have a soft, thick, plush coat with a velvety texture, subtle sheen, and gentle ruffling, characterized by silky and slightly wavy fur."
        ],
        "structure": [
            [
                {
                    "A": "Maine Coon",
                    "R": "has",
                    "B": "distinctive shaggy ruff"
                },
                {
                    "A": "Maine Coon",
                    "R": "has",
                    "B": "neck and face"
                },
                {
                    "A": "Maine Coon",
                    "R": "resembling",
                    "B": "lion's mane"
                },
                {
                    "A": "Maine Coon",
                    "R": "setting it apart",
                    "B": "other felines"
                },
                {
                    "A": "Maine Coon",
                    "R": "with",
                    "B": "unique visual characteristic"
                }
            ],
            [
                {
                    "A": "Maine Coon",
                    "R": "is",
                    "B": "a large, majestic feline"
                },
                {
                    "A": "Maine Coon",
                    "R": "has",
                    "B": "a distinctive shaggy coat"
                },
                {
                    "A": "Maine Coon",
                    "R": "has",
                    "B": "bushy tail"
                },
                {
                    "A": "Maine Coon",
                    "R": "has",
                    "B": "a ruff-like mane around the neck"
                },
                {
                    "A": "Maine Coon",
                    "R": "reminds",
                    "B": "of a lion's"
                }
            ],
            [
                {
                    "A": "Maine Coon",
                    "R": "is",
                    "B": "a large, sturdy cat"
                },
                {
                    "A": "Maine Coon",
                    "R": "has",
                    "B": "a distinctive shaggy coat"
                },
                {
                    "A": "Maine Coon",
                    "R": "has",
                    "B": "bushy tail"
                },
                {
                    "A": "Maine Coon",
                    "R": "has",
                    "B": "an 'M' marking"
                },
                {
                    "A": "Maine Coon",
                    "R": "is",
                    "B": "characterized by its muscular body"
                },
                {
                    "A": "Maine Coon",
                    "R": "is",
                    "B": "impressive size"
                }
            ],
            [
                {
                    "A": "Maine Coon",
                    "R": "is",
                    "B": "a large cat"
                },
                {
                    "A": "Maine Coon",
                    "R": "has",
                    "B": "a fluffy, shaggy, and water-resistant coat"
                },
                {
                    "A": "coat",
                    "R": "featuring",
                    "B": "a distinctive ruff around its neck"
                },
                {
                    "A": "coat",
                    "R": "featuring",
                    "B": "a bushy tail"
                }
            ],
            [
                {
                    "A": "Maine Coon cats",
                    "R": "have",
                    "B": "soft, thick, plush coat"
                },
                {
                    "A": "soft, thick, plush coat",
                    "R": "with",
                    "B": "velvety texture"
                },
                {
                    "A": "soft, thick, plush coat",
                    "R": "with",
                    "B": "subtle sheen"
                },
                {
                    "A": "soft, thick, plush coat",
                    "R": "with",
                    "B": "gentle ruffling"
                },
                {
                    "A": "soft, thick, plush coat",
                    "R": "characterized by",
                    "B": "silky and slightly wavy fur"
                }
            ]
        ]
    },
    "miniature pinscher": {
        "coarse_description": [
            "A pet miniature pinscher's distinctive fox-like face, with its short, pushed-in nose and large, dark, almond-shaped eyes, is a unique visual cue.",
            "A pet miniature pinscher has a sleek, compact body, short legs, and a distinctive fox-like face with a short muzzle.",
            "A pet miniature pinscher typically has a short, smooth coat, erect ears, and a compact, athletic build with a fox-like face.",
            "A pet miniature pinscher is distinguished by its compact size, short legs, and distinctive fox-like face with a short, smooth coat.",
            "Pet miniature pinschers typically have a smooth, glossy coat with a fine, dense undercoat and a short, straight outer layer."
        ],
        "fine_description": [
            "The miniature pinscher's distinctive fox-like face features a short, pushed-in muzzle with a prominent stop and a black nose.",
            "The miniature pinscher has a sleek, compact body with a short, smooth coat and a distinctive \"otter\" face.",
            "A miniature pinscher has a compact, muscular body with a short, smooth coat and a distinctive black mask on its face.",
            "The miniature pinscher has a compact, muscular body with a short, smooth coat in various colors, often tan or red.",
            "Miniature Pinscher's short, smooth coat has a fine, glossy texture with a subtle sheen, often appearing velvety to the touch."
        ],
        "overall_description": [
            "The miniature pinscher has a distinctive fox-like face with a short, pushed-in muzzle, prominent stop, and large, dark, almond-shaped eyes, featuring a black nose.",
            "A miniature pinscher has a sleek, compact body, short legs, and a distinctive fox-like or otter-like face with a short muzzle and smooth coat.",
            "A miniature pinscher has a short, smooth coat, erect ears, a compact, athletic build, and a distinctive fox-like face with a black mask, characteristic of its muscular and agile body.",
            "The miniature pinscher is a compact dog with a short, smooth coat, distinctive fox-like face, and short legs, featuring a muscular body in various colors, often tan or red.",
            "Miniature Pinschers have a smooth, glossy coat with a fine, dense undercoat and a short, straight outer layer, featuring a fine, velvety texture with a subtle sheen."
        ],
        "structure": [
            [
                {
                    "A": "miniature pinscher",
                    "R": "has",
                    "B": "distinctive fox-like face"
                },
                {
                    "A": "miniature pinscher",
                    "R": "has",
                    "B": "short, pushed-in muzzle"
                },
                {
                    "A": "miniature pinscher",
                    "R": "has",
                    "B": "prominent stop"
                },
                {
                    "A": "miniature pinscher",
                    "R": "has",
                    "B": "large, dark, almond-shaped eyes"
                },
                {
                    "A": "miniature pinscher",
                    "R": "features",
                    "B": "black nose"
                }
            ],
            [
                {
                    "A": "A miniature pinscher",
                    "R": "has",
                    "B": "a sleek, compact body"
                },
                {
                    "A": "A miniature pinscher",
                    "R": "has",
                    "B": "short legs"
                },
                {
                    "A": "A miniature pinscher",
                    "R": "has",
                    "B": "a distinctive fox-like or otter-like face"
                },
                {
                    "A": "A miniature pinscher",
                    "R": "has",
                    "B": "a short muzzle"
                },
                {
                    "A": "A miniature pinscher",
                    "R": "has",
                    "B": "smooth coat"
                }
            ],
            [
                {
                    "A": "A miniature pinscher",
                    "R": "has",
                    "B": "a short, smooth coat"
                },
                {
                    "A": "A miniature pinscher",
                    "R": "has",
                    "B": "erect ears"
                },
                {
                    "A": "A miniature pinscher",
                    "R": "has",
                    "B": "a compact, athletic build"
                },
                {
                    "A": "A miniature pinscher",
                    "R": "has",
                    "B": "a distinctive fox-like face with a black mask"
                },
                {
                    "A": "A miniature pinscher",
                    "R": "has",
                    "B": "a muscular and agile body"
                }
            ],
            [
                {
                    "A": "miniature pinscher",
                    "R": "is",
                    "B": "compact dog"
                },
                {
                    "A": "miniature pinscher",
                    "R": "has",
                    "B": "short, smooth coat"
                },
                {
                    "A": "miniature pinscher",
                    "R": "has",
                    "B": "distinctive fox-like face"
                },
                {
                    "A": "miniature pinscher",
                    "R": "has",
                    "B": "short legs"
                },
                {
                    "A": "miniature pinscher",
                    "R": "features",
                    "B": "muscular body"
                },
                {
                    "A": "miniature pinscher",
                    "R": "is",
                    "B": "often tan or red"
                }
            ],
            [
                {
                    "A": "Miniature Pinschers",
                    "R": "have",
                    "B": "a smooth, glossy coat"
                },
                {
                    "A": "a smooth, glossy coat",
                    "R": "with",
                    "B": "a fine, dense undercoat"
                },
                {
                    "A": "a fine, dense undercoat",
                    "R": "and",
                    "B": "a short, straight outer layer"
                },
                {
                    "A": "a short, straight outer layer",
                    "R": "featuring",
                    "B": "a fine, velvety texture"
                },
                {
                    "A": "a fine, velvety texture",
                    "R": "with",
                    "B": "a subtle sheen"
                }
            ]
        ]
    },
    "newfoundland": {
        "coarse_description": [
            "A pet Newfoundland's distinctive \"otter-like\" tail, which is thick, feathery, and has a distinctive curl at the end.",
            "Pet Newfoundlands have a thick, black coat, a broad head, and a sturdy build, with a distinctive \"otter-like\" tail.",
            "A pet Newfoundland typically has a thick, black or brown coat, a broad head, and a sturdy, muscular body.",
            "A pet Newfoundland is distinguished by its thick, black coat, broad head, and large, webbed paws.",
            "Pet Newfoundlands typically have a thick, soft, and dense double coat with a thick undercoat and a coarse outer layer."
        ],
        "fine_description": [
            "The pet Newfoundland's distinctive visual cue is its thick, feathery double coat with a water-resistant outer layer.",
            "A pet Newfoundland is a large, gentle giant with a thick, black coat and a distinctive \"otter\" tail.",
            "A pet Newfoundland has a thick, water-resistant coat, broad head, and a distinctive \"otter\" tail with a rounded tip.",
            "A pet Newfoundland is characterized by its thick, black coat, broad head, and distinctive \"otter\" tail.",
            "A pet Newfoundland typically has a thick, double coat with a soft, dense undercoat and a coarse, wavy outer layer."
        ],
        "overall_description": [
            "Newfoundland is characterized by its distinctive features, including a thick, feathery double coat with a water-resistant outer layer, and a unique, otter-like tail with a curled end.",
            "Newfoundland is a large, gentle breed with a thick, black coat, broad head, sturdy build, and distinctive \"otter-like\" tail, characterized as a giant with a gentle nature.",
            "A Newfoundland is a large dog with a thick, water-resistant coat, broad head, sturdy body, and distinctive \"otter\" tail with a rounded tip, typically black or brown in color.",
            "A Newfoundland is a large dog with a thick, black coat, broad head, and distinctive features, including webbed paws and an \"otter\" tail, characteristic of its breed.",
            "Newfoundland typically features a thick, soft, and dense double coat with a soft undercoat and a coarse, wavy outer layer, characteristic of its distinctive and iconic appearance."
        ],
        "structure": [
            [
                {
                    "A": "Newfoundland",
                    "R": "is characterized by",
                    "B": "its distinctive features"
                },
                {
                    "A": "its distinctive features",
                    "R": "including",
                    "B": "a thick, feathery double coat with a water-resistant outer layer"
                },
                {
                    "A": "a thick, feathery double coat with a water-resistant outer layer",
                    "R": "with",
                    "B": "a unique, otter-like tail with a curled end"
                },
                {
                    "A": "a unique, otter-like tail with a curled end",
                    "R": "with",
                    "B": "a curled end"
                }
            ],
            [
                {
                    "A": "Newfoundland",
                    "R": "is",
                    "B": "a large, gentle breed"
                },
                {
                    "A": "a large, gentle breed",
                    "R": "with",
                    "B": "a thick, black coat"
                },
                {
                    "A": "a thick, black coat",
                    "R": "has",
                    "B": "broad head"
                },
                {
                    "A": "a thick, black coat",
                    "R": "has",
                    "B": "sturdy build"
                },
                {
                    "A": "a thick, black coat",
                    "R": "has",
                    "B": "distinctive \"otter-like\" tail"
                },
                {
                    "A": "Newfoundland",
                    "R": "is characterized as",
                    "B": "a giant with a gentle nature"
                }
            ],
            [
                {
                    "A": "Newfoundland",
                    "R": "is",
                    "B": "a large dog"
                },
                {
                    "A": "Newfoundland",
                    "R": "has",
                    "B": "thick, water-resistant coat"
                },
                {
                    "A": "Newfoundland",
                    "R": "has",
                    "B": "broad head"
                },
                {
                    "A": "Newfoundland",
                    "R": "has",
                    "B": "sturdy body"
                },
                {
                    "A": "Newfoundland",
                    "R": "has",
                    "B": "distinctive 'otter' tail with a rounded tip"
                },
                {
                    "A": "Newfoundland",
                    "R": "is",
                    "B": "typically black or brown in color"
                }
            ],
            [
                {
                    "A": "Newfoundland",
                    "R": "is",
                    "B": "a large dog"
                },
                {
                    "A": "a large dog",
                    "R": "has",
                    "B": "a thick, black coat"
                },
                {
                    "A": "a large dog",
                    "R": "has",
                    "B": "broad head"
                },
                {
                    "A": "a large dog",
                    "R": "has",
                    "B": "distinctive features"
                },
                {
                    "A": "a large dog",
                    "R": "includes",
                    "B": "webbed paws"
                },
                {
                    "A": "a large dog",
                    "R": "includes",
                    "B": "an 'otter' tail"
                },
                {
                    "A": "a large dog",
                    "R": "is",
                    "B": "characteristic of its breed"
                }
            ],
            [
                {
                    "A": "Newfoundland",
                    "R": "features",
                    "B": "thick, soft, and dense double coat"
                },
                {
                    "A": "thick, soft, and dense double coat",
                    "R": "has",
                    "B": "soft undercoat and a coarse, wavy outer layer"
                },
                {
                    "A": "thick, soft, and dense double coat",
                    "R": "has",
                    "B": "soft undercoat"
                },
                {
                    "A": "thick, soft, and dense double coat",
                    "R": "has",
                    "B": "coarse, wavy outer layer"
                },
                {
                    "A": "Newfoundland",
                    "R": "has",
                    "B": "distinctive and iconic appearance"
                }
            ]
        ]
    },
    "persian": {
        "coarse_description": [
            "The pet Persian's distinctive long, fluffy coat with a flat face and short, upturned tail is a unique visual cue.",
            "Pet Persians have a flat face, long hair, and large eyes, distinguishing them from other short-haired or long-eared breeds.",
            "A pet Persian has a long, fluffy coat, flat face, and large, round eyes with a short, snubbed nose.",
            "A pet Persian is distinguished by its flat face, short snout, large eyes, and long, fluffy white or colored coat.",
            "Pet Persians typically have a soft, silky, and fine coat with a smooth, glossy surface and a velvety texture."
        ],
        "fine_description": [
            "Persian cats have a flat, rounded face with a short, snubbed nose and prominent cheekbones.",
            "A pet Persian has a flat, round face with a short, snubbed nose and large, round eyes.",
            "A pet Persian has a flat face, long, fluffy coat, and large, wide-set eyes with a sweet expression.",
            "A pet Persian is distinguished by its flat face, large eyes, and long, fluffy coat with a distinctive ruff.",
            "Persian cats have a soft, silky, and fine coat with a gentle sheen, often described as \"velvety\" to the touch."
        ],
        "overall_description": [
            "The Persian cat has a distinctive, long, fluffy coat, flat, rounded face with a short, snubbed nose, prominent cheekbones, and a short, upturned tail.",
            "A Persian has a flat, round face with a short, snubbed nose, large, round eyes, and long hair, distinguishing them from other breeds with short hair or long ears.",
            "A Persian cat has a long, fluffy coat, flat face, large, round or wide-set eyes, and a short, snubbed nose, with a sweet expression.",
            "A Persian cat is characterized by its flat face, large eyes, and long, fluffy coat with a distinctive ruff, often in white or colored varieties.",
            "Persian cats have a soft, silky, and fine coat with a smooth, glossy surface, gentle sheen, and velvety texture, offering a luxurious and tactile experience."
        ],
        "structure": [
            [
                {
                    "A": "The Persian cat",
                    "R": "has",
                    "B": "a distinctive"
                },
                {
                    "A": "The Persian cat",
                    "R": "has",
                    "B": "long, fluffy coat"
                },
                {
                    "A": "The Persian cat",
                    "R": "has",
                    "B": "flat, rounded face"
                },
                {
                    "A": "The Persian cat",
                    "R": "has",
                    "B": "a short, snubbed nose"
                },
                {
                    "A": "The Persian cat",
                    "R": "has",
                    "B": "prominent cheekbones"
                },
                {
                    "A": "The Persian cat",
                    "R": "has",
                    "B": "a short, upturned tail"
                }
            ],
            [
                {
                    "A": "A Persian",
                    "R": "has",
                    "B": "a flat, round face"
                },
                {
                    "A": "A Persian",
                    "R": "has",
                    "B": "a short, snubbed nose"
                },
                {
                    "A": "A Persian",
                    "R": "has",
                    "B": "large, round eyes"
                },
                {
                    "A": "A Persian",
                    "R": "has",
                    "B": "long hair"
                },
                {
                    "A": "A Persian",
                    "R": "distinguishing them from",
                    "B": "other breeds with short hair or long ears"
                }
            ],
            [
                {
                    "A": "Persian cat",
                    "R": "has",
                    "B": "a long, fluffy coat"
                },
                {
                    "A": "Persian cat",
                    "R": "has",
                    "B": "flat face"
                },
                {
                    "A": "Persian cat",
                    "R": "has",
                    "B": "large, round or wide-set eyes"
                },
                {
                    "A": "Persian cat",
                    "R": "has",
                    "B": "a short, snubbed nose"
                },
                {
                    "A": "Persian cat",
                    "R": "has",
                    "B": "a sweet expression"
                }
            ],
            [
                {
                    "A": "Persian cat",
                    "R": "is",
                    "B": "characterized"
                },
                {
                    "A": "Persian cat",
                    "R": "has",
                    "B": "flat face"
                },
                {
                    "A": "Persian cat",
                    "R": "has",
                    "B": "large eyes"
                },
                {
                    "A": "Persian cat",
                    "R": "has",
                    "B": "long, fluffy coat"
                },
                {
                    "A": "Persian cat",
                    "R": "has",
                    "B": "distinctive ruff"
                },
                {
                    "A": "Persian cat",
                    "R": "often",
                    "B": "appears in white or colored varieties"
                }
            ],
            [
                {
                    "A": "Persian cats",
                    "R": "have",
                    "B": "soft, silky, and fine coat"
                },
                {
                    "A": "soft, silky, and fine coat",
                    "R": "with",
                    "B": "smooth, glossy surface"
                },
                {
                    "A": "smooth, glossy surface",
                    "R": "and",
                    "B": "gentle sheen"
                },
                {
                    "A": "smooth, glossy surface",
                    "R": "and",
                    "B": "velvety texture"
                },
                {
                    "A": "soft, silky, and fine coat",
                    "R": "with",
                    "B": "luxurious and tactile experience"
                }
            ]
        ]
    },
    "pomeranian": {
        "coarse_description": [
            "The distinctive fox-like face with a short, flat muzzle and a prominent \"fox-like\" forehead is unique to Pomeranians.",
            "A pet Pomeranian has a small, fluffy coat, pointed ears, and a fox-like face with a black \"mask\" on its muzzle.",
            "A pet Pomeranian has a compact, fluffy body, small muzzle, erect ears, and a thick, double coat with a fox-like face.",
            "A pet Pomeranian is distinguished by its small size, fluffy double coat, and distinctive fox-like face with a short muzzle.",
            "Pet Pomeranians typically have a thick, double coat with a soft, fluffy undercoat and a harsh, curly outer coat."
        ],
        "fine_description": [
            "The pet Pomeranian's distinctive fox-like face features a short, pointed muzzle and erect, triangular ears.",
            "The Pomeranian has a compact, fluffy body with a distinctive fox-like face and a plume-like tail.",
            "A pet Pomeranian has a compact, fluffy coat with a fox-like face, pointed ears, and a curved tail.",
            "A pet Pomeranian is distinguished by its compact, fox-like face, small muzzle, and erect, triangular ears.",
            "Pomeranians typically have a thick, double coat with a soft, dense undercoat and a harsh, wiry outer layer."
        ],
        "overall_description": [
            "The Pomeranian has a distinctive fox-like face with a short, pointed muzzle, prominent forehead, and erect, triangular ears, characteristic of its unique and recognizable appearance.",
            "A Pomeranian is a small dog with a compact, fluffy body, pointed ears, a fox-like face with a black muzzle mask, and a plume-like tail.",
            "A pet Pomeranian is a small dog with a compact, fluffy body, fox-like face, pointed ears, and a curved tail, featuring a thick, double coat and erect ears.",
            "A Pomeranian is a small dog with a fluffy double coat, compact fox-like face, short muzzle, and erect triangular ears, characteristic of its distinctive and adorable appearance.",
            "Pomeranians typically have a thick, double coat with a soft, dense undercoat and a harsh, curly or wiry outer layer, with a fluffy or harsh texture."
        ],
        "structure": [
            [
                {
                    "A": "The Pomeranian",
                    "R": "has",
                    "B": "distinctive fox-like face"
                },
                {
                    "A": "distinctive fox-like face",
                    "R": "with",
                    "B": "short, pointed muzzle"
                },
                {
                    "A": "distinctive fox-like face",
                    "R": "with",
                    "B": "prominent forehead"
                },
                {
                    "A": "distinctive fox-like face",
                    "R": "with",
                    "B": "erect, triangular ears"
                },
                {
                    "A": "The Pomeranian",
                    "R": "has",
                    "B": "unique and recognizable appearance"
                }
            ],
            [
                {
                    "A": "Pomeranian",
                    "R": "is",
                    "B": "a small dog"
                },
                {
                    "A": "Pomeranian",
                    "R": "has",
                    "B": "a compact, fluffy body"
                },
                {
                    "A": "Pomeranian",
                    "R": "has",
                    "B": "pointed ears"
                },
                {
                    "A": "Pomeranian",
                    "R": "has",
                    "B": "a fox-like face"
                },
                {
                    "A": "Pomeranian",
                    "R": "has",
                    "B": "a black muzzle mask"
                },
                {
                    "A": "Pomeranian",
                    "R": "has",
                    "B": "a plume-like tail"
                }
            ],
            [
                {
                    "A": "A pet Pomeranian",
                    "R": "is",
                    "B": "a small dog"
                },
                {
                    "A": "a small dog",
                    "R": "with",
                    "B": "a compact, fluffy body"
                },
                {
                    "A": "a compact, fluffy body",
                    "R": "has",
                    "B": "fox-like face"
                },
                {
                    "A": "a compact, fluffy body",
                    "R": "has",
                    "B": "pointed ears"
                },
                {
                    "A": "a compact, fluffy body",
                    "R": "has",
                    "B": "a curved tail"
                },
                {
                    "A": "a small dog",
                    "R": "features",
                    "B": "a thick, double coat"
                },
                {
                    "A": "a small dog",
                    "R": "has",
                    "B": "erect ears"
                }
            ],
            [
                {
                    "A": "A Pomeranian",
                    "R": "is",
                    "B": "a small dog"
                },
                {
                    "A": "A Pomeranian",
                    "R": "has",
                    "B": "a fluffy double coat"
                },
                {
                    "A": "A Pomeranian",
                    "R": "has",
                    "B": "compact fox-like face"
                },
                {
                    "A": "A Pomeranian",
                    "R": "has",
                    "B": "short muzzle"
                },
                {
                    "A": "A Pomeranian",
                    "R": "has",
                    "B": "erect triangular ears"
                },
                {
                    "A": "A Pomeranian",
                    "R": "is",
                    "B": "characteristic of its distinctive and adorable appearance"
                }
            ],
            [
                {
                    "A": "Pomeranians",
                    "R": "have",
                    "B": "thick, double coat"
                },
                {
                    "A": "thick, double coat",
                    "R": "with",
                    "B": "soft, dense undercoat"
                },
                {
                    "A": "thick, double coat",
                    "R": "with",
                    "B": "harsh, curly or wiry outer layer"
                },
                {
                    "A": "thick, double coat",
                    "R": "with",
                    "B": "fluffy or harsh texture"
                }
            ]
        ]
    },
    "pug": {
        "coarse_description": [
            "The unique visual cue of a pet pug is its distinctive wrinkled, curved facial skin, often referred to as \"pug wrinkles.\"",
            "Pet pugs have a distinctive wrinkled face, curled tail, and short, stout body with a flat face and rounded ears.",
            "A pet pug is characterized by its short, curved snout, wrinkled face, and compact, stout body with a curled tail.",
            "A pet pug is distinguished by its short, curved snout, wrinkled face, and small, rounded ears with loose skin.",
            "Pet pugs typically have a smooth, short, and velvety coat with a slightly wrinkled skin on their face and body."
        ],
        "fine_description": [
            "A pet pug is characterized by its distinctive curled tail and wrinkled, rounded facial features.",
            "A pet pug has a compact, wrinkled body with a curved tail and a flat, rounded head.",
            "A pet pug is characterized by its short, curved snout, wrinkled face, and compact, sturdy body with a curly tail.",
            "A pet pug is characterized by its wrinkled, rounded face, short snout, and curled, floppy ears.",
            "Pugs have a soft, velvety coat with a distinctive wrinkled skin, often featuring a smooth, glossy finish."
        ],
        "overall_description": [
            "A pet pug is characterized by its distinctive wrinkled, curved facial skin, curled tail, and rounded facial features, with a unique visual cue being its \"pug wrinkles\".",
            "A pet pug has a compact, wrinkled body, curved tail, and flat, rounded head with rounded ears, featuring a distinctive flat face with prominent wrinkles.",
            "A pet pug is characterized by its short, curved snout, wrinkled face, and compact, sturdy body with a curly tail, featuring a robust build.",
            "A pet pug is characterized by its distinctive features, including a short, curved snout, wrinkled, rounded face, small, rounded ears with loose skin, and curled, floppy ears.",
            "Pugs have a smooth, short, and velvety coat with slightly wrinkled skin on their face and body, featuring a smooth, glossy finish and distinctive wrinkles."
        ],
        "structure": [
            [
                {
                    "A": "pet pug",
                    "R": "is characterized by",
                    "B": "distinctive wrinkled, curved facial skin"
                },
                {
                    "A": "pet pug",
                    "R": "has",
                    "B": "curled tail"
                },
                {
                    "A": "pet pug",
                    "R": "has",
                    "B": "rounded facial features"
                },
                {
                    "A": "pet pug",
                    "R": "has",
                    "B": "unique visual cue being its 'pug wrinkles'"
                }
            ],
            [
                {
                    "A": "pet pug",
                    "R": "has",
                    "B": "compact, wrinkled body"
                },
                {
                    "A": "pet pug",
                    "R": "has",
                    "B": "curved tail"
                },
                {
                    "A": "pet pug",
                    "R": "has",
                    "B": "flat, rounded head"
                },
                {
                    "A": "pet pug",
                    "R": "has",
                    "B": "rounded ears"
                },
                {
                    "A": "pet pug",
                    "R": "features",
                    "B": "distinctive flat face"
                },
                {
                    "A": "pet pug",
                    "R": "features",
                    "B": "prominent wrinkles"
                }
            ],
            [
                {
                    "A": "pet pug",
                    "R": "is characterized by",
                    "B": "its short, curved snout"
                },
                {
                    "A": "pet pug",
                    "R": "has",
                    "B": "wrinkled face"
                },
                {
                    "A": "pet pug",
                    "R": "has",
                    "B": "compact, sturdy body"
                },
                {
                    "A": "pet pug",
                    "R": "has",
                    "B": "a curly tail"
                },
                {
                    "A": "pet pug",
                    "R": "features",
                    "B": "a robust build"
                }
            ],
            [
                {
                    "A": "pet pug",
                    "R": "is",
                    "B": "characterized"
                },
                {
                    "A": "pet pug",
                    "R": "has",
                    "B": "distinctive features"
                },
                {
                    "A": "distinctive features",
                    "R": "including",
                    "B": "a short, curved snout"
                },
                {
                    "A": "distinctive features",
                    "R": "including",
                    "B": "wrinkled, rounded face"
                },
                {
                    "A": "distinctive features",
                    "R": "including",
                    "B": "small, rounded ears with loose skin"
                },
                {
                    "A": "distinctive features",
                    "R": "including",
                    "B": "curled, floppy ears"
                }
            ],
            [
                {
                    "A": "Pugs",
                    "R": "have",
                    "B": "a smooth, short, and velvety coat"
                },
                {
                    "A": "a smooth, short, and velvety coat",
                    "R": "with",
                    "B": "slightly wrinkled skin on their face and body"
                },
                {
                    "A": "slightly wrinkled skin on their face and body",
                    "R": "on",
                    "B": "their face and body"
                },
                {
                    "A": "their face and body",
                    "R": "featuring",
                    "B": "a smooth, glossy finish and distinctive wrinkles"
                },
                {
                    "A": "a smooth, glossy finish and distinctive wrinkles",
                    "R": "",
                    "B": ""
                }
            ]
        ]
    },
    "ragdoll": {
        "coarse_description": [
            "The distinctive M-shaped marking on the forehead, often accompanied by a sweet, soft expression, is unique to pet ragdolls.",
            "Pet ragdolls have a distinctive soft, silky coat and a docile appearance, with a large size and a tendency to go limp when picked up.",
            "A pet ragdoll is characterized by its soft, silky coat, large size, and a distinctive rounded head with a short snout.",
            "A pet ragdoll is distinguished by its soft, silky coat, large size, and distinctive M-shaped forehead marking.",
            "Pet ragdolls typically have a soft, silky, and plush coat with a velvety texture, often described as \"pillowy\" or \"cotton-like\"."
        ],
        "fine_description": [
            "A pet ragdoll's distinctive feature is its soft, silky coat with a unique \"mink\" texture, often described as \"velvety\" to the touch.",
            "Ragdolls have a soft, silky coat with a gentle sheen, often featuring a mink or sepia tone.",
            "Ragdolls have a soft, silky coat with a medium-length, easy-to-maintain texture and a gentle, rounded facial structure.",
            "A pet ragdoll has a soft, silky coat with a medium to long length and a gentle, flowing texture.",
            "Ragdolls have a soft, silky, and plush coat with a subtle sheen, often described as \"velvety\" to the touch."
        ],
        "overall_description": [
            "A pet ragdoll is characterized by its unique M-shaped forehead marking, soft and silky \"mink\" textured coat, and sweet expression, giving it a velvety and endearing appearance.",
            "Ragdolls have a soft, silky coat with a gentle sheen, often featuring a mink or sepia tone, and a docile appearance, with a large size and tendency to go limp when picked up.",
            "A ragdoll is a large cat with a soft, silky coat, medium-length texture, and a distinctive rounded head with a short snout, gentle facial structure, and a gentle appearance.",
            "A pet ragdoll is a large cat with a soft, silky coat of medium to long length, gentle texture, and distinctive M-shaped forehead marking.",
            "Ragdolls have a soft, silky, and plush coat with a velvety texture, often described as \"pillowy\" or \"cotton-like\" with a subtle sheen, feeling \"velvety\" to the touch."
        ],
        "structure": [
            [
                {
                    "A": "pet ragdoll",
                    "R": "is",
                    "B": "characterized"
                },
                {
                    "A": "pet ragdoll",
                    "R": "has",
                    "B": "unique M-shaped forehead marking"
                },
                {
                    "A": "pet ragdoll",
                    "R": "has",
                    "B": "soft and silky mink textured coat"
                },
                {
                    "A": "pet ragdoll",
                    "R": "has",
                    "B": "sweet expression"
                },
                {
                    "A": "pet ragdoll",
                    "R": "gives",
                    "B": "velvety and endearing appearance"
                }
            ],
            [
                {
                    "A": "Ragdolls",
                    "R": "have",
                    "B": "soft, silky coat"
                },
                {
                    "A": "Ragdolls",
                    "R": "have",
                    "B": "gentle sheen"
                },
                {
                    "A": "Ragdolls",
                    "R": "often feature",
                    "B": "mink or sepia tone"
                },
                {
                    "A": "Ragdolls",
                    "R": "have",
                    "B": "docile appearance"
                },
                {
                    "A": "Ragdolls",
                    "R": "have",
                    "B": "large size"
                },
                {
                    "A": "Ragdolls",
                    "R": "tend to",
                    "B": "go limp when picked up"
                }
            ],
            [
                {
                    "A": "A ragdoll",
                    "R": "is",
                    "B": "a large cat"
                },
                {
                    "A": "A ragdoll",
                    "R": "has",
                    "B": "a soft, silky coat"
                },
                {
                    "A": "A ragdoll",
                    "R": "has",
                    "B": "medium-length texture"
                },
                {
                    "A": "A ragdoll",
                    "R": "has",
                    "B": "a distinctive rounded head"
                },
                {
                    "A": "A ragdoll",
                    "R": "has",
                    "B": "a short snout"
                },
                {
                    "A": "A ragdoll",
                    "R": "has",
                    "B": "gentle facial structure"
                },
                {
                    "A": "A ragdoll",
                    "R": "has",
                    "B": "a gentle appearance"
                }
            ],
            [
                {
                    "A": "pet ragdoll",
                    "R": "is",
                    "B": "a large cat"
                },
                {
                    "A": "pet ragdoll",
                    "R": "has",
                    "B": "a soft, silky coat"
                },
                {
                    "A": "pet ragdoll",
                    "R": "has",
                    "B": "of medium to long length"
                },
                {
                    "A": "pet ragdoll",
                    "R": "has",
                    "B": "gentle texture"
                },
                {
                    "A": "pet ragdoll",
                    "R": "has",
                    "B": "and distinctive M-shaped forehead marking"
                }
            ],
            [
                {
                    "A": "Ragdolls",
                    "R": "have",
                    "B": "a soft, silky, and plush coat"
                },
                {
                    "A": "a soft, silky, and plush coat",
                    "R": "with",
                    "B": "a velvety texture"
                },
                {
                    "A": "a velvety texture",
                    "R": "often described as",
                    "B": "\"pillowy\" or \"cotton-like\""
                },
                {
                    "A": "\"pillowy\" or \"cotton-like\"",
                    "R": "with",
                    "B": "a subtle sheen"
                },
                {
                    "A": "a subtle sheen",
                    "R": "feeling",
                    "B": "\"velvety\" to the touch"
                }
            ]
        ]
    },
    "russian blue": {
        "coarse_description": [
            "The distinctive \"smoke\" or \"satin\" coat pattern, featuring a silvery-blue sheen and darker tips on the fur.",
            "A pet Russian Blue has a thick, plush coat with a silver-gray color, green eyes, and a compact, muscular body.",
            "A Russian Blue cat features a thick, plush silver-gray coat, green eyes, and a compact, muscular body.",
            "A pet Russian Blue is distinguished by its thick, plush coat with a silver-blue color and green eyes.",
            "Pet Russian Blues typically have a thick, plush, and silky coat with a smooth, fine texture and a subtle sheen."
        ],
        "fine_description": [
            "The Russian Blue's thick, plush coat has a distinctive silver-tipped undercoat, giving it a soft, misty appearance.",
            "The Russian Blue has a thick, plush double coat with a soft, silvery-gray color and piercing green eyes.",
            "The Russian Blue has a thick, plush coat with a silvery-gray color and a distinctive greenish-yellow eye color.",
            "A Russian Blue cat has a thick, plush coat with a silvery-blue color and piercing green eyes.",
            "Russian Blues have a soft, plush, and velvety coat with a subtle sheen, often described as \"satin-like\" to the touch."
        ],
        "overall_description": [
            "The Russian Blue has a distinctive, thick, plush coat with a silver-tipped undercoat, featuring a silvery-blue sheen, darker tips, and a soft, misty appearance.",
            "A Russian Blue has a thick, plush double coat with a soft, silvery-gray color, piercing green eyes, and a compact, muscular body.",
            "A Russian Blue cat has a thick, plush silvery-gray coat, compact, muscular body, and striking greenish-yellow eyes, with a distinctive color combination and overall sleek appearance.",
            "A Russian Blue cat features a thick, plush coat with a silvery-blue color and piercing green eyes, showcasing its unique and striking physical characteristics.",
            "Russian Blues have a thick, soft, plush, and silky coat with a smooth, fine texture and subtle sheen, often described as \"satin-like\" to the touch."
        ],
        "structure": [
            [
                {
                    "A": "The Russian Blue",
                    "R": "has",
                    "B": "distinctive, thick, plush coat"
                },
                {
                    "A": "distinctive, thick, plush coat",
                    "R": "with",
                    "B": "a silver-tipped undercoat"
                },
                {
                    "A": "a silver-tipped undercoat",
                    "R": "featuring",
                    "B": "a silvery-blue sheen"
                },
                {
                    "A": "a silvery-blue sheen",
                    "R": "and",
                    "B": "darker tips"
                },
                {
                    "A": "darker tips",
                    "R": "and",
                    "B": "a soft, misty appearance"
                }
            ],
            [
                {
                    "A": "A Russian Blue",
                    "R": "has",
                    "B": "a thick, plush double coat"
                },
                {
                    "A": "A Russian Blue",
                    "R": "has",
                    "B": "a soft, silvery-gray color"
                },
                {
                    "A": "A Russian Blue",
                    "R": "has",
                    "B": "piercing green eyes"
                },
                {
                    "A": "A Russian Blue",
                    "R": "has",
                    "B": "a compact, muscular body"
                }
            ],
            [
                {
                    "A": "Russian Blue cat",
                    "R": "has",
                    "B": "thick, plush silvery-gray coat"
                },
                {
                    "A": "Russian Blue cat",
                    "R": "has",
                    "B": "compact, muscular body"
                },
                {
                    "A": "Russian Blue cat",
                    "R": "has",
                    "B": "striking greenish-yellow eyes"
                },
                {
                    "A": "Russian Blue cat",
                    "R": "has",
                    "B": "distinctive color combination"
                },
                {
                    "A": "Russian Blue cat",
                    "R": "has",
                    "B": "overall sleek appearance"
                }
            ],
            [
                {
                    "A": "A Russian Blue cat",
                    "R": "features",
                    "B": "a thick, plush coat"
                },
                {
                    "A": "A Russian Blue cat",
                    "R": "has",
                    "B": "a silvery-blue color"
                },
                {
                    "A": "A Russian Blue cat",
                    "R": "has",
                    "B": "piercing green eyes"
                },
                {
                    "A": "A Russian Blue cat",
                    "R": "showcases",
                    "B": "its unique and striking physical characteristics"
                }
            ],
            [
                {
                    "A": "Russian Blues",
                    "R": "have",
                    "B": "a thick, soft, plush, and silky coat"
                },
                {
                    "A": "a thick, soft, plush, and silky coat",
                    "R": "with",
                    "B": "a smooth, fine texture and subtle sheen"
                },
                {
                    "A": "a smooth, fine texture and subtle sheen",
                    "R": "is",
                    "B": "often described as'satin-like' to the touch"
                }
            ]
        ]
    },
    "saint bernard": {
        "coarse_description": [
            "A pet Saint Bernard's distinctive visual cue is its shaggy, thick coat with a distinctive white blaze on its forehead.",
            "A pet Saint Bernard typically has a thick, fluffy coat, broad head, and distinctive white patches on its chest and face.",
            "A pet Saint Bernard typically has a thick, fluffy white coat, black mask, and a sturdy, muscular build with a short tail.",
            "A pet Saint Bernard is distinguished by its massive size, thick white coat, and distinctive red and black collar.",
            "Pet Saint Bernards typically have a thick, fluffy, and coarse coat with a distinctive rough texture and a sweet, wrinkled face."
        ],
        "fine_description": [
            "A pet Saint Bernard has a distinctive white patch on its forehead resembling a \"blaze\" or a \"saddle\" shape.",
            "The Saint Bernard has a distinctive white coat with red and black markings, a wrinkled face, and a bushy beard.",
            "A Saint Bernard has a broad, flat head, short, curved muzzle, and a distinctive black \"saddle\" on its back.",
            "A pet Saint Bernard has a distinctive white coat with reddish-brown markings, and a curved tail with a feathered end.",
            "A Saint Bernard's coat features a thick, dense undercoat and a long, coarse outer coat with a rough, wiry texture."
        ],
        "overall_description": [
            "A Saint Bernard is a large breed dog with a shaggy, thick coat and a distinctive white blaze or saddle-shaped patch on its forehead.",
            "A Saint Bernard typically has a thick, fluffy white coat with red and black markings, a broad head, wrinkled face, bushy beard, and distinctive white patches on its chest and face.",
            "A Saint Bernard is a large, muscular dog with a thick white coat, black mask, and distinctive black \"saddle\" on its back, featuring a broad head, short muzzle, and short tail.",
            "A pet Saint Bernard is a large dog with a thick white coat, often featuring reddish-brown markings, and a distinctive curved tail with a feathered end, typically wearing a red and black collar.",
            "A Saint Bernard typically has a thick, fluffy, and coarse coat with a distinctive rough texture, featuring a dense undercoat and long, wiry outer coat, and a sweet, wrinkled face."
        ],
        "structure": [
            [
                {
                    "A": "Saint Bernard",
                    "R": "is",
                    "B": "a large breed dog"
                },
                {
                    "A": "Saint Bernard",
                    "R": "has",
                    "B": "a shaggy, thick coat"
                },
                {
                    "A": "Saint Bernard",
                    "R": "has",
                    "B": "a distinctive white blaze or saddle-shaped patch on its forehead"
                }
            ],
            [
                {
                    "A": "A Saint Bernard",
                    "R": "has",
                    "B": "thick, fluffy white coat"
                },
                {
                    "A": "A Saint Bernard",
                    "R": "has",
                    "B": "red and black markings"
                },
                {
                    "A": "A Saint Bernard",
                    "R": "has",
                    "B": "broad head"
                },
                {
                    "A": "A Saint Bernard",
                    "R": "has",
                    "B": "wrinkled face"
                },
                {
                    "A": "A Saint Bernard",
                    "R": "has",
                    "B": "bushy beard"
                },
                {
                    "A": "A Saint Bernard",
                    "R": "has",
                    "B": "distinctive white patches on its chest and face"
                }
            ],
            [
                {
                    "A": "Saint Bernard",
                    "R": "is",
                    "B": "a large, muscular dog"
                },
                {
                    "A": "a large, muscular dog",
                    "R": "with",
                    "B": "a thick white coat, black mask, and distinctive black \"saddle\" on its back"
                },
                {
                    "A": "a thick white coat, black mask, and distinctive black \"saddle\" on its back",
                    "R": "featuring",
                    "B": "a broad head, short muzzle, and short tail"
                }
            ],
            [
                {
                    "A": "pet Saint Bernard",
                    "R": "is",
                    "B": "a large dog"
                },
                {
                    "A": "pet Saint Bernard",
                    "R": "has",
                    "B": "a thick white coat"
                },
                {
                    "A": "pet Saint Bernard",
                    "R": "features",
                    "B": "reddish-brown markings"
                },
                {
                    "A": "pet Saint Bernard",
                    "R": "has",
                    "B": "a distinctive curved tail with a feathered end"
                },
                {
                    "A": "pet Saint Bernard",
                    "R": "typically wears",
                    "B": "a red and black collar"
                }
            ],
            [
                {
                    "A": "A Saint Bernard",
                    "R": "has",
                    "B": "thick, fluffy, and coarse coat"
                },
                {
                    "A": "A Saint Bernard",
                    "R": "has",
                    "B": "distinctive rough texture"
                },
                {
                    "A": "A Saint Bernard",
                    "R": "features",
                    "B": "dense undercoat"
                },
                {
                    "A": "A Saint Bernard",
                    "R": "features",
                    "B": "long, wiry outer coat"
                },
                {
                    "A": "A Saint Bernard",
                    "R": "has",
                    "B": "sweet, wrinkled face"
                }
            ]
        ]
    },
    "samoyed": {
        "coarse_description": [
            "A pet Samoyed's distinctive white coat features a thick, fluffy undercoat and a long, coarse outer coat with a silvery sheen.",
            "A pet Samoyed has a thick, white coat with a fluffy, fox-like face, and a curly tail.",
            "A pet Samoyed is characterized by its fluffy white coat, curved tail, and triangular ears with rounded tips.",
            "A pet Samoyed is distinguished by its thick, white double coat, erect ears, and fox-like face with a black nose.",
            "Pet Samoyeds typically have a thick, fluffy, and silky coat with a soft, dense, and slightly coarse texture."
        ],
        "fine_description": [
            "A pet Samoyed's thick, cream-colored coat features a distinctive white \"saddle\" shape on its back, framing its neck.",
            "The Samoyed has a fluffy, white coat with a distinctive fox-like face and erect, triangular ears.",
            "A pet Samoyed has a thick, fluffy white coat, triangular ears, and a curved tail with a distinctive \"J\" shape.",
            "A pet samoyed is characterized by its thick, fluffy white coat and triangular ears with rounded tips.",
            "A pet Samoyed typically has a thick, soft, and silky coat with a smooth, velvety texture."
        ],
        "overall_description": [
            "A Samoyed has a thick, fluffy undercoat and a long, coarse outer coat with a silvery sheen, often cream-colored with a distinctive white \"saddle\" shape on its back.",
            "A Samoyed is a breed of dog characterized by its thick, fluffy, white coat, fox-like face, curly tail, and triangular, erect ears.",
            "A Samoyed is a fluffy white dog with a thick coat, triangular ears with rounded tips, and a curved tail with a distinctive \"J\" shape, characteristic of its breed.",
            "A Samoyed is a dog with a thick, fluffy white double coat, triangular ears with rounded tips, a fox-like face with a black nose, and an erect ear posture.",
            "A pet Samoyed has a thick, fluffy, and silky coat with a soft, dense, and slightly coarse to smooth, velvety texture, characterized by its overall luxurious and velvety appearance."
        ],
        "structure": [
            [
                {
                    "A": "Samoyed",
                    "R": "has",
                    "B": "thick, fluffy undercoat"
                },
                {
                    "A": "Samoyed",
                    "R": "has",
                    "B": "long, coarse outer coat"
                },
                {
                    "A": "Samoyed",
                    "R": "has",
                    "B": "silvery sheen"
                },
                {
                    "A": "Samoyed",
                    "R": "is",
                    "B": "often cream-colored"
                },
                {
                    "A": "Samoyed",
                    "R": "has",
                    "B": "distinctive white'saddle' shape on its back"
                }
            ],
            [
                {
                    "A": "A Samoyed",
                    "R": "is",
                    "B": "a breed of dog"
                },
                {
                    "A": "a breed of dog",
                    "R": "characterized by",
                    "B": "its thick, fluffy, white coat"
                },
                {
                    "A": "a breed of dog",
                    "R": "characterized by",
                    "B": "fox-like face"
                },
                {
                    "A": "a breed of dog",
                    "R": "characterized by",
                    "B": "curly tail"
                },
                {
                    "A": "a breed of dog",
                    "R": "characterized by",
                    "B": "triangular, erect ears"
                }
            ],
            [
                {
                    "A": "Samoyed",
                    "R": "is",
                    "B": "a fluffy white dog"
                },
                {
                    "A": "Samoyed",
                    "R": "has",
                    "B": "a thick coat"
                },
                {
                    "A": "Samoyed",
                    "R": "has",
                    "B": "triangular ears with rounded tips"
                },
                {
                    "A": "Samoyed",
                    "R": "has",
                    "B": "a curved tail with a distinctive 'J' shape"
                },
                {
                    "A": "Samoyed",
                    "R": "is",
                    "B": "characteristic of its breed"
                }
            ],
            [
                {
                    "A": "Samoyed",
                    "R": "is",
                    "B": "dog"
                },
                {
                    "A": "Samoyed",
                    "R": "has",
                    "B": "thick, fluffy white double coat"
                },
                {
                    "A": "Samoyed",
                    "R": "has",
                    "B": "triangular ears with rounded tips"
                },
                {
                    "A": "Samoyed",
                    "R": "has",
                    "B": "fox-like face with a black nose"
                },
                {
                    "A": "Samoyed",
                    "R": "has",
                    "B": "erect ear posture"
                }
            ],
            [
                {
                    "A": "pet Samoyed",
                    "R": "has",
                    "B": "thick, fluffy, and silky coat"
                },
                {
                    "A": "thick, fluffy, and silky coat",
                    "R": "with",
                    "B": "soft, dense, and slightly coarse to smooth, velvety texture"
                },
                {
                    "A": "soft, dense, and slightly coarse to smooth, velvety texture",
                    "R": "characterized by",
                    "B": "overall luxurious and velvety appearance"
                }
            ]
        ]
    },
    "scottish terrier": {
        "coarse_description": [
            "The distinctive \"beard\" and \"mustache\" of a Scottish Terrier, formed by its long, flowing facial hair.",
            "A pet Scottish Terrier has a distinctive shaggy coat, erect ears, and a compact, sturdy body with a short, docked tail.",
            "A pet Scottish Terrier typically has a sturdy, compact body, with a short, dense coat and a distinctive beard-like facial hair.",
            "A pet Scottish Terrier is distinguished by its distinctive beard, mustache, and wiry coat, typically red, blue, or wheaten in color.",
            "A pet Scottish Terrier typically has a double coat with a soft, dense undercoat and a wiry, harsh outer coat."
        ],
        "fine_description": [
            "A Scottish Terrier's distinctive \"beard\" and \"mustache\" are prominent, framing its face with a rugged, endearing expression.",
            "The Scottish Terrier has a sturdy, compact body with a distinctive shaggy double coat and a fox-like head.",
            "A Scottish Terrier has a sturdy, compact body with a harsh, wiry coat and distinctive beard-like facial hair.",
            "A Scottish Terrier has a sturdy, compact body with a harsh, wiry coat and distinctive beard-like facial hair.",
            "A Scottish Terrier's coat typically features a harsh, wiry texture with a distinctive beard and mustache."
        ],
        "overall_description": [
            "A Scottish Terrier is characterized by its rugged, endearing expression, framed by a prominent \"beard\" and \"mustache\" formed by long, flowing facial hair.",
            "A Scottish Terrier is a compact, sturdy dog with a distinctive shaggy double coat, erect ears, a fox-like head, and a short, docked tail.",
            "A Scottish Terrier typically has a sturdy, compact body, with a short to harsh, dense to wiry coat, and a distinctive beard-like facial hair.",
            "A Scottish Terrier is a compact dog with a sturdy body, featuring a distinctive beard, mustache, and harsh, wiry coat in red, blue, or wheaten colors.",
            "A Scottish Terrier typically has a double coat with a soft undercoat and a wiry, harsh outer coat, featuring a distinctive beard and mustache."
        ],
        "structure": [
            [
                {
                    "A": "Scottish Terrier",
                    "R": "is characterized by",
                    "B": "its rugged, endearing expression"
                },
                {
                    "A": "its rugged, endearing expression",
                    "R": "framed by",
                    "B": "a prominent 'beard' and'mustache'"
                },
                {
                    "A": "a prominent 'beard' and'mustache'",
                    "R": "formed by",
                    "B": "long, flowing facial hair"
                }
            ],
            [
                {
                    "A": "A Scottish Terrier",
                    "R": "is",
                    "B": "a compact, sturdy dog"
                },
                {
                    "A": "A Scottish Terrier",
                    "R": "has",
                    "B": "a distinctive shaggy double coat"
                },
                {
                    "A": "A Scottish Terrier",
                    "R": "has",
                    "B": "erect ears"
                },
                {
                    "A": "A Scottish Terrier",
                    "R": "has",
                    "B": "a fox-like head"
                },
                {
                    "A": "A Scottish Terrier",
                    "R": "has",
                    "B": "a short, docked tail"
                }
            ],
            [
                {
                    "A": "A Scottish Terrier",
                    "R": "has",
                    "B": "a sturdy, compact body"
                },
                {
                    "A": "A Scottish Terrier",
                    "R": "has",
                    "B": "a short to harsh, dense to wiry coat"
                },
                {
                    "A": "A Scottish Terrier",
                    "R": "has",
                    "B": "a distinctive beard-like facial hair"
                }
            ],
            [
                {
                    "A": "Scottish Terrier",
                    "R": "is",
                    "B": "a compact dog"
                },
                {
                    "A": "a compact dog",
                    "R": "with",
                    "B": "a sturdy body"
                },
                {
                    "A": "a sturdy body",
                    "R": "featuring",
                    "B": "a distinctive beard, mustache, and harsh, wiry coat"
                },
                {
                    "A": "a distinctive beard, mustache, and harsh, wiry coat",
                    "R": "in",
                    "B": "red, blue, or wheaten colors"
                }
            ],
            [
                {
                    "A": "Scottish Terrier",
                    "R": "has",
                    "B": "double coat"
                },
                {
                    "A": "double coat",
                    "R": "with",
                    "B": "soft undercoat"
                },
                {
                    "A": "double coat",
                    "R": "with",
                    "B": "wiry, harsh outer coat"
                },
                {
                    "A": "wiry, harsh outer coat",
                    "R": "featuring",
                    "B": "distinctive beard and mustache"
                }
            ]
        ]
    },
    "shiba inu": {
        "coarse_description": [
            "The fox-like face, with its triangular head, curved muzzle, and erect triangular ears, is unique to Shiba Inus.",
            "A pet Shiba Inu has a fox-like appearance with a curved tail, triangular ears, and a distinctive cream-colored blaze on its forehead.",
            "A pet Shiba Inu typically has a compact body, triangular ears, curved tail, and a fox-like face with a distinctive muzzle.",
            "A pet Shiba Inu is distinguished by its fox-like features, triangular ears, and curled tail, with a reddish-brown coat.",
            "A pet Shiba Inu typically has a thick, double coat with a harsh outer layer and soft undercoat."
        ],
        "fine_description": [
            "Shiba Inus have a distinctive fox-like face with a curved muzzle, accentuated by their prominent, triangular ears.",
            "The Shiba Inu has a compact, muscular body with a distinctive fox-like face, curved tail, and a thick, stiff double coat.",
            "A pet Shiba Inu has a fox-like face, triangular ears, and a curved tail, with a thick double coat of straight, stiff fur.",
            "A pet Shiba Inu is characterized by its fox-like face, triangular ears, and curved tail with a distinctive \"J-shape\".",
            "A Shiba Inu's coat typically features a stiff, straight, and rough texture with a distinctive \"hay\" smell."
        ],
        "overall_description": [
            "The Shiba Inu has a distinctive fox-like face with a triangular head, curved muzzle, and prominent, erect triangular ears, characteristic of its unique and recognizable appearance.",
            "A Shiba Inu is a compact, muscular dog with a fox-like face, curved tail, and distinctive cream-colored blaze on its forehead, featuring a thick, stiff double coat and triangular ears.",
            "A Shiba Inu is a compact dog with a fox-like face, triangular ears, curved tail, and a thick double coat of straight, stiff fur, featuring a distinctive muzzle and overall rugged appearance.",
            "A pet Shiba Inu is characterized by its fox-like features, triangular ears, and curved \"J-shaped\" tail, with a reddish-brown coat, showcasing its distinctive and unique appearance.",
            "A Shiba Inu typically has a thick, double coat with a stiff, straight, and rough texture, featuring a harsh outer layer and soft undercoat, with a distinctive \"hay\" smell."
        ],
        "structure": [
            [
                {
                    "A": "The Shiba Inu",
                    "R": "has",
                    "B": "a distinctive fox-like face"
                },
                {
                    "A": "a distinctive fox-like face",
                    "R": "with",
                    "B": "a triangular head"
                },
                {
                    "A": "a triangular head",
                    "R": "and",
                    "B": "curved muzzle"
                },
                {
                    "A": "curved muzzle",
                    "R": "and",
                    "B": "prominent, erect triangular ears"
                },
                {
                    "A": "prominent, erect triangular ears",
                    "R": "characteristic of",
                    "B": "its unique and recognizable appearance"
                }
            ],
            [
                {
                    "A": "A Shiba Inu",
                    "R": "is",
                    "B": "a compact, muscular dog"
                },
                {
                    "A": "A Shiba Inu",
                    "R": "has",
                    "B": "a fox-like face"
                },
                {
                    "A": "A Shiba Inu",
                    "R": "has",
                    "B": "curved tail"
                },
                {
                    "A": "A Shiba Inu",
                    "R": "has",
                    "B": "distinctive cream-colored blaze on its forehead"
                },
                {
                    "A": "A Shiba Inu",
                    "R": "features",
                    "B": "a thick, stiff double coat"
                },
                {
                    "A": "A Shiba Inu",
                    "R": "has",
                    "B": "triangular ears"
                }
            ],
            [
                {
                    "A": "Shiba Inu",
                    "R": "is",
                    "B": "a compact dog"
                },
                {
                    "A": "Shiba Inu",
                    "R": "has",
                    "B": "a fox-like face"
                },
                {
                    "A": "Shiba Inu",
                    "R": "has",
                    "B": "triangular ears"
                },
                {
                    "A": "Shiba Inu",
                    "R": "has",
                    "B": "curved tail"
                },
                {
                    "A": "Shiba Inu",
                    "R": "has",
                    "B": "a thick double coat"
                },
                {
                    "A": "Shiba Inu",
                    "R": "has",
                    "B": "straight, stiff fur"
                },
                {
                    "A": "Shiba Inu",
                    "R": "features",
                    "B": "a distinctive muzzle"
                },
                {
                    "A": "Shiba Inu",
                    "R": "has",
                    "B": "overall rugged appearance"
                }
            ],
            [
                {
                    "A": "A pet Shiba Inu",
                    "R": "is characterized by",
                    "B": "its fox-like features"
                },
                {
                    "A": "A pet Shiba Inu",
                    "R": "has",
                    "B": "triangular ears"
                },
                {
                    "A": "A pet Shiba Inu",
                    "R": "has",
                    "B": "curved 'J-shaped' tail"
                },
                {
                    "A": "A pet Shiba Inu",
                    "R": "has",
                    "B": "a reddish-brown coat"
                },
                {
                    "A": "A pet Shiba Inu",
                    "R": "showcases",
                    "B": "its distinctive and unique appearance"
                }
            ],
            [
                {
                    "A": "Shiba Inu",
                    "R": "has",
                    "B": "thick, double coat"
                },
                {
                    "A": "thick, double coat",
                    "R": "with",
                    "B": "stiff, straight, and rough texture"
                },
                {
                    "A": "thick, double coat",
                    "R": "with",
                    "B": "harsh outer layer and soft undercoat"
                },
                {
                    "A": "thick, double coat",
                    "R": "with",
                    "B": "distinctive 'hay' smell"
                },
                {
                    "A": "stiff, straight, and rough texture",
                    "R": "with",
                    "B": "harsh outer layer and soft undercoat"
                }
            ]
        ]
    },
    "siamese": {
        "coarse_description": [
            "A pet Siamese cat's unique visual cue is its striking cream-colored body with a darker brown or seal-colored \"point\" pattern.",
            "A pet Siamese cat features a sleek, short coat with a cream base color and darker points on face, ears, and tail.",
            "A pet Siamese has a slender, short-haired body with a cream-colored base coat and darker brown or seal points.",
            "A pet Siamese is distinguished by its striking blue eyes and pointy ears, with a cream-colored coat and darker extremities.",
            "Pet Siamese cats typically have a short, fine, and smooth coat with a silky texture and a subtle sheen."
        ],
        "fine_description": [
            "A pet Siamese cat features a striking blue eyes and pointy ears with a wedge-shaped head.",
            "The Siamese cat has a short, fine coat with a cream-colored base and darker extremities, creating a striking contrast.",
            "A Siamese cat has a slender build, short coat with cream-colored base and darker extremities, and almond-shaped eyes.",
            "A Siamese cat has a sleek, short-haired coat with a cream or white base color and darker extremities.",
            "A Siamese cat's coat features a smooth, glossy texture with a fine, silky sheen."
        ],
        "overall_description": [
            "A Siamese cat is characterized by its cream-colored body with darker brown or seal-colored points, striking blue eyes, and distinctive pointy ears and wedge-shaped head.",
            "A Siamese cat has a short, fine coat with a cream-colored base and darker points on the face, ears, tail, and extremities, creating a striking contrast.",
            "A Siamese cat is a slender, short-haired feline with a cream-colored base coat and darker brown or seal points, almond-shaped eyes, and a cream-colored base with darker extremities.",
            "A Siamese cat is characterized by its striking blue eyes, pointy ears, and sleek, short-haired coat with a cream or white base color and darker extremities.",
            "A Siamese cat's coat is characterized by a short, fine, smooth, and silky texture with a subtle to glossy sheen, featuring a smooth, fine, and silky sheen."
        ],
        "structure": [
            [
                {
                    "A": "Siamese cat",
                    "R": "is",
                    "B": "characterized"
                },
                {
                    "A": "characterized",
                    "R": "by",
                    "B": "its cream-colored body"
                },
                {
                    "A": "its cream-colored body",
                    "R": "with",
                    "B": "darker brown or seal-colored points"
                },
                {
                    "A": "its cream-colored body",
                    "R": "with",
                    "B": "striking blue eyes"
                },
                {
                    "A": "its cream-colored body",
                    "R": "and",
                    "B": "distinctive pointy ears"
                },
                {
                    "A": "its cream-colored body",
                    "R": "and",
                    "B": "wedge-shaped head"
                }
            ],
            [
                {
                    "A": "Siamese cat",
                    "R": "has",
                    "B": "short, fine coat"
                },
                {
                    "A": "short, fine coat",
                    "R": "with",
                    "B": "cream-colored base"
                },
                {
                    "A": "short, fine coat",
                    "R": "with",
                    "B": "darker points"
                },
                {
                    "A": "darker points",
                    "R": "on",
                    "B": "face"
                },
                {
                    "A": "darker points",
                    "R": "on",
                    "B": "ears"
                },
                {
                    "A": "darker points",
                    "R": "on",
                    "B": "tail"
                },
                {
                    "A": "darker points",
                    "R": "on",
                    "B": "extremities"
                },
                {
                    "A": "Siamese cat",
                    "R": "creating",
                    "B": "striking contrast"
                }
            ],
            [
                {
                    "A": "Siamese cat",
                    "R": "is",
                    "B": "a slender, short-haired feline"
                },
                {
                    "A": "a slender, short-haired feline",
                    "R": "with",
                    "B": "a cream-colored base coat"
                },
                {
                    "A": "a cream-colored base coat",
                    "R": "and",
                    "B": "darker brown or seal points"
                },
                {
                    "A": "a cream-colored base coat",
                    "R": "and",
                    "B": "almond-shaped eyes"
                },
                {
                    "A": "a cream-colored base coat",
                    "R": "with",
                    "B": "darker extremities"
                },
                {
                    "A": "a slender, short-haired feline",
                    "R": "with",
                    "B": "a cream-colored base coat and darker extremities"
                }
            ],
            [
                {
                    "A": "Siamese cat",
                    "R": "is characterized by",
                    "B": "its striking blue eyes"
                },
                {
                    "A": "Siamese cat",
                    "R": "has",
                    "B": "pointy ears"
                },
                {
                    "A": "Siamese cat",
                    "R": "has",
                    "B": "sleek, short-haired coat"
                },
                {
                    "A": "sleek, short-haired coat",
                    "R": "has",
                    "B": "a cream or white base color"
                },
                {
                    "A": "sleek, short-haired coat",
                    "R": "has",
                    "B": "darker extremities"
                }
            ],
            [
                {
                    "A": "Siamese cat's coat",
                    "R": "is characterized by",
                    "B": "short, fine, smooth, and silky texture"
                },
                {
                    "A": "Siamese cat's coat",
                    "R": "has",
                    "B": "subtle to glossy sheen"
                },
                {
                    "A": "Siamese cat's coat",
                    "R": "features",
                    "B": "smooth, fine, and silky sheen"
                }
            ]
        ]
    },
    "sphynx": {
        "coarse_description": [
            "The pet Sphynx's unique visual cue is its sleek, wrinkled, and hairless skin, often appearing like a soft, pink suede.",
            "Pet Sphynx cats lack fur, with wrinkled, pink skin, large ears, and a sleek, muscular body.",
            "A pet Sphynx is characterized by its sleek, wrinkled, and almost hairless skin, often with a pinkish or greyish tone.",
            "A pet sphynx is distinguished by its sleek, wrinkled skin, lack of fur, and large ears and eyes.",
            "Pet Sphynx cats typically have a soft, wrinkled, and velvety skin with a subtle sheen, often resembling suede."
        ],
        "fine_description": [
            "The pet Sphynx is distinguished by its sleek, wrinkled skin that appears almost translucent due to its lack of fur.",
            "The Sphynx has a sleek, wrinkled skin with a soft, velvety texture, often appearing almost translucent in certain lighting.",
            "A pet Sphynx has a sleek, wrinkled skin, often pinkish-gray in color, with a wedge-shaped head and large ears.",
            "A pet sphynx is characterized by its sleek, wrinkled skin, lack of fur, and large, almond-shaped eyes.",
            "A pet sphynx has a sleek, velvety, and slightly tacky skin with a subtle sheen, often described as \"buttery\" or \"silky\"."
        ],
        "overall_description": [
            "The Sphynx has a sleek, wrinkled, and hairless skin that appears soft and pink suede-like, often translucent due to its lack of fur, with a unique visual cue that sets it apart from other pets.",
            "The Sphynx has a sleek, wrinkled, and soft, velvety skin with a pinkish hue, large ears, and a muscular body, often appearing translucent in certain lighting.",
            "A pet Sphynx is characterized by its sleek, wrinkled, and almost hairless skin, often pinkish-gray in color, with a wedge-shaped head and large ears.",
            "A pet sphynx is a unique cat with sleek, wrinkled skin, no fur, large ears, and almond-shaped eyes, showcasing its distinctive physical characteristics.",
            "Pet Sphynx cats have a soft, velvety, and slightly tacky skin with a subtle sheen, often described as \"buttery\" or \"silky\", with a wrinkled texture resembling suede."
        ],
        "structure": [
            [
                {
                    "A": "The Sphynx",
                    "R": "has",
                    "B": "sleek, wrinkled, and hairless skin"
                },
                {
                    "A": "sleek, wrinkled, and hairless skin",
                    "R": "appears",
                    "B": "soft and pink suede-like"
                },
                {
                    "A": "sleek, wrinkled, and hairless skin",
                    "R": "is",
                    "B": "often translucent due to its lack of fur"
                },
                {
                    "A": "sleek, wrinkled, and hairless skin",
                    "R": "has",
                    "B": "a unique visual cue"
                },
                {
                    "A": "sleek, wrinkled, and hairless skin",
                    "R": "sets it apart",
                    "B": "from other pets"
                }
            ],
            [
                {
                    "A": "The Sphynx",
                    "R": "has",
                    "B": "sleek, wrinkled, and soft, velvety skin"
                },
                {
                    "A": "sleek, wrinkled, and soft, velvety skin",
                    "R": "with",
                    "B": "a pinkish hue"
                },
                {
                    "A": "sleek, wrinkled, and soft, velvety skin",
                    "R": "with",
                    "B": "large ears"
                },
                {
                    "A": "sleek, wrinkled, and soft, velvety skin",
                    "R": "with",
                    "B": "a muscular body"
                },
                {
                    "A": "sleek, wrinkled, and soft, velvety skin",
                    "R": "appearing",
                    "B": "translucent in certain lighting"
                }
            ],
            [
                {
                    "A": "A pet Sphynx",
                    "R": "is",
                    "B": "characterized"
                },
                {
                    "A": "A pet Sphynx",
                    "R": "characterized by",
                    "B": "its sleek, wrinkled, and almost hairless skin"
                },
                {
                    "A": "its sleek, wrinkled, and almost hairless skin",
                    "R": "is",
                    "B": "often pinkish-gray in color"
                },
                {
                    "A": "its sleek, wrinkled, and almost hairless skin",
                    "R": "has",
                    "B": "a wedge-shaped head"
                },
                {
                    "A": "its sleek, wrinkled, and almost hairless skin",
                    "R": "has",
                    "B": "large ears"
                }
            ],
            [
                {
                    "A": "pet sphynx",
                    "R": "is",
                    "B": "a unique cat"
                },
                {
                    "A": "a unique cat",
                    "R": "with",
                    "B": "sleek, wrinkled skin"
                },
                {
                    "A": "a unique cat",
                    "R": "with",
                    "B": "no fur"
                },
                {
                    "A": "a unique cat",
                    "R": "with",
                    "B": "large ears"
                },
                {
                    "A": "a unique cat",
                    "R": "with",
                    "B": "almond-shaped eyes"
                },
                {
                    "A": "a unique cat",
                    "R": "showcasing",
                    "B": "its distinctive physical characteristics"
                }
            ],
            [
                {
                    "A": "Pet Sphynx cats",
                    "R": "have",
                    "B": "soft, velvety, and slightly tacky skin"
                },
                {
                    "A": "soft, velvety, and slightly tacky skin",
                    "R": "with",
                    "B": "subtle sheen"
                },
                {
                    "A": "soft, velvety, and slightly tacky skin",
                    "R": "is",
                    "B": "often described as 'buttery' or'silky'"
                },
                {
                    "A": "soft, velvety, and slightly tacky skin",
                    "R": "has",
                    "B": "wrinkled texture resembling suede"
                }
            ]
        ]
    },
    "staffordshire bull terrier": {
        "coarse_description": [
            "The distinctive \"stop\" or \"break\" in the muzzle, where the nose and forehead meet, is unique to Staffordshire Bull Terriers.",
            "Pet Staffordshire Bull Terriers have a distinctive egg-shaped head, muscular build, and a short, smooth coat in various colors.",
            "A Staffordshire Bull Terrier typically has a short, smooth coat, broad head, and muscular build with a distinctive \"apple-domed\" skull.",
            "A pet Staffordshire Bull Terrier is distinguished by its muscular build, short coat, and distinctive \"apple-domed\" head shape.",
            "A pet Staffordshire Bull Terrier typically has a short, smooth, and glossy coat with a subtle sheen."
        ],
        "fine_description": [
            "Staffordshire Bull Terriers have a distinctive \"apple-domed\" head shape with a flat forehead and prominent facial wrinkles.",
            "The Staffordshire Bull Terrier has a sturdy, muscular build with a short, smooth coat and a distinctive \"stop\" at the eyes.",
            "The Staffordshire Bull Terrier has a sturdy, muscular build, short, smooth coat, and distinctive \"rose\" ears.",
            "A Staffordshire Bull Terrier has a muscular build, broad chest, and distinctive \"stop\" at the eyes, with a flat, wrinkled face.",
            "A Staffordshire Bull Terrier's short, smooth coat has a fine, glossy texture with a subtle sheen and gentle ridges."
        ],
        "overall_description": [
            "The Staffordshire Bull Terrier has a unique, \"apple-domed\" head shape with a flat forehead, prominent facial wrinkles, and a distinctive \"stop\" or \"break\" in the muzzle where the nose and forehead meet.",
            "The Staffordshire Bull Terrier has a sturdy, muscular build, distinctive egg-shaped head with a \"stop\" at the eyes, and a short, smooth coat in various colors.",
            "The Staffordshire Bull Terrier is a sturdy, muscular dog with a short, smooth coat, broad \"apple-domed\" skull, and distinctive \"rose\" ears, characterized by its robust build and unique facial features.",
            "A Staffordshire Bull Terrier is a muscular breed with a short coat, distinctive \"apple-domed\" head or flat, wrinkled face, broad chest, and a \"stop\" at the eyes, with a sturdy build overall.",
            "A Staffordshire Bull Terrier typically has a short, smooth, and glossy coat with a subtle sheen, featuring a fine texture and gentle ridges that add to its overall sleek appearance."
        ],
        "structure": [
            [
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "unique, 'apple-domed' head shape"
                },
                {
                    "A": "unique, 'apple-domed' head shape",
                    "R": "with",
                    "B": "flat forehead"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "prominent facial wrinkles"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "a distinctive'stop' or 'break' in the muzzle where the nose and forehead meet"
                }
            ],
            [
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "sturdy, muscular build"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "distinctive egg-shaped head"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "a stop at the eyes"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "a short, smooth coat"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "various colors"
                }
            ],
            [
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "is",
                    "B": "a sturdy, muscular dog"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "a short, smooth coat"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "broad 'apple-domed' skull"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "distinctive 'rose' ears"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "is",
                    "B": "characterized by its robust build"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "unique facial features"
                }
            ],
            [
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "is",
                    "B": "a muscular breed"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "a short coat"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "distinctive 'apple-domed' head"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "or",
                    "B": "flat, wrinkled face"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "broad chest"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "a'stop' at the eyes"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "a sturdy build overall"
                }
            ],
            [
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "short, smooth, and glossy coat"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "features",
                    "B": "fine texture and gentle ridges"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "has",
                    "B": "subtle sheen"
                },
                {
                    "A": "Staffordshire Bull Terrier",
                    "R": "adds to",
                    "B": "overall sleek appearance"
                }
            ]
        ]
    },
    "wheaten terrier": {
        "coarse_description": [
            "The distinctive silvery-gray coat with a warm, honey-like wheaten tint sets a pet Wheaten Terrier apart from other breeds.",
            "Pet Wheaten Terriers have a silky, cream-colored coat, curly tail, and a compact, athletic build with a distinctive beard and mustache.",
            "A pet Wheaten Terrier typically has a single-layered, silky, golden coat and a wedge-shaped head with a black nose.",
            "A pet Wheaten Terrier is distinguished by its silky, golden coat, moderate size, and distinctive fox-like head shape.",
            "Pet Wheaten Terriers typically have a silky, smooth, and fine coat with a subtle sheen and gentle wave."
        ],
        "fine_description": [
            "The pet wheaten terrier's distinctive coat features a lustrous, honey-colored double layer with a silky texture and a subtle wave.",
            "The Wheaten Terrier has a silky, golden coat with a soft, wavy texture and a gentle, fox-like face.",
            "The pet Wheaten Terrier has a silky, single-layer coat with a warm golden color and a curly or wavy texture.",
            "The pet Wheaten Terrier is characterized by its silky, golden coat and moderate-sized build with a distinctive otter-like head.",
            "The pet Wheaten Terrier has a soft, silky, and fine coat with a subtle sheen and a gentle, wavy texture."
        ],
        "overall_description": [
            "A Wheaten Terrier has a distinctive silvery-gray coat with a warm, honey-like tint, featuring a lustrous, honey-colored double layer with a silky texture and subtle wave.",
            "The Wheaten Terrier has a silky, golden to cream-colored coat, curly tail, compact athletic build, and distinctive facial features, including a beard and mustache, with a gentle, fox-like face.",
            "A Wheaten Terrier has a single-layered, silky, golden coat with a warm, curly or wavy texture, and a wedge-shaped head with a black nose.",
            "A Wheaten Terrier is a moderate-sized dog with a silky, golden coat and a distinctive head shape, resembling either a fox or otter, with a moderate build.",
            "The Wheaten Terrier has a soft, silky, smooth, and fine coat with a subtle sheen and gentle, wavy texture, showcasing its gentle and refined appearance."
        ],
        "structure": [
            [
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "distinctive silvery-gray coat"
                },
                {
                    "A": "distinctive silvery-gray coat",
                    "R": "with",
                    "B": "warm, honey-like tint"
                },
                {
                    "A": "distinctive silvery-gray coat",
                    "R": "featuring",
                    "B": "lustrous, honey-colored double layer"
                },
                {
                    "A": "lustrous, honey-colored double layer",
                    "R": "with",
                    "B": "silky texture"
                },
                {
                    "A": "lustrous, honey-colored double layer",
                    "R": "and",
                    "B": "subtle wave"
                }
            ],
            [
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "silky, golden to cream-colored coat"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "curly tail"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "compact athletic build"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "distinctive facial features"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "beard and mustache"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "gentle, fox-like face"
                }
            ],
            [
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "single-layered, silky, golden coat"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "warm, curly or wavy texture"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "wedge-shaped head"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "black nose"
                }
            ],
            [
                {
                    "A": "Wheaten Terrier",
                    "R": "is",
                    "B": "a moderate-sized dog"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "a silky, golden coat"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "a distinctive head shape"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "resembles",
                    "B": "a fox"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "resembles",
                    "B": "an otter"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "a moderate build"
                }
            ],
            [
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "soft, silky, smooth, and fine coat"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "subtle sheen"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "has",
                    "B": "gentle, wavy texture"
                },
                {
                    "A": "Wheaten Terrier",
                    "R": "showcases",
                    "B": "gentle and refined appearance"
                }
            ]
        ]
    },
    "yorkshire terrier": {
        "coarse_description": [
            "The distinctive \"stop\" or \"break\" in a pet Yorkshire Terrier's muzzle, creating a sudden change in facial shape.",
            "A pet Yorkshire Terrier has a silky, fine coat, long and straight muzzle, and large dark eyes, resembling a toy dog.",
            "A pet Yorkshire Terrier has a small, compact body with a silky, fine coat, usually steel blue and tan in color.",
            "A pet Yorkshire Terrier is distinguished by its silky, fine coat, steel-blue and tan coloring, and long, pointed muzzle.",
            "A pet Yorkshire Terrier typically has a silky, fine, and smooth coat with a slightly wiry texture around the ears and tail."
        ],
        "fine_description": [
            "A pet Yorkshire Terrier's silky, fine coat is parted down the middle, with a distinctive \"M\" shape on its forehead.",
            "The Yorkshire Terrier has a silky, fine coat and a delicate, doll-like face with a distinctive \"stop\" at the eyes.",
            "A Yorkshire Terrier typically has a steel-blue and tan coat, silky texture, and a flat, rounded skull with a distinctive muzzle.",
            "A pet Yorkshire terrier has a steel-blue and tan coat, with a silky texture and a distinctive \"saddle\" marking.",
            "A Yorkshire Terrier's coat typically features a silky, fine texture with a soft, smooth sheen."
        ],
        "overall_description": [
            "A Yorkshire Terrier is a small dog with a distinctive \"stop\" in its muzzle, a silky fine coat parted down the middle, and a unique \"M\" shape on its forehead.",
            "A Yorkshire Terrier is a small dog with a silky, fine coat, long and straight muzzle, large dark eyes, and a delicate, doll-like face with a distinctive \"stop\" at the eyes.",
            "A Yorkshire Terrier is a small, compact dog with a silky, fine coat of steel blue and tan color, flat, rounded skull, and distinctive muzzle.",
            "A Yorkshire Terrier is a small dog with a silky, fine steel-blue and tan coat, a long, pointed muzzle, and a distinctive \"saddle\" marking on its back.",
            "A Yorkshire Terrier has a silky, fine, and smooth coat with a slightly wiry texture around the ears and tail, featuring a soft, smooth sheen overall."
        ],
        "structure": [
            [
                {
                    "A": "Yorkshire Terrier",
                    "R": "is",
                    "B": "a small dog"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "a distinctive'stop' in its muzzle"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "a silky fine coat"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "a coat parted down the middle"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "a unique 'M' shape on its forehead"
                }
            ],
            [
                {
                    "A": "Yorkshire Terrier",
                    "R": "is",
                    "B": "a small dog"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "a silky, fine coat"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "long and straight muzzle"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "large dark eyes"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "a delicate, doll-like face"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "a distinctive'stop' at the eyes"
                }
            ],
            [
                {
                    "A": "Yorkshire Terrier",
                    "R": "is",
                    "B": "a small, compact dog"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "a silky, fine coat"
                },
                {
                    "A": "coat",
                    "R": "of",
                    "B": "steel blue and tan color"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "flat, rounded skull"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "distinctive muzzle"
                }
            ],
            [
                {
                    "A": "Yorkshire Terrier",
                    "R": "is",
                    "B": "a small dog"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "a silky, fine steel-blue and tan coat"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "a long, pointed muzzle"
                },
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "a distinctive'saddle' marking on its back"
                }
            ],
            [
                {
                    "A": "Yorkshire Terrier",
                    "R": "has",
                    "B": "coat"
                },
                {
                    "A": "coat",
                    "R": "with",
                    "B": "silty, fine, and smooth"
                },
                {
                    "A": "coat",
                    "R": "with",
                    "B": "sightly wiry texture"
                },
                {
                    "A": "coat",
                    "R": "with",
                    "B": "around the ears and tail"
                },
                {
                    "A": "coat",
                    "R": "featuring",
                    "B": "soft, smooth sheen"
                },
                {
                    "A": "coat",
                    "R": "overall",
                    "B": "soft, smooth sheen"
                }
            ]
        ]
    }
}